/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub type rocprofiler_runtime_initialization_operation_t = ::std::os::raw::c_uint;
pub const rocprofiler_counter_info_version_id_t_ROCPROFILER_COUNTER_INFO_VERSION_NONE:
    rocprofiler_counter_info_version_id_t = 0;
pub const rocprofiler_counter_info_version_id_t_ROCPROFILER_COUNTER_INFO_VERSION_0:
    rocprofiler_counter_info_version_id_t = 1;
pub const rocprofiler_counter_info_version_id_t_ROCPROFILER_COUNTER_INFO_VERSION_1:
    rocprofiler_counter_info_version_id_t = 2;
pub const rocprofiler_counter_info_version_id_t_ROCPROFILER_COUNTER_INFO_VERSION_LAST:
    rocprofiler_counter_info_version_id_t = 3;
pub type rocprofiler_counter_info_version_id_t = ::std::os::raw::c_uint;
pub const rocprofiler_counter_record_kind_t_ROCPROFILER_COUNTER_RECORD_NONE:
    rocprofiler_counter_record_kind_t = 0;
pub const rocprofiler_counter_record_kind_t_ROCPROFILER_COUNTER_RECORD_PROFILE_COUNTING_DISPATCH_HEADER : rocprofiler_counter_record_kind_t = 1 ;
pub const rocprofiler_counter_record_kind_t_ROCPROFILER_COUNTER_RECORD_VALUE:
    rocprofiler_counter_record_kind_t = 2;
pub const rocprofiler_counter_record_kind_t_ROCPROFILER_COUNTER_RECORD_LAST:
    rocprofiler_counter_record_kind_t = 3;
pub type rocprofiler_counter_record_kind_t = ::std::os::raw::c_uint;
pub const rocprofiler_counter_flag_t_ROCPROFILER_COUNTER_FLAG_NONE: rocprofiler_counter_flag_t = 0;
pub const rocprofiler_counter_flag_t_ROCPROFILER_COUNTER_FLAG_ASYNC: rocprofiler_counter_flag_t = 1;
pub const rocprofiler_counter_flag_t_ROCPROFILER_COUNTER_FLAG_APPEND_DEFINITION:
    rocprofiler_counter_flag_t = 2;
pub const rocprofiler_counter_flag_t_ROCPROFILER_COUNTER_FLAG_LAST: rocprofiler_counter_flag_t = 3;
pub type rocprofiler_counter_flag_t = ::std::os::raw::c_uint;
pub const rocprofiler_pc_sampling_record_kind_t_ROCPROFILER_PC_SAMPLING_RECORD_NONE:
    rocprofiler_pc_sampling_record_kind_t = 0;
pub const rocprofiler_pc_sampling_record_kind_t_ROCPROFILER_PC_SAMPLING_RECORD_INVALID_SAMPLE:
    rocprofiler_pc_sampling_record_kind_t = 1;
pub const rocprofiler_pc_sampling_record_kind_t_ROCPROFILER_PC_SAMPLING_RECORD_HOST_TRAP_V0_SAMPLE : rocprofiler_pc_sampling_record_kind_t = 2 ;
pub const rocprofiler_pc_sampling_record_kind_t_ROCPROFILER_PC_SAMPLING_RECORD_STOCHASTIC_V0_SAMPLE : rocprofiler_pc_sampling_record_kind_t = 3 ;
pub const rocprofiler_pc_sampling_record_kind_t_ROCPROFILER_PC_SAMPLING_RECORD_LAST:
    rocprofiler_pc_sampling_record_kind_t = 4;
pub type rocprofiler_pc_sampling_record_kind_t = ::std::os::raw::c_uint;
pub type rocprofiler_timestamp_t = u64;
pub type rocprofiler_thread_id_t = u64;
pub type rocprofiler_tracing_operation_t = i32;
pub type rocprofiler_kernel_id_t = u64;
pub type rocprofiler_dispatch_id_t = u64;
pub type rocprofiler_counter_instance_id_t = u64;
pub type rocprofiler_counter_dimension_id_t = u64;
#[repr(C)]
#[derive(Copy, Clone)]
pub union rocprofiler_user_data_t {
    pub value: u64,
    pub ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_user_data_t"][::std::mem::size_of::<rocprofiler_user_data_t>() - 8usize];
    ["Alignment of rocprofiler_user_data_t"]
        [::std::mem::align_of::<rocprofiler_user_data_t>() - 8usize];
    ["Offset of field: rocprofiler_user_data_t::value"]
        [::std::mem::offset_of!(rocprofiler_user_data_t, value) - 0usize];
    ["Offset of field: rocprofiler_user_data_t::ptr"]
        [::std::mem::offset_of!(rocprofiler_user_data_t, ptr) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union rocprofiler_address_t {
    pub handle: u64,
    pub value: u64,
    pub ptr: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_address_t"][::std::mem::size_of::<rocprofiler_address_t>() - 8usize];
    ["Alignment of rocprofiler_address_t"]
        [::std::mem::align_of::<rocprofiler_address_t>() - 8usize];
    ["Offset of field: rocprofiler_address_t::handle"]
        [::std::mem::offset_of!(rocprofiler_address_t, handle) - 0usize];
    ["Offset of field: rocprofiler_address_t::value"]
        [::std::mem::offset_of!(rocprofiler_address_t, value) - 0usize];
    ["Offset of field: rocprofiler_address_t::ptr"]
        [::std::mem::offset_of!(rocprofiler_address_t, ptr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_uuid_t {
    pub bytes: [u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_uuid_t"][::std::mem::size_of::<rocprofiler_uuid_t>() - 16usize];
    ["Alignment of rocprofiler_uuid_t"][::std::mem::align_of::<rocprofiler_uuid_t>() - 1usize];
    ["Offset of field: rocprofiler_uuid_t::bytes"]
        [::std::mem::offset_of!(rocprofiler_uuid_t, bytes) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_version_triplet_t {
    pub major: u32,
    pub minor: u32,
    pub patch: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_version_triplet_t"]
        [::std::mem::size_of::<rocprofiler_version_triplet_t>() - 12usize];
    ["Alignment of rocprofiler_version_triplet_t"]
        [::std::mem::align_of::<rocprofiler_version_triplet_t>() - 4usize];
    ["Offset of field: rocprofiler_version_triplet_t::major"]
        [::std::mem::offset_of!(rocprofiler_version_triplet_t, major) - 0usize];
    ["Offset of field: rocprofiler_version_triplet_t::minor"]
        [::std::mem::offset_of!(rocprofiler_version_triplet_t, minor) - 4usize];
    ["Offset of field: rocprofiler_version_triplet_t::patch"]
        [::std::mem::offset_of!(rocprofiler_version_triplet_t, patch) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_context_id_t {
    pub handle: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_context_id_t"]
        [::std::mem::size_of::<rocprofiler_context_id_t>() - 8usize];
    ["Alignment of rocprofiler_context_id_t"]
        [::std::mem::align_of::<rocprofiler_context_id_t>() - 8usize];
    ["Offset of field: rocprofiler_context_id_t::handle"]
        [::std::mem::offset_of!(rocprofiler_context_id_t, handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_queue_id_t {
    pub handle: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_queue_id_t"][::std::mem::size_of::<rocprofiler_queue_id_t>() - 8usize];
    ["Alignment of rocprofiler_queue_id_t"]
        [::std::mem::align_of::<rocprofiler_queue_id_t>() - 8usize];
    ["Offset of field: rocprofiler_queue_id_t::handle"]
        [::std::mem::offset_of!(rocprofiler_queue_id_t, handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_stream_id_t {
    pub handle: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_stream_id_t"][::std::mem::size_of::<rocprofiler_stream_id_t>() - 8usize];
    ["Alignment of rocprofiler_stream_id_t"]
        [::std::mem::align_of::<rocprofiler_stream_id_t>() - 8usize];
    ["Offset of field: rocprofiler_stream_id_t::handle"]
        [::std::mem::offset_of!(rocprofiler_stream_id_t, handle) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rocprofiler_correlation_id_t {
    pub internal: u64,
    pub external: rocprofiler_user_data_t,
    pub ancestor: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_correlation_id_t"]
        [::std::mem::size_of::<rocprofiler_correlation_id_t>() - 24usize];
    ["Alignment of rocprofiler_correlation_id_t"]
        [::std::mem::align_of::<rocprofiler_correlation_id_t>() - 8usize];
    ["Offset of field: rocprofiler_correlation_id_t::internal"]
        [::std::mem::offset_of!(rocprofiler_correlation_id_t, internal) - 0usize];
    ["Offset of field: rocprofiler_correlation_id_t::external"]
        [::std::mem::offset_of!(rocprofiler_correlation_id_t, external) - 8usize];
    ["Offset of field: rocprofiler_correlation_id_t::ancestor"]
        [::std::mem::offset_of!(rocprofiler_correlation_id_t, ancestor) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rocprofiler_async_correlation_id_t {
    pub internal: u64,
    pub external: rocprofiler_user_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_async_correlation_id_t"]
        [::std::mem::size_of::<rocprofiler_async_correlation_id_t>() - 16usize];
    ["Alignment of rocprofiler_async_correlation_id_t"]
        [::std::mem::align_of::<rocprofiler_async_correlation_id_t>() - 8usize];
    ["Offset of field: rocprofiler_async_correlation_id_t::internal"]
        [::std::mem::offset_of!(rocprofiler_async_correlation_id_t, internal) - 0usize];
    ["Offset of field: rocprofiler_async_correlation_id_t::external"]
        [::std::mem::offset_of!(rocprofiler_async_correlation_id_t, external) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_buffer_id_t {
    pub handle: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_buffer_id_t"][::std::mem::size_of::<rocprofiler_buffer_id_t>() - 8usize];
    ["Alignment of rocprofiler_buffer_id_t"]
        [::std::mem::align_of::<rocprofiler_buffer_id_t>() - 8usize];
    ["Offset of field: rocprofiler_buffer_id_t::handle"]
        [::std::mem::offset_of!(rocprofiler_buffer_id_t, handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_agent_id_t {
    pub handle: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_agent_id_t"][::std::mem::size_of::<rocprofiler_agent_id_t>() - 8usize];
    ["Alignment of rocprofiler_agent_id_t"]
        [::std::mem::align_of::<rocprofiler_agent_id_t>() - 8usize];
    ["Offset of field: rocprofiler_agent_id_t::handle"]
        [::std::mem::offset_of!(rocprofiler_agent_id_t, handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_counter_id_t {
    pub handle: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_counter_id_t"]
        [::std::mem::size_of::<rocprofiler_counter_id_t>() - 8usize];
    ["Alignment of rocprofiler_counter_id_t"]
        [::std::mem::align_of::<rocprofiler_counter_id_t>() - 8usize];
    ["Offset of field: rocprofiler_counter_id_t::handle"]
        [::std::mem::offset_of!(rocprofiler_counter_id_t, handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_counter_config_id_t {
    pub handle: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_counter_config_id_t"]
        [::std::mem::size_of::<rocprofiler_counter_config_id_t>() - 8usize];
    ["Alignment of rocprofiler_counter_config_id_t"]
        [::std::mem::align_of::<rocprofiler_counter_config_id_t>() - 8usize];
    ["Offset of field: rocprofiler_counter_config_id_t::handle"]
        [::std::mem::offset_of!(rocprofiler_counter_config_id_t, handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_dim3_t {
    pub x: u32,
    pub y: u32,
    pub z: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_dim3_t"][::std::mem::size_of::<rocprofiler_dim3_t>() - 12usize];
    ["Alignment of rocprofiler_dim3_t"][::std::mem::align_of::<rocprofiler_dim3_t>() - 4usize];
    ["Offset of field: rocprofiler_dim3_t::x"]
        [::std::mem::offset_of!(rocprofiler_dim3_t, x) - 0usize];
    ["Offset of field: rocprofiler_dim3_t::y"]
        [::std::mem::offset_of!(rocprofiler_dim3_t, y) - 4usize];
    ["Offset of field: rocprofiler_dim3_t::z"]
        [::std::mem::offset_of!(rocprofiler_dim3_t, z) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rocprofiler_callback_tracing_record_t {
    pub context_id: rocprofiler_context_id_t,
    pub thread_id: rocprofiler_thread_id_t,
    pub correlation_id: rocprofiler_correlation_id_t,
    pub kind: rocprofiler_callback_tracing_kind_t,
    pub operation: rocprofiler_tracing_operation_t,
    pub phase: rocprofiler_callback_phase_t,
    pub payload: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_callback_tracing_record_t"]
        [::std::mem::size_of::<rocprofiler_callback_tracing_record_t>() - 64usize];
    ["Alignment of rocprofiler_callback_tracing_record_t"]
        [::std::mem::align_of::<rocprofiler_callback_tracing_record_t>() - 8usize];
    ["Offset of field: rocprofiler_callback_tracing_record_t::context_id"]
        [::std::mem::offset_of!(rocprofiler_callback_tracing_record_t, context_id) - 0usize];
    ["Offset of field: rocprofiler_callback_tracing_record_t::thread_id"]
        [::std::mem::offset_of!(rocprofiler_callback_tracing_record_t, thread_id) - 8usize];
    ["Offset of field: rocprofiler_callback_tracing_record_t::correlation_id"]
        [::std::mem::offset_of!(rocprofiler_callback_tracing_record_t, correlation_id) - 16usize];
    ["Offset of field: rocprofiler_callback_tracing_record_t::kind"]
        [::std::mem::offset_of!(rocprofiler_callback_tracing_record_t, kind) - 40usize];
    ["Offset of field: rocprofiler_callback_tracing_record_t::operation"]
        [::std::mem::offset_of!(rocprofiler_callback_tracing_record_t, operation) - 44usize];
    ["Offset of field: rocprofiler_callback_tracing_record_t::phase"]
        [::std::mem::offset_of!(rocprofiler_callback_tracing_record_t, phase) - 48usize];
    ["Offset of field: rocprofiler_callback_tracing_record_t::payload"]
        [::std::mem::offset_of!(rocprofiler_callback_tracing_record_t, payload) - 56usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rocprofiler_record_header_t {
    pub __bindgen_anon_1: rocprofiler_record_header_t__bindgen_ty_1,
    pub payload: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union rocprofiler_record_header_t__bindgen_ty_1 {
    pub __bindgen_anon_1: rocprofiler_record_header_t__bindgen_ty_1__bindgen_ty_1,
    pub hash: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_record_header_t__bindgen_ty_1__bindgen_ty_1 {
    pub category: u32,
    pub kind: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_record_header_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<rocprofiler_record_header_t__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of rocprofiler_record_header_t__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        rocprofiler_record_header_t__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Offset of field: rocprofiler_record_header_t__bindgen_ty_1__bindgen_ty_1::category"][::std::mem::offset_of!(
        rocprofiler_record_header_t__bindgen_ty_1__bindgen_ty_1,
        category
    )
        - 0usize];
    ["Offset of field: rocprofiler_record_header_t__bindgen_ty_1__bindgen_ty_1::kind"][::std::mem::offset_of!(
        rocprofiler_record_header_t__bindgen_ty_1__bindgen_ty_1,
        kind
    ) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_record_header_t__bindgen_ty_1"]
        [::std::mem::size_of::<rocprofiler_record_header_t__bindgen_ty_1>() - 8usize];
    ["Alignment of rocprofiler_record_header_t__bindgen_ty_1"]
        [::std::mem::align_of::<rocprofiler_record_header_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: rocprofiler_record_header_t__bindgen_ty_1::hash"]
        [::std::mem::offset_of!(rocprofiler_record_header_t__bindgen_ty_1, hash) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_record_header_t"]
        [::std::mem::size_of::<rocprofiler_record_header_t>() - 16usize];
    ["Alignment of rocprofiler_record_header_t"]
        [::std::mem::align_of::<rocprofiler_record_header_t>() - 8usize];
    ["Offset of field: rocprofiler_record_header_t::payload"]
        [::std::mem::offset_of!(rocprofiler_record_header_t, payload) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_kernel_dispatch_info_t {
    pub size: u64,
    pub agent_id: rocprofiler_agent_id_t,
    pub queue_id: rocprofiler_queue_id_t,
    pub kernel_id: rocprofiler_kernel_id_t,
    pub dispatch_id: rocprofiler_dispatch_id_t,
    pub private_segment_size: u32,
    pub group_segment_size: u32,
    pub workgroup_size: rocprofiler_dim3_t,
    pub grid_size: rocprofiler_dim3_t,
    pub reserved_padding: [u8; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_kernel_dispatch_info_t"]
        [::std::mem::size_of::<rocprofiler_kernel_dispatch_info_t>() - 128usize];
    ["Alignment of rocprofiler_kernel_dispatch_info_t"]
        [::std::mem::align_of::<rocprofiler_kernel_dispatch_info_t>() - 8usize];
    ["Offset of field: rocprofiler_kernel_dispatch_info_t::size"]
        [::std::mem::offset_of!(rocprofiler_kernel_dispatch_info_t, size) - 0usize];
    ["Offset of field: rocprofiler_kernel_dispatch_info_t::agent_id"]
        [::std::mem::offset_of!(rocprofiler_kernel_dispatch_info_t, agent_id) - 8usize];
    ["Offset of field: rocprofiler_kernel_dispatch_info_t::queue_id"]
        [::std::mem::offset_of!(rocprofiler_kernel_dispatch_info_t, queue_id) - 16usize];
    ["Offset of field: rocprofiler_kernel_dispatch_info_t::kernel_id"]
        [::std::mem::offset_of!(rocprofiler_kernel_dispatch_info_t, kernel_id) - 24usize];
    ["Offset of field: rocprofiler_kernel_dispatch_info_t::dispatch_id"]
        [::std::mem::offset_of!(rocprofiler_kernel_dispatch_info_t, dispatch_id) - 32usize];
    ["Offset of field: rocprofiler_kernel_dispatch_info_t::private_segment_size"][::std::mem::offset_of!(
        rocprofiler_kernel_dispatch_info_t,
        private_segment_size
    ) - 40usize];
    ["Offset of field: rocprofiler_kernel_dispatch_info_t::group_segment_size"]
        [::std::mem::offset_of!(rocprofiler_kernel_dispatch_info_t, group_segment_size) - 44usize];
    ["Offset of field: rocprofiler_kernel_dispatch_info_t::workgroup_size"]
        [::std::mem::offset_of!(rocprofiler_kernel_dispatch_info_t, workgroup_size) - 48usize];
    ["Offset of field: rocprofiler_kernel_dispatch_info_t::grid_size"]
        [::std::mem::offset_of!(rocprofiler_kernel_dispatch_info_t, grid_size) - 60usize];
    ["Offset of field: rocprofiler_kernel_dispatch_info_t::reserved_padding"]
        [::std::mem::offset_of!(rocprofiler_kernel_dispatch_info_t, reserved_padding) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_counter_record_dimension_info_t {
    pub name: *const ::std::os::raw::c_char,
    pub instance_size: usize,
    pub id: rocprofiler_counter_dimension_id_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_counter_record_dimension_info_t"]
        [::std::mem::size_of::<rocprofiler_counter_record_dimension_info_t>() - 24usize];
    ["Alignment of rocprofiler_counter_record_dimension_info_t"]
        [::std::mem::align_of::<rocprofiler_counter_record_dimension_info_t>() - 8usize];
    ["Offset of field: rocprofiler_counter_record_dimension_info_t::name"]
        [::std::mem::offset_of!(rocprofiler_counter_record_dimension_info_t, name) - 0usize];
    ["Offset of field: rocprofiler_counter_record_dimension_info_t::instance_size"][::std::mem::offset_of!(
        rocprofiler_counter_record_dimension_info_t,
        instance_size
    ) - 8usize];
    ["Offset of field: rocprofiler_counter_record_dimension_info_t::id"]
        [::std::mem::offset_of!(rocprofiler_counter_record_dimension_info_t, id) - 16usize];
};
pub type rocprofiler_record_dimension_info_t = rocprofiler_counter_record_dimension_info_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rocprofiler_counter_record_t {
    pub id: rocprofiler_counter_instance_id_t,
    pub counter_value: f64,
    pub dispatch_id: rocprofiler_dispatch_id_t,
    pub user_data: rocprofiler_user_data_t,
    pub agent_id: rocprofiler_agent_id_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_counter_record_t"]
        [::std::mem::size_of::<rocprofiler_counter_record_t>() - 40usize];
    ["Alignment of rocprofiler_counter_record_t"]
        [::std::mem::align_of::<rocprofiler_counter_record_t>() - 8usize];
    ["Offset of field: rocprofiler_counter_record_t::id"]
        [::std::mem::offset_of!(rocprofiler_counter_record_t, id) - 0usize];
    ["Offset of field: rocprofiler_counter_record_t::counter_value"]
        [::std::mem::offset_of!(rocprofiler_counter_record_t, counter_value) - 8usize];
    ["Offset of field: rocprofiler_counter_record_t::dispatch_id"]
        [::std::mem::offset_of!(rocprofiler_counter_record_t, dispatch_id) - 16usize];
    ["Offset of field: rocprofiler_counter_record_t::user_data"]
        [::std::mem::offset_of!(rocprofiler_counter_record_t, user_data) - 24usize];
    ["Offset of field: rocprofiler_counter_record_t::agent_id"]
        [::std::mem::offset_of!(rocprofiler_counter_record_t, agent_id) - 32usize];
};
pub type rocprofiler_record_counter_t = rocprofiler_counter_record_t;
pub type rocprofiler_profile_config_id_t = rocprofiler_counter_config_id_t;
pub type HSAuint32 = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union HSA_ENGINE_ID {
    pub Value: HSAuint32,
    pub ui32: HSA_ENGINE_ID__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct HSA_ENGINE_ID__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HSA_ENGINE_ID__bindgen_ty_1"]
        [::std::mem::size_of::<HSA_ENGINE_ID__bindgen_ty_1>() - 4usize];
    ["Alignment of HSA_ENGINE_ID__bindgen_ty_1"]
        [::std::mem::align_of::<HSA_ENGINE_ID__bindgen_ty_1>() - 4usize];
};
impl HSA_ENGINE_ID__bindgen_ty_1 {
    #[inline]
    pub fn uCode(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 10u8) as u32) }
    }
    #[inline]
    pub fn set_uCode(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn uCode_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                10u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_uCode_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                10u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Major(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 6u8) as u32) }
    }
    #[inline]
    pub fn set_Major(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Major_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                6u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Major_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                6u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Minor(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_Minor(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Minor_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Minor_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Stepping(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_Stepping(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Stepping_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                24usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Stepping_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        uCode: ::std::os::raw::c_uint,
        Major: ::std::os::raw::c_uint,
        Minor: ::std::os::raw::c_uint,
        Stepping: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 10u8, {
            let uCode: u32 = unsafe { ::std::mem::transmute(uCode) };
            uCode as u64
        });
        __bindgen_bitfield_unit.set(10usize, 6u8, {
            let Major: u32 = unsafe { ::std::mem::transmute(Major) };
            Major as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let Minor: u32 = unsafe { ::std::mem::transmute(Minor) };
            Minor as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let Stepping: u32 = unsafe { ::std::mem::transmute(Stepping) };
            Stepping as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HSA_ENGINE_ID"][::std::mem::size_of::<HSA_ENGINE_ID>() - 4usize];
    ["Alignment of HSA_ENGINE_ID"][::std::mem::align_of::<HSA_ENGINE_ID>() - 4usize];
    ["Offset of field: HSA_ENGINE_ID::Value"]
        [::std::mem::offset_of!(HSA_ENGINE_ID, Value) - 0usize];
    ["Offset of field: HSA_ENGINE_ID::ui32"][::std::mem::offset_of!(HSA_ENGINE_ID, ui32) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union HSA_ENGINE_VERSION {
    pub Value: HSAuint32,
    pub __bindgen_anon_1: HSA_ENGINE_VERSION__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct HSA_ENGINE_VERSION__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HSA_ENGINE_VERSION__bindgen_ty_1"]
        [::std::mem::size_of::<HSA_ENGINE_VERSION__bindgen_ty_1>() - 4usize];
    ["Alignment of HSA_ENGINE_VERSION__bindgen_ty_1"]
        [::std::mem::align_of::<HSA_ENGINE_VERSION__bindgen_ty_1>() - 4usize];
};
impl HSA_ENGINE_VERSION__bindgen_ty_1 {
    #[inline]
    pub fn uCodeSDMA(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 10u8) as u32) }
    }
    #[inline]
    pub fn set_uCodeSDMA(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn uCodeSDMA_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                10u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_uCodeSDMA_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                10u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn uCodeRes(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 10u8) as u32) }
    }
    #[inline]
    pub fn set_uCodeRes(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn uCodeRes_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                10u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_uCodeRes_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                10u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Reserved(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 12u8) as u32) }
    }
    #[inline]
    pub fn set_Reserved(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                12u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                12u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        uCodeSDMA: ::std::os::raw::c_uint,
        uCodeRes: ::std::os::raw::c_uint,
        Reserved: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 10u8, {
            let uCodeSDMA: u32 = unsafe { ::std::mem::transmute(uCodeSDMA) };
            uCodeSDMA as u64
        });
        __bindgen_bitfield_unit.set(10usize, 10u8, {
            let uCodeRes: u32 = unsafe { ::std::mem::transmute(uCodeRes) };
            uCodeRes as u64
        });
        __bindgen_bitfield_unit.set(20usize, 12u8, {
            let Reserved: u32 = unsafe { ::std::mem::transmute(Reserved) };
            Reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HSA_ENGINE_VERSION"][::std::mem::size_of::<HSA_ENGINE_VERSION>() - 4usize];
    ["Alignment of HSA_ENGINE_VERSION"][::std::mem::align_of::<HSA_ENGINE_VERSION>() - 4usize];
    ["Offset of field: HSA_ENGINE_VERSION::Value"]
        [::std::mem::offset_of!(HSA_ENGINE_VERSION, Value) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union HSA_CAPABILITY {
    pub Value: HSAuint32,
    pub ui32: HSA_CAPABILITY__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct HSA_CAPABILITY__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HSA_CAPABILITY__bindgen_ty_1"]
        [::std::mem::size_of::<HSA_CAPABILITY__bindgen_ty_1>() - 4usize];
    ["Alignment of HSA_CAPABILITY__bindgen_ty_1"]
        [::std::mem::align_of::<HSA_CAPABILITY__bindgen_ty_1>() - 4usize];
};
impl HSA_CAPABILITY__bindgen_ty_1 {
    #[inline]
    pub fn HotPluggable(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_HotPluggable(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn HotPluggable_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_HotPluggable_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn HSAMMUPresent(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_HSAMMUPresent(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn HSAMMUPresent_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_HSAMMUPresent_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn SharedWithGraphics(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SharedWithGraphics(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn SharedWithGraphics_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_SharedWithGraphics_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn QueueSizePowerOfTwo(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_QueueSizePowerOfTwo(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn QueueSizePowerOfTwo_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_QueueSizePowerOfTwo_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn QueueSize32bit(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_QueueSize32bit(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn QueueSize32bit_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_QueueSize32bit_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn QueueIdleEvent(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_QueueIdleEvent(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn QueueIdleEvent_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_QueueIdleEvent_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn VALimit(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_VALimit(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn VALimit_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_VALimit_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn WatchPointsSupported(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_WatchPointsSupported(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn WatchPointsSupported_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_WatchPointsSupported_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn WatchPointsTotalBits(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_WatchPointsTotalBits(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn WatchPointsTotalBits_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                4u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_WatchPointsTotalBits_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn DoorbellType(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_DoorbellType(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn DoorbellType_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_DoorbellType_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn AQLQueueDoubleMap(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_AQLQueueDoubleMap(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn AQLQueueDoubleMap_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_AQLQueueDoubleMap_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn DebugTrapSupported(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_DebugTrapSupported(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn DebugTrapSupported_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_DebugTrapSupported_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn WaveLaunchTrapOverrideSupported(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_WaveLaunchTrapOverrideSupported(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn WaveLaunchTrapOverrideSupported_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_WaveLaunchTrapOverrideSupported_raw(
        this: *mut Self,
        val: ::std::os::raw::c_uint,
    ) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn WaveLaunchModeSupported(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_WaveLaunchModeSupported(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn WaveLaunchModeSupported_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                17usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_WaveLaunchModeSupported_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                17usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn PreciseMemoryOperationsSupported(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_PreciseMemoryOperationsSupported(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn PreciseMemoryOperationsSupported_raw(
        this: *const Self,
    ) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                18usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_PreciseMemoryOperationsSupported_raw(
        this: *mut Self,
        val: ::std::os::raw::c_uint,
    ) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                18usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn DEPRECATED_SRAM_EDCSupport(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_DEPRECATED_SRAM_EDCSupport(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn DEPRECATED_SRAM_EDCSupport_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                19usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_DEPRECATED_SRAM_EDCSupport_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                19usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Mem_EDCSupport(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Mem_EDCSupport(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Mem_EDCSupport_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Mem_EDCSupport_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn RASEventNotify(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_RASEventNotify(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn RASEventNotify_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                21usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_RASEventNotify_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                21usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ASICRevision(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_ASICRevision(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(22usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ASICRevision_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                22usize,
                4u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_ASICRevision_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                22usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn SRAM_EDCSupport(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(26usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SRAM_EDCSupport(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(26usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn SRAM_EDCSupport_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                26usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_SRAM_EDCSupport_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                26usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn SVMAPISupported(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SVMAPISupported(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn SVMAPISupported_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                27usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_SVMAPISupported_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                27usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn CoherentHostAccess(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CoherentHostAccess(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn CoherentHostAccess_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                28usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_CoherentHostAccess_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                28usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn DebugSupportedFirmware(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_DebugSupportedFirmware(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn DebugSupportedFirmware_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                29usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_DebugSupportedFirmware_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                29usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn PreciseALUOperationsSupported(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_PreciseALUOperationsSupported(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn PreciseALUOperationsSupported_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                30usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_PreciseALUOperationsSupported_raw(
        this: *mut Self,
        val: ::std::os::raw::c_uint,
    ) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                30usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn PerQueueResetSupported(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_PerQueueResetSupported(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn PerQueueResetSupported_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                31usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_PerQueueResetSupported_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        HotPluggable: ::std::os::raw::c_uint,
        HSAMMUPresent: ::std::os::raw::c_uint,
        SharedWithGraphics: ::std::os::raw::c_uint,
        QueueSizePowerOfTwo: ::std::os::raw::c_uint,
        QueueSize32bit: ::std::os::raw::c_uint,
        QueueIdleEvent: ::std::os::raw::c_uint,
        VALimit: ::std::os::raw::c_uint,
        WatchPointsSupported: ::std::os::raw::c_uint,
        WatchPointsTotalBits: ::std::os::raw::c_uint,
        DoorbellType: ::std::os::raw::c_uint,
        AQLQueueDoubleMap: ::std::os::raw::c_uint,
        DebugTrapSupported: ::std::os::raw::c_uint,
        WaveLaunchTrapOverrideSupported: ::std::os::raw::c_uint,
        WaveLaunchModeSupported: ::std::os::raw::c_uint,
        PreciseMemoryOperationsSupported: ::std::os::raw::c_uint,
        DEPRECATED_SRAM_EDCSupport: ::std::os::raw::c_uint,
        Mem_EDCSupport: ::std::os::raw::c_uint,
        RASEventNotify: ::std::os::raw::c_uint,
        ASICRevision: ::std::os::raw::c_uint,
        SRAM_EDCSupport: ::std::os::raw::c_uint,
        SVMAPISupported: ::std::os::raw::c_uint,
        CoherentHostAccess: ::std::os::raw::c_uint,
        DebugSupportedFirmware: ::std::os::raw::c_uint,
        PreciseALUOperationsSupported: ::std::os::raw::c_uint,
        PerQueueResetSupported: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let HotPluggable: u32 = unsafe { ::std::mem::transmute(HotPluggable) };
            HotPluggable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let HSAMMUPresent: u32 = unsafe { ::std::mem::transmute(HSAMMUPresent) };
            HSAMMUPresent as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let SharedWithGraphics: u32 = unsafe { ::std::mem::transmute(SharedWithGraphics) };
            SharedWithGraphics as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let QueueSizePowerOfTwo: u32 = unsafe { ::std::mem::transmute(QueueSizePowerOfTwo) };
            QueueSizePowerOfTwo as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let QueueSize32bit: u32 = unsafe { ::std::mem::transmute(QueueSize32bit) };
            QueueSize32bit as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let QueueIdleEvent: u32 = unsafe { ::std::mem::transmute(QueueIdleEvent) };
            QueueIdleEvent as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let VALimit: u32 = unsafe { ::std::mem::transmute(VALimit) };
            VALimit as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let WatchPointsSupported: u32 = unsafe { ::std::mem::transmute(WatchPointsSupported) };
            WatchPointsSupported as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let WatchPointsTotalBits: u32 = unsafe { ::std::mem::transmute(WatchPointsTotalBits) };
            WatchPointsTotalBits as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let DoorbellType: u32 = unsafe { ::std::mem::transmute(DoorbellType) };
            DoorbellType as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let AQLQueueDoubleMap: u32 = unsafe { ::std::mem::transmute(AQLQueueDoubleMap) };
            AQLQueueDoubleMap as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let DebugTrapSupported: u32 = unsafe { ::std::mem::transmute(DebugTrapSupported) };
            DebugTrapSupported as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let WaveLaunchTrapOverrideSupported: u32 =
                unsafe { ::std::mem::transmute(WaveLaunchTrapOverrideSupported) };
            WaveLaunchTrapOverrideSupported as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let WaveLaunchModeSupported: u32 =
                unsafe { ::std::mem::transmute(WaveLaunchModeSupported) };
            WaveLaunchModeSupported as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let PreciseMemoryOperationsSupported: u32 =
                unsafe { ::std::mem::transmute(PreciseMemoryOperationsSupported) };
            PreciseMemoryOperationsSupported as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let DEPRECATED_SRAM_EDCSupport: u32 =
                unsafe { ::std::mem::transmute(DEPRECATED_SRAM_EDCSupport) };
            DEPRECATED_SRAM_EDCSupport as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let Mem_EDCSupport: u32 = unsafe { ::std::mem::transmute(Mem_EDCSupport) };
            Mem_EDCSupport as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let RASEventNotify: u32 = unsafe { ::std::mem::transmute(RASEventNotify) };
            RASEventNotify as u64
        });
        __bindgen_bitfield_unit.set(22usize, 4u8, {
            let ASICRevision: u32 = unsafe { ::std::mem::transmute(ASICRevision) };
            ASICRevision as u64
        });
        __bindgen_bitfield_unit.set(26usize, 1u8, {
            let SRAM_EDCSupport: u32 = unsafe { ::std::mem::transmute(SRAM_EDCSupport) };
            SRAM_EDCSupport as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let SVMAPISupported: u32 = unsafe { ::std::mem::transmute(SVMAPISupported) };
            SVMAPISupported as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let CoherentHostAccess: u32 = unsafe { ::std::mem::transmute(CoherentHostAccess) };
            CoherentHostAccess as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let DebugSupportedFirmware: u32 =
                unsafe { ::std::mem::transmute(DebugSupportedFirmware) };
            DebugSupportedFirmware as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let PreciseALUOperationsSupported: u32 =
                unsafe { ::std::mem::transmute(PreciseALUOperationsSupported) };
            PreciseALUOperationsSupported as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let PerQueueResetSupported: u32 =
                unsafe { ::std::mem::transmute(PerQueueResetSupported) };
            PerQueueResetSupported as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HSA_CAPABILITY"][::std::mem::size_of::<HSA_CAPABILITY>() - 4usize];
    ["Alignment of HSA_CAPABILITY"][::std::mem::align_of::<HSA_CAPABILITY>() - 4usize];
    ["Offset of field: HSA_CAPABILITY::Value"]
        [::std::mem::offset_of!(HSA_CAPABILITY, Value) - 0usize];
    ["Offset of field: HSA_CAPABILITY::ui32"]
        [::std::mem::offset_of!(HSA_CAPABILITY, ui32) - 0usize];
};
pub const _HSA_HEAPTYPE_HSA_HEAPTYPE_SYSTEM: _HSA_HEAPTYPE = 0;
pub const _HSA_HEAPTYPE_HSA_HEAPTYPE_FRAME_BUFFER_PUBLIC: _HSA_HEAPTYPE = 1;
pub const _HSA_HEAPTYPE_HSA_HEAPTYPE_FRAME_BUFFER_PRIVATE: _HSA_HEAPTYPE = 2;
pub const _HSA_HEAPTYPE_HSA_HEAPTYPE_GPU_GDS: _HSA_HEAPTYPE = 3;
pub const _HSA_HEAPTYPE_HSA_HEAPTYPE_GPU_LDS: _HSA_HEAPTYPE = 4;
pub const _HSA_HEAPTYPE_HSA_HEAPTYPE_GPU_SCRATCH: _HSA_HEAPTYPE = 5;
pub const _HSA_HEAPTYPE_HSA_HEAPTYPE_DEVICE_SVM: _HSA_HEAPTYPE = 6;
pub const _HSA_HEAPTYPE_HSA_HEAPTYPE_MMIO_REMAP: _HSA_HEAPTYPE = 7;
pub const _HSA_HEAPTYPE_HSA_HEAPTYPE_NUMHEAPTYPES: _HSA_HEAPTYPE = 8;
pub const _HSA_HEAPTYPE_HSA_HEAPTYPE_SIZE: _HSA_HEAPTYPE = 4294967295;
pub type _HSA_HEAPTYPE = ::std::os::raw::c_uint;
pub use self::_HSA_HEAPTYPE as HSA_HEAPTYPE;
#[repr(C)]
#[derive(Copy, Clone)]
pub union HSA_MEMORYPROPERTY {
    pub MemoryProperty: HSAuint32,
    pub ui32: HSA_MEMORYPROPERTY__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HSA_MEMORYPROPERTY__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HSA_MEMORYPROPERTY__bindgen_ty_1"]
        [::std::mem::size_of::<HSA_MEMORYPROPERTY__bindgen_ty_1>() - 4usize];
    ["Alignment of HSA_MEMORYPROPERTY__bindgen_ty_1"]
        [::std::mem::align_of::<HSA_MEMORYPROPERTY__bindgen_ty_1>() - 4usize];
};
impl HSA_MEMORYPROPERTY__bindgen_ty_1 {
    #[inline]
    pub fn HotPluggable(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_HotPluggable(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn HotPluggable_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_HotPluggable_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn NonVolatile(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_NonVolatile(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn NonVolatile_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_NonVolatile_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Reserved(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_Reserved(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                30u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                30u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        HotPluggable: ::std::os::raw::c_uint,
        NonVolatile: ::std::os::raw::c_uint,
        Reserved: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let HotPluggable: u32 = unsafe { ::std::mem::transmute(HotPluggable) };
            HotPluggable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let NonVolatile: u32 = unsafe { ::std::mem::transmute(NonVolatile) };
            NonVolatile as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let Reserved: u32 = unsafe { ::std::mem::transmute(Reserved) };
            Reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HSA_MEMORYPROPERTY"][::std::mem::size_of::<HSA_MEMORYPROPERTY>() - 4usize];
    ["Alignment of HSA_MEMORYPROPERTY"][::std::mem::align_of::<HSA_MEMORYPROPERTY>() - 4usize];
    ["Offset of field: HSA_MEMORYPROPERTY::MemoryProperty"]
        [::std::mem::offset_of!(HSA_MEMORYPROPERTY, MemoryProperty) - 0usize];
    ["Offset of field: HSA_MEMORYPROPERTY::ui32"]
        [::std::mem::offset_of!(HSA_MEMORYPROPERTY, ui32) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union HsaCacheType {
    pub Value: HSAuint32,
    pub ui32: HsaCacheType__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HsaCacheType__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HsaCacheType__bindgen_ty_1"]
        [::std::mem::size_of::<HsaCacheType__bindgen_ty_1>() - 4usize];
    ["Alignment of HsaCacheType__bindgen_ty_1"]
        [::std::mem::align_of::<HsaCacheType__bindgen_ty_1>() - 4usize];
};
impl HsaCacheType__bindgen_ty_1 {
    #[inline]
    pub fn Data(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Data(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Data_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Data_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Instruction(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Instruction(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Instruction_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Instruction_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn CPU(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_CPU(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn CPU_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_CPU_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn HSACU(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_HSACU(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn HSACU_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_HSACU_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Reserved(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 28u8) as u32) }
    }
    #[inline]
    pub fn set_Reserved(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 28u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                28u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                28u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Data: ::std::os::raw::c_uint,
        Instruction: ::std::os::raw::c_uint,
        CPU: ::std::os::raw::c_uint,
        HSACU: ::std::os::raw::c_uint,
        Reserved: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let Data: u32 = unsafe { ::std::mem::transmute(Data) };
            Data as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let Instruction: u32 = unsafe { ::std::mem::transmute(Instruction) };
            Instruction as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let CPU: u32 = unsafe { ::std::mem::transmute(CPU) };
            CPU as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let HSACU: u32 = unsafe { ::std::mem::transmute(HSACU) };
            HSACU as u64
        });
        __bindgen_bitfield_unit.set(4usize, 28u8, {
            let Reserved: u32 = unsafe { ::std::mem::transmute(Reserved) };
            Reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HsaCacheType"][::std::mem::size_of::<HsaCacheType>() - 4usize];
    ["Alignment of HsaCacheType"][::std::mem::align_of::<HsaCacheType>() - 4usize];
    ["Offset of field: HsaCacheType::Value"][::std::mem::offset_of!(HsaCacheType, Value) - 0usize];
    ["Offset of field: HsaCacheType::ui32"][::std::mem::offset_of!(HsaCacheType, ui32) - 0usize];
};
pub const _HSA_IOLINKTYPE_HSA_IOLINKTYPE_UNDEFINED: _HSA_IOLINKTYPE = 0;
pub const _HSA_IOLINKTYPE_HSA_IOLINKTYPE_HYPERTRANSPORT: _HSA_IOLINKTYPE = 1;
pub const _HSA_IOLINKTYPE_HSA_IOLINKTYPE_PCIEXPRESS: _HSA_IOLINKTYPE = 2;
pub const _HSA_IOLINKTYPE_HSA_IOLINKTYPE_AMBA: _HSA_IOLINKTYPE = 3;
pub const _HSA_IOLINKTYPE_HSA_IOLINKTYPE_MIPI: _HSA_IOLINKTYPE = 4;
pub const _HSA_IOLINKTYPE_HSA_IOLINK_TYPE_QPI_1_1: _HSA_IOLINKTYPE = 5;
pub const _HSA_IOLINKTYPE_HSA_IOLINK_TYPE_RESERVED1: _HSA_IOLINKTYPE = 6;
pub const _HSA_IOLINKTYPE_HSA_IOLINK_TYPE_RESERVED2: _HSA_IOLINKTYPE = 7;
pub const _HSA_IOLINKTYPE_HSA_IOLINK_TYPE_RAPID_IO: _HSA_IOLINKTYPE = 8;
pub const _HSA_IOLINKTYPE_HSA_IOLINK_TYPE_INFINIBAND: _HSA_IOLINKTYPE = 9;
pub const _HSA_IOLINKTYPE_HSA_IOLINK_TYPE_RESERVED3: _HSA_IOLINKTYPE = 10;
pub const _HSA_IOLINKTYPE_HSA_IOLINK_TYPE_XGMI: _HSA_IOLINKTYPE = 11;
pub const _HSA_IOLINKTYPE_HSA_IOLINK_TYPE_XGOP: _HSA_IOLINKTYPE = 12;
pub const _HSA_IOLINKTYPE_HSA_IOLINK_TYPE_GZ: _HSA_IOLINKTYPE = 13;
pub const _HSA_IOLINKTYPE_HSA_IOLINK_TYPE_ETHERNET_RDMA: _HSA_IOLINKTYPE = 14;
pub const _HSA_IOLINKTYPE_HSA_IOLINK_TYPE_RDMA_OTHER: _HSA_IOLINKTYPE = 15;
pub const _HSA_IOLINKTYPE_HSA_IOLINK_TYPE_OTHER: _HSA_IOLINKTYPE = 16;
pub const _HSA_IOLINKTYPE_HSA_IOLINKTYPE_NUMIOLINKTYPES: _HSA_IOLINKTYPE = 17;
pub const _HSA_IOLINKTYPE_HSA_IOLINKTYPE_SIZE: _HSA_IOLINKTYPE = 4294967295;
pub type _HSA_IOLINKTYPE = ::std::os::raw::c_uint;
pub use self::_HSA_IOLINKTYPE as HSA_IOLINKTYPE;
#[repr(C)]
#[derive(Copy, Clone)]
pub union HSA_LINKPROPERTY {
    pub LinkProperty: HSAuint32,
    pub ui32: HSA_LINKPROPERTY__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HSA_LINKPROPERTY__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HSA_LINKPROPERTY__bindgen_ty_1"]
        [::std::mem::size_of::<HSA_LINKPROPERTY__bindgen_ty_1>() - 4usize];
    ["Alignment of HSA_LINKPROPERTY__bindgen_ty_1"]
        [::std::mem::align_of::<HSA_LINKPROPERTY__bindgen_ty_1>() - 4usize];
};
impl HSA_LINKPROPERTY__bindgen_ty_1 {
    #[inline]
    pub fn Override(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Override(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Override_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Override_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn NonCoherent(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_NonCoherent(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn NonCoherent_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_NonCoherent_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn NoAtomics32bit(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_NoAtomics32bit(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn NoAtomics32bit_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_NoAtomics32bit_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn NoAtomics64bit(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_NoAtomics64bit(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn NoAtomics64bit_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_NoAtomics64bit_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn NoPeerToPeerDMA(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_NoPeerToPeerDMA(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn NoPeerToPeerDMA_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_NoPeerToPeerDMA_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Reserved(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 27u8) as u32) }
    }
    #[inline]
    pub fn set_Reserved(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 27u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                27u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                27u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Override: ::std::os::raw::c_uint,
        NonCoherent: ::std::os::raw::c_uint,
        NoAtomics32bit: ::std::os::raw::c_uint,
        NoAtomics64bit: ::std::os::raw::c_uint,
        NoPeerToPeerDMA: ::std::os::raw::c_uint,
        Reserved: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let Override: u32 = unsafe { ::std::mem::transmute(Override) };
            Override as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let NonCoherent: u32 = unsafe { ::std::mem::transmute(NonCoherent) };
            NonCoherent as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let NoAtomics32bit: u32 = unsafe { ::std::mem::transmute(NoAtomics32bit) };
            NoAtomics32bit as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let NoAtomics64bit: u32 = unsafe { ::std::mem::transmute(NoAtomics64bit) };
            NoAtomics64bit as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let NoPeerToPeerDMA: u32 = unsafe { ::std::mem::transmute(NoPeerToPeerDMA) };
            NoPeerToPeerDMA as u64
        });
        __bindgen_bitfield_unit.set(5usize, 27u8, {
            let Reserved: u32 = unsafe { ::std::mem::transmute(Reserved) };
            Reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HSA_LINKPROPERTY"][::std::mem::size_of::<HSA_LINKPROPERTY>() - 4usize];
    ["Alignment of HSA_LINKPROPERTY"][::std::mem::align_of::<HSA_LINKPROPERTY>() - 4usize];
    ["Offset of field: HSA_LINKPROPERTY::LinkProperty"]
        [::std::mem::offset_of!(HSA_LINKPROPERTY, LinkProperty) - 0usize];
    ["Offset of field: HSA_LINKPROPERTY::ui32"]
        [::std::mem::offset_of!(HSA_LINKPROPERTY, ui32) - 0usize];
};
pub const rocprofiler_agent_version_t_ROCPROFILER_AGENT_INFO_VERSION_NONE:
    rocprofiler_agent_version_t = 0;
pub const rocprofiler_agent_version_t_ROCPROFILER_AGENT_INFO_VERSION_0:
    rocprofiler_agent_version_t = 1;
pub const rocprofiler_agent_version_t_ROCPROFILER_AGENT_INFO_VERSION_LAST:
    rocprofiler_agent_version_t = 2;
pub type rocprofiler_agent_version_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rocprofiler_agent_cache_t {
    pub processor_id_low: u64,
    pub size: u64,
    pub level: u32,
    pub cache_line_size: u32,
    pub cache_lines_per_tag: u32,
    pub association: u32,
    pub latency: u32,
    pub type_: HsaCacheType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_agent_cache_t"]
        [::std::mem::size_of::<rocprofiler_agent_cache_t>() - 40usize];
    ["Alignment of rocprofiler_agent_cache_t"]
        [::std::mem::align_of::<rocprofiler_agent_cache_t>() - 8usize];
    ["Offset of field: rocprofiler_agent_cache_t::processor_id_low"]
        [::std::mem::offset_of!(rocprofiler_agent_cache_t, processor_id_low) - 0usize];
    ["Offset of field: rocprofiler_agent_cache_t::size"]
        [::std::mem::offset_of!(rocprofiler_agent_cache_t, size) - 8usize];
    ["Offset of field: rocprofiler_agent_cache_t::level"]
        [::std::mem::offset_of!(rocprofiler_agent_cache_t, level) - 16usize];
    ["Offset of field: rocprofiler_agent_cache_t::cache_line_size"]
        [::std::mem::offset_of!(rocprofiler_agent_cache_t, cache_line_size) - 20usize];
    ["Offset of field: rocprofiler_agent_cache_t::cache_lines_per_tag"]
        [::std::mem::offset_of!(rocprofiler_agent_cache_t, cache_lines_per_tag) - 24usize];
    ["Offset of field: rocprofiler_agent_cache_t::association"]
        [::std::mem::offset_of!(rocprofiler_agent_cache_t, association) - 28usize];
    ["Offset of field: rocprofiler_agent_cache_t::latency"]
        [::std::mem::offset_of!(rocprofiler_agent_cache_t, latency) - 32usize];
    ["Offset of field: rocprofiler_agent_cache_t::type_"]
        [::std::mem::offset_of!(rocprofiler_agent_cache_t, type_) - 36usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rocprofiler_agent_io_link_t {
    pub type_: HSA_IOLINKTYPE,
    pub version_major: u32,
    pub version_minor: u32,
    pub node_from: u32,
    pub node_to: u32,
    pub weight: u32,
    pub min_latency: u32,
    pub max_latency: u32,
    pub min_bandwidth: u32,
    pub max_bandwidth: u32,
    pub recommended_transfer_size: u32,
    pub flags: HSA_LINKPROPERTY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_agent_io_link_t"]
        [::std::mem::size_of::<rocprofiler_agent_io_link_t>() - 48usize];
    ["Alignment of rocprofiler_agent_io_link_t"]
        [::std::mem::align_of::<rocprofiler_agent_io_link_t>() - 4usize];
    ["Offset of field: rocprofiler_agent_io_link_t::type_"]
        [::std::mem::offset_of!(rocprofiler_agent_io_link_t, type_) - 0usize];
    ["Offset of field: rocprofiler_agent_io_link_t::version_major"]
        [::std::mem::offset_of!(rocprofiler_agent_io_link_t, version_major) - 4usize];
    ["Offset of field: rocprofiler_agent_io_link_t::version_minor"]
        [::std::mem::offset_of!(rocprofiler_agent_io_link_t, version_minor) - 8usize];
    ["Offset of field: rocprofiler_agent_io_link_t::node_from"]
        [::std::mem::offset_of!(rocprofiler_agent_io_link_t, node_from) - 12usize];
    ["Offset of field: rocprofiler_agent_io_link_t::node_to"]
        [::std::mem::offset_of!(rocprofiler_agent_io_link_t, node_to) - 16usize];
    ["Offset of field: rocprofiler_agent_io_link_t::weight"]
        [::std::mem::offset_of!(rocprofiler_agent_io_link_t, weight) - 20usize];
    ["Offset of field: rocprofiler_agent_io_link_t::min_latency"]
        [::std::mem::offset_of!(rocprofiler_agent_io_link_t, min_latency) - 24usize];
    ["Offset of field: rocprofiler_agent_io_link_t::max_latency"]
        [::std::mem::offset_of!(rocprofiler_agent_io_link_t, max_latency) - 28usize];
    ["Offset of field: rocprofiler_agent_io_link_t::min_bandwidth"]
        [::std::mem::offset_of!(rocprofiler_agent_io_link_t, min_bandwidth) - 32usize];
    ["Offset of field: rocprofiler_agent_io_link_t::max_bandwidth"]
        [::std::mem::offset_of!(rocprofiler_agent_io_link_t, max_bandwidth) - 36usize];
    ["Offset of field: rocprofiler_agent_io_link_t::recommended_transfer_size"]
        [::std::mem::offset_of!(rocprofiler_agent_io_link_t, recommended_transfer_size) - 40usize];
    ["Offset of field: rocprofiler_agent_io_link_t::flags"]
        [::std::mem::offset_of!(rocprofiler_agent_io_link_t, flags) - 44usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rocprofiler_agent_mem_bank_t {
    pub heap_type: HSA_HEAPTYPE,
    pub flags: HSA_MEMORYPROPERTY,
    pub width: u32,
    pub mem_clk_max: u32,
    pub size_in_bytes: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_agent_mem_bank_t"]
        [::std::mem::size_of::<rocprofiler_agent_mem_bank_t>() - 24usize];
    ["Alignment of rocprofiler_agent_mem_bank_t"]
        [::std::mem::align_of::<rocprofiler_agent_mem_bank_t>() - 8usize];
    ["Offset of field: rocprofiler_agent_mem_bank_t::heap_type"]
        [::std::mem::offset_of!(rocprofiler_agent_mem_bank_t, heap_type) - 0usize];
    ["Offset of field: rocprofiler_agent_mem_bank_t::flags"]
        [::std::mem::offset_of!(rocprofiler_agent_mem_bank_t, flags) - 4usize];
    ["Offset of field: rocprofiler_agent_mem_bank_t::width"]
        [::std::mem::offset_of!(rocprofiler_agent_mem_bank_t, width) - 8usize];
    ["Offset of field: rocprofiler_agent_mem_bank_t::mem_clk_max"]
        [::std::mem::offset_of!(rocprofiler_agent_mem_bank_t, mem_clk_max) - 12usize];
    ["Offset of field: rocprofiler_agent_mem_bank_t::size_in_bytes"]
        [::std::mem::offset_of!(rocprofiler_agent_mem_bank_t, size_in_bytes) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rocprofiler_agent_runtime_visiblity_t {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_agent_runtime_visiblity_t"]
        [::std::mem::size_of::<rocprofiler_agent_runtime_visiblity_t>() - 4usize];
    ["Alignment of rocprofiler_agent_runtime_visiblity_t"]
        [::std::mem::align_of::<rocprofiler_agent_runtime_visiblity_t>() - 4usize];
};
impl rocprofiler_agent_runtime_visiblity_t {
    #[inline]
    pub fn hsa(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hsa(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hsa_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hsa_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hip(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hip(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hip_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hip_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rccl(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_rccl(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rccl_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_rccl_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rocdecode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_rocdecode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rocdecode_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_rocdecode_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 28u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 28u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn reserved_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                28u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_reserved_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                28u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        hsa: u32,
        hip: u32,
        rccl: u32,
        rocdecode: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let hsa: u32 = unsafe { ::std::mem::transmute(hsa) };
            hsa as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let hip: u32 = unsafe { ::std::mem::transmute(hip) };
            hip as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let rccl: u32 = unsafe { ::std::mem::transmute(rccl) };
            rccl as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let rocdecode: u32 = unsafe { ::std::mem::transmute(rocdecode) };
            rocdecode as u64
        });
        __bindgen_bitfield_unit.set(4usize, 28u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rocprofiler_agent_v0_t {
    pub size: u64,
    pub id: rocprofiler_agent_id_t,
    pub type_: rocprofiler_agent_type_t,
    pub cpu_cores_count: u32,
    pub simd_count: u32,
    pub mem_banks_count: u32,
    pub caches_count: u32,
    pub io_links_count: u32,
    pub cpu_core_id_base: u32,
    pub simd_id_base: u32,
    pub max_waves_per_simd: u32,
    pub lds_size_in_kb: u32,
    pub gds_size_in_kb: u32,
    pub num_gws: u32,
    pub wave_front_size: u32,
    pub num_xcc: u32,
    pub cu_count: u32,
    pub array_count: u32,
    pub num_shader_banks: u32,
    pub simd_arrays_per_engine: u32,
    pub cu_per_simd_array: u32,
    pub simd_per_cu: u32,
    pub max_slots_scratch_cu: u32,
    pub gfx_target_version: u32,
    pub vendor_id: u16,
    pub device_id: u16,
    pub location_id: u32,
    pub domain: u32,
    pub drm_render_minor: u32,
    pub num_sdma_engines: u32,
    pub num_sdma_xgmi_engines: u32,
    pub num_sdma_queues_per_engine: u32,
    pub num_cp_queues: u32,
    pub max_engine_clk_ccompute: u32,
    pub max_engine_clk_fcompute: u32,
    pub sdma_fw_version: HSA_ENGINE_VERSION,
    pub fw_version: HSA_ENGINE_ID,
    pub capability: HSA_CAPABILITY,
    pub cu_per_engine: u32,
    pub max_waves_per_cu: u32,
    pub family_id: u32,
    pub workgroup_max_size: u32,
    pub grid_max_size: u32,
    pub local_mem_size: u64,
    pub hive_id: u64,
    pub gpu_id: u64,
    pub workgroup_max_dim: rocprofiler_dim3_t,
    pub grid_max_dim: rocprofiler_dim3_t,
    pub mem_banks: *const rocprofiler_agent_mem_bank_t,
    pub caches: *const rocprofiler_agent_cache_t,
    pub io_links: *const rocprofiler_agent_io_link_t,
    pub name: *const ::std::os::raw::c_char,
    pub vendor_name: *const ::std::os::raw::c_char,
    pub product_name: *const ::std::os::raw::c_char,
    pub model_name: *const ::std::os::raw::c_char,
    pub node_id: u32,
    pub logical_node_id: i32,
    pub logical_node_type_id: i32,
    pub runtime_visibility: rocprofiler_agent_runtime_visiblity_t,
    pub uuid: rocprofiler_uuid_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rocprofiler_agent_v0_t"][::std::mem::size_of::<rocprofiler_agent_v0_t>() - 312usize];
    ["Alignment of rocprofiler_agent_v0_t"]
        [::std::mem::align_of::<rocprofiler_agent_v0_t>() - 8usize];
    ["Offset of field: rocprofiler_agent_v0_t::size"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, size) - 0usize];
    ["Offset of field: rocprofiler_agent_v0_t::id"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, id) - 8usize];
    ["Offset of field: rocprofiler_agent_v0_t::type_"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, type_) - 16usize];
    ["Offset of field: rocprofiler_agent_v0_t::cpu_cores_count"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, cpu_cores_count) - 20usize];
    ["Offset of field: rocprofiler_agent_v0_t::simd_count"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, simd_count) - 24usize];
    ["Offset of field: rocprofiler_agent_v0_t::mem_banks_count"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, mem_banks_count) - 28usize];
    ["Offset of field: rocprofiler_agent_v0_t::caches_count"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, caches_count) - 32usize];
    ["Offset of field: rocprofiler_agent_v0_t::io_links_count"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, io_links_count) - 36usize];
    ["Offset of field: rocprofiler_agent_v0_t::cpu_core_id_base"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, cpu_core_id_base) - 40usize];
    ["Offset of field: rocprofiler_agent_v0_t::simd_id_base"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, simd_id_base) - 44usize];
    ["Offset of field: rocprofiler_agent_v0_t::max_waves_per_simd"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, max_waves_per_simd) - 48usize];
    ["Offset of field: rocprofiler_agent_v0_t::lds_size_in_kb"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, lds_size_in_kb) - 52usize];
    ["Offset of field: rocprofiler_agent_v0_t::gds_size_in_kb"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, gds_size_in_kb) - 56usize];
    ["Offset of field: rocprofiler_agent_v0_t::num_gws"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, num_gws) - 60usize];
    ["Offset of field: rocprofiler_agent_v0_t::wave_front_size"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, wave_front_size) - 64usize];
    ["Offset of field: rocprofiler_agent_v0_t::num_xcc"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, num_xcc) - 68usize];
    ["Offset of field: rocprofiler_agent_v0_t::cu_count"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, cu_count) - 72usize];
    ["Offset of field: rocprofiler_agent_v0_t::array_count"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, array_count) - 76usize];
    ["Offset of field: rocprofiler_agent_v0_t::num_shader_banks"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, num_shader_banks) - 80usize];
    ["Offset of field: rocprofiler_agent_v0_t::simd_arrays_per_engine"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, simd_arrays_per_engine) - 84usize];
    ["Offset of field: rocprofiler_agent_v0_t::cu_per_simd_array"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, cu_per_simd_array) - 88usize];
    ["Offset of field: rocprofiler_agent_v0_t::simd_per_cu"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, simd_per_cu) - 92usize];
    ["Offset of field: rocprofiler_agent_v0_t::max_slots_scratch_cu"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, max_slots_scratch_cu) - 96usize];
    ["Offset of field: rocprofiler_agent_v0_t::gfx_target_version"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, gfx_target_version) - 100usize];
    ["Offset of field: rocprofiler_agent_v0_t::vendor_id"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, vendor_id) - 104usize];
    ["Offset of field: rocprofiler_agent_v0_t::device_id"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, device_id) - 106usize];
    ["Offset of field: rocprofiler_agent_v0_t::location_id"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, location_id) - 108usize];
    ["Offset of field: rocprofiler_agent_v0_t::domain"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, domain) - 112usize];
    ["Offset of field: rocprofiler_agent_v0_t::drm_render_minor"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, drm_render_minor) - 116usize];
    ["Offset of field: rocprofiler_agent_v0_t::num_sdma_engines"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, num_sdma_engines) - 120usize];
    ["Offset of field: rocprofiler_agent_v0_t::num_sdma_xgmi_engines"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, num_sdma_xgmi_engines) - 124usize];
    ["Offset of field: rocprofiler_agent_v0_t::num_sdma_queues_per_engine"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, num_sdma_queues_per_engine) - 128usize];
    ["Offset of field: rocprofiler_agent_v0_t::num_cp_queues"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, num_cp_queues) - 132usize];
    ["Offset of field: rocprofiler_agent_v0_t::max_engine_clk_ccompute"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, max_engine_clk_ccompute) - 136usize];
    ["Offset of field: rocprofiler_agent_v0_t::max_engine_clk_fcompute"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, max_engine_clk_fcompute) - 140usize];
    ["Offset of field: rocprofiler_agent_v0_t::sdma_fw_version"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, sdma_fw_version) - 144usize];
    ["Offset of field: rocprofiler_agent_v0_t::fw_version"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, fw_version) - 148usize];
    ["Offset of field: rocprofiler_agent_v0_t::capability"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, capability) - 152usize];
    ["Offset of field: rocprofiler_agent_v0_t::cu_per_engine"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, cu_per_engine) - 156usize];
    ["Offset of field: rocprofiler_agent_v0_t::max_waves_per_cu"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, max_waves_per_cu) - 160usize];
    ["Offset of field: rocprofiler_agent_v0_t::family_id"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, family_id) - 164usize];
    ["Offset of field: rocprofiler_agent_v0_t::workgroup_max_size"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, workgroup_max_size) - 168usize];
    ["Offset of field: rocprofiler_agent_v0_t::grid_max_size"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, grid_max_size) - 172usize];
    ["Offset of field: rocprofiler_agent_v0_t::local_mem_size"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, local_mem_size) - 176usize];
    ["Offset of field: rocprofiler_agent_v0_t::hive_id"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, hive_id) - 184usize];
    ["Offset of field: rocprofiler_agent_v0_t::gpu_id"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, gpu_id) - 192usize];
    ["Offset of field: rocprofiler_agent_v0_t::workgroup_max_dim"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, workgroup_max_dim) - 200usize];
    ["Offset of field: rocprofiler_agent_v0_t::grid_max_dim"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, grid_max_dim) - 212usize];
    ["Offset of field: rocprofiler_agent_v0_t::mem_banks"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, mem_banks) - 224usize];
    ["Offset of field: rocprofiler_agent_v0_t::caches"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, caches) - 232usize];
    ["Offset of field: rocprofiler_agent_v0_t::io_links"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, io_links) - 240usize];
    ["Offset of field: rocprofiler_agent_v0_t::name"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, name) - 248usize];
    ["Offset of field: rocprofiler_agent_v0_t::vendor_name"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, vendor_name) - 256usize];
    ["Offset of field: rocprofiler_agent_v0_t::product_name"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, product_name) - 264usize];
    ["Offset of field: rocprofiler_agent_v0_t::model_name"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, model_name) - 272usize];
    ["Offset of field: rocprofiler_agent_v0_t::node_id"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, node_id) - 280usize];
    ["Offset of field: rocprofiler_agent_v0_t::logical_node_id"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, logical_node_id) - 284usize];
    ["Offset of field: rocprofiler_agent_v0_t::logical_node_type_id"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, logical_node_type_id) - 288usize];
    ["Offset of field: rocprofiler_agent_v0_t::runtime_visibility"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, runtime_visibility) - 292usize];
    ["Offset of field: rocprofiler_agent_v0_t::uuid"]
        [::std::mem::offset_of!(rocprofiler_agent_v0_t, uuid) - 296usize];
};
pub type rocprofiler_agent_t = rocprofiler_agent_v0_t;
pub type rocprofiler_query_available_agents_cb_t = ::std::option::Option<
    unsafe extern "C" fn(
        version: rocprofiler_agent_version_t,
        agents: *mut *const ::std::os::raw::c_void,
        num_agents: usize,
        user_data: *mut ::std::os::raw::c_void,
    ) -> rocprofiler_status_t,
>;
pub type rocprofiler_buffer_tracing_cb_t = ::std::option::Option<
    unsafe extern "C" fn(
        context: rocprofiler_context_id_t,
        buffer_id: rocprofiler_buffer_id_t,
        headers: *mut *mut rocprofiler_record_header_t,
        num_headers: usize,
        data: *mut ::std::os::raw::c_void,
        drop_count: u64,
    ),
>;
pub const hipJitOption_hipJitOptionMaxRegisters: hipJitOption = 0;
pub const hipJitOption_hipJitOptionThreadsPerBlock: hipJitOption = 1;
pub const hipJitOption_hipJitOptionWallTime: hipJitOption = 2;
pub const hipJitOption_hipJitOptionInfoLogBuffer: hipJitOption = 3;
pub const hipJitOption_hipJitOptionInfoLogBufferSizeBytes: hipJitOption = 4;
pub const hipJitOption_hipJitOptionErrorLogBuffer: hipJitOption = 5;
pub const hipJitOption_hipJitOptionErrorLogBufferSizeBytes: hipJitOption = 6;
pub const hipJitOption_hipJitOptionOptimizationLevel: hipJitOption = 7;
pub const hipJitOption_hipJitOptionTargetFromContext: hipJitOption = 8;
pub const hipJitOption_hipJitOptionTarget: hipJitOption = 9;
pub const hipJitOption_hipJitOptionFallbackStrategy: hipJitOption = 10;
pub const hipJitOption_hipJitOptionGenerateDebugInfo: hipJitOption = 11;
pub const hipJitOption_hipJitOptionLogVerbose: hipJitOption = 12;
pub const hipJitOption_hipJitOptionGenerateLineInfo: hipJitOption = 13;
pub const hipJitOption_hipJitOptionCacheMode: hipJitOption = 14;
pub const hipJitOption_hipJitOptionSm3xOpt: hipJitOption = 15;
pub const hipJitOption_hipJitOptionFastCompile: hipJitOption = 16;
pub const hipJitOption_hipJitOptionGlobalSymbolNames: hipJitOption = 17;
pub const hipJitOption_hipJitOptionGlobalSymbolAddresses: hipJitOption = 18;
pub const hipJitOption_hipJitOptionGlobalSymbolCount: hipJitOption = 19;
pub const hipJitOption_hipJitOptionLto: hipJitOption = 20;
pub const hipJitOption_hipJitOptionFtz: hipJitOption = 21;
pub const hipJitOption_hipJitOptionPrecDiv: hipJitOption = 22;
pub const hipJitOption_hipJitOptionPrecSqrt: hipJitOption = 23;
pub const hipJitOption_hipJitOptionFma: hipJitOption = 24;
pub const hipJitOption_hipJitOptionPositionIndependentCode: hipJitOption = 25;
pub const hipJitOption_hipJitOptionMinCTAPerSM: hipJitOption = 26;
pub const hipJitOption_hipJitOptionMaxThreadsPerBlock: hipJitOption = 27;
pub const hipJitOption_hipJitOptionOverrideDirectiveValues: hipJitOption = 28;
pub const hipJitOption_hipJitOptionNumOptions: hipJitOption = 29;
pub const hipJitOption_hipJitOptionIRtoISAOptExt: hipJitOption = 10000;
pub const hipJitOption_hipJitOptionIRtoISAOptCountExt: hipJitOption = 10001;
pub type hipJitOption = ::std::os::raw::c_uint;
pub const hipJitInputType_hipJitInputCubin: hipJitInputType = 0;
pub const hipJitInputType_hipJitInputPtx: hipJitInputType = 1;
pub const hipJitInputType_hipJitInputFatBinary: hipJitInputType = 2;
pub const hipJitInputType_hipJitInputObject: hipJitInputType = 3;
pub const hipJitInputType_hipJitInputLibrary: hipJitInputType = 4;
pub const hipJitInputType_hipJitInputNvvm: hipJitInputType = 5;
pub const hipJitInputType_hipJitNumLegacyInputTypes: hipJitInputType = 6;
pub const hipJitInputType_hipJitInputLLVMBitcode: hipJitInputType = 100;
pub const hipJitInputType_hipJitInputLLVMBundledBitcode: hipJitInputType = 101;
pub const hipJitInputType_hipJitInputLLVMArchivesOfBundledBitcode: hipJitInputType = 102;
pub const hipJitInputType_hipJitInputSpirv: hipJitInputType = 103;
pub const hipJitInputType_hipJitNumInputTypes: hipJitInputType = 10;
pub type hipJitInputType = ::std::os::raw::c_uint;
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct hipDeviceArch_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub __bindgen_padding_0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipDeviceArch_t"][::std::mem::size_of::<hipDeviceArch_t>() - 4usize];
    ["Alignment of hipDeviceArch_t"][::std::mem::align_of::<hipDeviceArch_t>() - 4usize];
};
impl hipDeviceArch_t {
    #[inline]
    pub fn hasGlobalInt32Atomics(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasGlobalInt32Atomics(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasGlobalInt32Atomics_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasGlobalInt32Atomics_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasGlobalFloatAtomicExch(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasGlobalFloatAtomicExch(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasGlobalFloatAtomicExch_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasGlobalFloatAtomicExch_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasSharedInt32Atomics(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasSharedInt32Atomics(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasSharedInt32Atomics_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasSharedInt32Atomics_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasSharedFloatAtomicExch(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasSharedFloatAtomicExch(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasSharedFloatAtomicExch_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasSharedFloatAtomicExch_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasFloatAtomicAdd(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasFloatAtomicAdd(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasFloatAtomicAdd_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasFloatAtomicAdd_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasGlobalInt64Atomics(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasGlobalInt64Atomics(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasGlobalInt64Atomics_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasGlobalInt64Atomics_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasSharedInt64Atomics(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasSharedInt64Atomics(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasSharedInt64Atomics_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasSharedInt64Atomics_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasDoubles(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasDoubles(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasDoubles_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasDoubles_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasWarpVote(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasWarpVote(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasWarpVote_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasWarpVote_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasWarpBallot(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasWarpBallot(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasWarpBallot_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasWarpBallot_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasWarpShuffle(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasWarpShuffle(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasWarpShuffle_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasWarpShuffle_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasFunnelShift(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasFunnelShift(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasFunnelShift_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasFunnelShift_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasThreadFenceSystem(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasThreadFenceSystem(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasThreadFenceSystem_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasThreadFenceSystem_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasSyncThreadsExt(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasSyncThreadsExt(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasSyncThreadsExt_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasSyncThreadsExt_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasSurfaceFuncs(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasSurfaceFuncs(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasSurfaceFuncs_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasSurfaceFuncs_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn has3dGrid(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_has3dGrid(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn has3dGrid_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_has3dGrid_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hasDynamicParallelism(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasDynamicParallelism(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hasDynamicParallelism_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hasDynamicParallelism_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        hasGlobalInt32Atomics: ::std::os::raw::c_uint,
        hasGlobalFloatAtomicExch: ::std::os::raw::c_uint,
        hasSharedInt32Atomics: ::std::os::raw::c_uint,
        hasSharedFloatAtomicExch: ::std::os::raw::c_uint,
        hasFloatAtomicAdd: ::std::os::raw::c_uint,
        hasGlobalInt64Atomics: ::std::os::raw::c_uint,
        hasSharedInt64Atomics: ::std::os::raw::c_uint,
        hasDoubles: ::std::os::raw::c_uint,
        hasWarpVote: ::std::os::raw::c_uint,
        hasWarpBallot: ::std::os::raw::c_uint,
        hasWarpShuffle: ::std::os::raw::c_uint,
        hasFunnelShift: ::std::os::raw::c_uint,
        hasThreadFenceSystem: ::std::os::raw::c_uint,
        hasSyncThreadsExt: ::std::os::raw::c_uint,
        hasSurfaceFuncs: ::std::os::raw::c_uint,
        has3dGrid: ::std::os::raw::c_uint,
        hasDynamicParallelism: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let hasGlobalInt32Atomics: u32 =
                unsafe { ::std::mem::transmute(hasGlobalInt32Atomics) };
            hasGlobalInt32Atomics as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let hasGlobalFloatAtomicExch: u32 =
                unsafe { ::std::mem::transmute(hasGlobalFloatAtomicExch) };
            hasGlobalFloatAtomicExch as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let hasSharedInt32Atomics: u32 =
                unsafe { ::std::mem::transmute(hasSharedInt32Atomics) };
            hasSharedInt32Atomics as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let hasSharedFloatAtomicExch: u32 =
                unsafe { ::std::mem::transmute(hasSharedFloatAtomicExch) };
            hasSharedFloatAtomicExch as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let hasFloatAtomicAdd: u32 = unsafe { ::std::mem::transmute(hasFloatAtomicAdd) };
            hasFloatAtomicAdd as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let hasGlobalInt64Atomics: u32 =
                unsafe { ::std::mem::transmute(hasGlobalInt64Atomics) };
            hasGlobalInt64Atomics as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let hasSharedInt64Atomics: u32 =
                unsafe { ::std::mem::transmute(hasSharedInt64Atomics) };
            hasSharedInt64Atomics as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let hasDoubles: u32 = unsafe { ::std::mem::transmute(hasDoubles) };
            hasDoubles as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let hasWarpVote: u32 = unsafe { ::std::mem::transmute(hasWarpVote) };
            hasWarpVote as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let hasWarpBallot: u32 = unsafe { ::std::mem::transmute(hasWarpBallot) };
            hasWarpBallot as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let hasWarpShuffle: u32 = unsafe { ::std::mem::transmute(hasWarpShuffle) };
            hasWarpShuffle as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let hasFunnelShift: u32 = unsafe { ::std::mem::transmute(hasFunnelShift) };
            hasFunnelShift as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let hasThreadFenceSystem: u32 = unsafe { ::std::mem::transmute(hasThreadFenceSystem) };
            hasThreadFenceSystem as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let hasSyncThreadsExt: u32 = unsafe { ::std::mem::transmute(hasSyncThreadsExt) };
            hasSyncThreadsExt as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let hasSurfaceFuncs: u32 = unsafe { ::std::mem::transmute(hasSurfaceFuncs) };
            hasSurfaceFuncs as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let has3dGrid: u32 = unsafe { ::std::mem::transmute(has3dGrid) };
            has3dGrid as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let hasDynamicParallelism: u32 =
                unsafe { ::std::mem::transmute(hasDynamicParallelism) };
            hasDynamicParallelism as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipUUID_t {
    pub bytes: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipUUID_t"][::std::mem::size_of::<hipUUID_t>() - 16usize];
    ["Alignment of hipUUID_t"][::std::mem::align_of::<hipUUID_t>() - 1usize];
    ["Offset of field: hipUUID_t::bytes"][::std::mem::offset_of!(hipUUID_t, bytes) - 0usize];
};
pub type hipUUID = hipUUID_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipDeviceProp_tR0600 {
    pub name: [::std::os::raw::c_char; 256usize],
    pub uuid: hipUUID,
    pub luid: [::std::os::raw::c_char; 8usize],
    pub luidDeviceNodeMask: ::std::os::raw::c_uint,
    pub totalGlobalMem: usize,
    pub sharedMemPerBlock: usize,
    pub regsPerBlock: ::std::os::raw::c_int,
    pub warpSize: ::std::os::raw::c_int,
    pub memPitch: usize,
    pub maxThreadsPerBlock: ::std::os::raw::c_int,
    pub maxThreadsDim: [::std::os::raw::c_int; 3usize],
    pub maxGridSize: [::std::os::raw::c_int; 3usize],
    pub clockRate: ::std::os::raw::c_int,
    pub totalConstMem: usize,
    pub major: ::std::os::raw::c_int,
    pub minor: ::std::os::raw::c_int,
    pub textureAlignment: usize,
    pub texturePitchAlignment: usize,
    pub deviceOverlap: ::std::os::raw::c_int,
    pub multiProcessorCount: ::std::os::raw::c_int,
    pub kernelExecTimeoutEnabled: ::std::os::raw::c_int,
    pub integrated: ::std::os::raw::c_int,
    pub canMapHostMemory: ::std::os::raw::c_int,
    pub computeMode: ::std::os::raw::c_int,
    pub maxTexture1D: ::std::os::raw::c_int,
    pub maxTexture1DMipmap: ::std::os::raw::c_int,
    pub maxTexture1DLinear: ::std::os::raw::c_int,
    pub maxTexture2D: [::std::os::raw::c_int; 2usize],
    pub maxTexture2DMipmap: [::std::os::raw::c_int; 2usize],
    pub maxTexture2DLinear: [::std::os::raw::c_int; 3usize],
    pub maxTexture2DGather: [::std::os::raw::c_int; 2usize],
    pub maxTexture3D: [::std::os::raw::c_int; 3usize],
    pub maxTexture3DAlt: [::std::os::raw::c_int; 3usize],
    pub maxTextureCubemap: ::std::os::raw::c_int,
    pub maxTexture1DLayered: [::std::os::raw::c_int; 2usize],
    pub maxTexture2DLayered: [::std::os::raw::c_int; 3usize],
    pub maxTextureCubemapLayered: [::std::os::raw::c_int; 2usize],
    pub maxSurface1D: ::std::os::raw::c_int,
    pub maxSurface2D: [::std::os::raw::c_int; 2usize],
    pub maxSurface3D: [::std::os::raw::c_int; 3usize],
    pub maxSurface1DLayered: [::std::os::raw::c_int; 2usize],
    pub maxSurface2DLayered: [::std::os::raw::c_int; 3usize],
    pub maxSurfaceCubemap: ::std::os::raw::c_int,
    pub maxSurfaceCubemapLayered: [::std::os::raw::c_int; 2usize],
    pub surfaceAlignment: usize,
    pub concurrentKernels: ::std::os::raw::c_int,
    pub ECCEnabled: ::std::os::raw::c_int,
    pub pciBusID: ::std::os::raw::c_int,
    pub pciDeviceID: ::std::os::raw::c_int,
    pub pciDomainID: ::std::os::raw::c_int,
    pub tccDriver: ::std::os::raw::c_int,
    pub asyncEngineCount: ::std::os::raw::c_int,
    pub unifiedAddressing: ::std::os::raw::c_int,
    pub memoryClockRate: ::std::os::raw::c_int,
    pub memoryBusWidth: ::std::os::raw::c_int,
    pub l2CacheSize: ::std::os::raw::c_int,
    pub persistingL2CacheMaxSize: ::std::os::raw::c_int,
    pub maxThreadsPerMultiProcessor: ::std::os::raw::c_int,
    pub streamPrioritiesSupported: ::std::os::raw::c_int,
    pub globalL1CacheSupported: ::std::os::raw::c_int,
    pub localL1CacheSupported: ::std::os::raw::c_int,
    pub sharedMemPerMultiprocessor: usize,
    pub regsPerMultiprocessor: ::std::os::raw::c_int,
    pub managedMemory: ::std::os::raw::c_int,
    pub isMultiGpuBoard: ::std::os::raw::c_int,
    pub multiGpuBoardGroupID: ::std::os::raw::c_int,
    pub hostNativeAtomicSupported: ::std::os::raw::c_int,
    pub singleToDoublePrecisionPerfRatio: ::std::os::raw::c_int,
    pub pageableMemoryAccess: ::std::os::raw::c_int,
    pub concurrentManagedAccess: ::std::os::raw::c_int,
    pub computePreemptionSupported: ::std::os::raw::c_int,
    pub canUseHostPointerForRegisteredMem: ::std::os::raw::c_int,
    pub cooperativeLaunch: ::std::os::raw::c_int,
    pub cooperativeMultiDeviceLaunch: ::std::os::raw::c_int,
    pub sharedMemPerBlockOptin: usize,
    pub pageableMemoryAccessUsesHostPageTables: ::std::os::raw::c_int,
    pub directManagedMemAccessFromHost: ::std::os::raw::c_int,
    pub maxBlocksPerMultiProcessor: ::std::os::raw::c_int,
    pub accessPolicyMaxWindowSize: ::std::os::raw::c_int,
    pub reservedSharedMemPerBlock: usize,
    pub hostRegisterSupported: ::std::os::raw::c_int,
    pub sparseHipArraySupported: ::std::os::raw::c_int,
    pub hostRegisterReadOnlySupported: ::std::os::raw::c_int,
    pub timelineSemaphoreInteropSupported: ::std::os::raw::c_int,
    pub memoryPoolsSupported: ::std::os::raw::c_int,
    pub gpuDirectRDMASupported: ::std::os::raw::c_int,
    pub gpuDirectRDMAFlushWritesOptions: ::std::os::raw::c_uint,
    pub gpuDirectRDMAWritesOrdering: ::std::os::raw::c_int,
    pub memoryPoolSupportedHandleTypes: ::std::os::raw::c_uint,
    pub deferredMappingHipArraySupported: ::std::os::raw::c_int,
    pub ipcEventSupported: ::std::os::raw::c_int,
    pub clusterLaunch: ::std::os::raw::c_int,
    pub unifiedFunctionPointers: ::std::os::raw::c_int,
    pub reserved: [::std::os::raw::c_int; 63usize],
    pub hipReserved: [::std::os::raw::c_int; 32usize],
    pub gcnArchName: [::std::os::raw::c_char; 256usize],
    pub maxSharedMemoryPerMultiProcessor: usize,
    pub clockInstructionRate: ::std::os::raw::c_int,
    pub arch: hipDeviceArch_t,
    pub hdpMemFlushCntl: *mut ::std::os::raw::c_uint,
    pub hdpRegFlushCntl: *mut ::std::os::raw::c_uint,
    pub cooperativeMultiDeviceUnmatchedFunc: ::std::os::raw::c_int,
    pub cooperativeMultiDeviceUnmatchedGridDim: ::std::os::raw::c_int,
    pub cooperativeMultiDeviceUnmatchedBlockDim: ::std::os::raw::c_int,
    pub cooperativeMultiDeviceUnmatchedSharedMem: ::std::os::raw::c_int,
    pub isLargeBar: ::std::os::raw::c_int,
    pub asicRevision: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipDeviceProp_tR0600"][::std::mem::size_of::<hipDeviceProp_tR0600>() - 1472usize];
    ["Alignment of hipDeviceProp_tR0600"][::std::mem::align_of::<hipDeviceProp_tR0600>() - 8usize];
    ["Offset of field: hipDeviceProp_tR0600::name"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, name) - 0usize];
    ["Offset of field: hipDeviceProp_tR0600::uuid"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, uuid) - 256usize];
    ["Offset of field: hipDeviceProp_tR0600::luid"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, luid) - 272usize];
    ["Offset of field: hipDeviceProp_tR0600::luidDeviceNodeMask"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, luidDeviceNodeMask) - 280usize];
    ["Offset of field: hipDeviceProp_tR0600::totalGlobalMem"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, totalGlobalMem) - 288usize];
    ["Offset of field: hipDeviceProp_tR0600::sharedMemPerBlock"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, sharedMemPerBlock) - 296usize];
    ["Offset of field: hipDeviceProp_tR0600::regsPerBlock"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, regsPerBlock) - 304usize];
    ["Offset of field: hipDeviceProp_tR0600::warpSize"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, warpSize) - 308usize];
    ["Offset of field: hipDeviceProp_tR0600::memPitch"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, memPitch) - 312usize];
    ["Offset of field: hipDeviceProp_tR0600::maxThreadsPerBlock"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxThreadsPerBlock) - 320usize];
    ["Offset of field: hipDeviceProp_tR0600::maxThreadsDim"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxThreadsDim) - 324usize];
    ["Offset of field: hipDeviceProp_tR0600::maxGridSize"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxGridSize) - 336usize];
    ["Offset of field: hipDeviceProp_tR0600::clockRate"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, clockRate) - 348usize];
    ["Offset of field: hipDeviceProp_tR0600::totalConstMem"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, totalConstMem) - 352usize];
    ["Offset of field: hipDeviceProp_tR0600::major"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, major) - 360usize];
    ["Offset of field: hipDeviceProp_tR0600::minor"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, minor) - 364usize];
    ["Offset of field: hipDeviceProp_tR0600::textureAlignment"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, textureAlignment) - 368usize];
    ["Offset of field: hipDeviceProp_tR0600::texturePitchAlignment"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, texturePitchAlignment) - 376usize];
    ["Offset of field: hipDeviceProp_tR0600::deviceOverlap"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, deviceOverlap) - 384usize];
    ["Offset of field: hipDeviceProp_tR0600::multiProcessorCount"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, multiProcessorCount) - 388usize];
    ["Offset of field: hipDeviceProp_tR0600::kernelExecTimeoutEnabled"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, kernelExecTimeoutEnabled) - 392usize];
    ["Offset of field: hipDeviceProp_tR0600::integrated"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, integrated) - 396usize];
    ["Offset of field: hipDeviceProp_tR0600::canMapHostMemory"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, canMapHostMemory) - 400usize];
    ["Offset of field: hipDeviceProp_tR0600::computeMode"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, computeMode) - 404usize];
    ["Offset of field: hipDeviceProp_tR0600::maxTexture1D"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxTexture1D) - 408usize];
    ["Offset of field: hipDeviceProp_tR0600::maxTexture1DMipmap"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxTexture1DMipmap) - 412usize];
    ["Offset of field: hipDeviceProp_tR0600::maxTexture1DLinear"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxTexture1DLinear) - 416usize];
    ["Offset of field: hipDeviceProp_tR0600::maxTexture2D"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxTexture2D) - 420usize];
    ["Offset of field: hipDeviceProp_tR0600::maxTexture2DMipmap"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxTexture2DMipmap) - 428usize];
    ["Offset of field: hipDeviceProp_tR0600::maxTexture2DLinear"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxTexture2DLinear) - 436usize];
    ["Offset of field: hipDeviceProp_tR0600::maxTexture2DGather"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxTexture2DGather) - 448usize];
    ["Offset of field: hipDeviceProp_tR0600::maxTexture3D"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxTexture3D) - 456usize];
    ["Offset of field: hipDeviceProp_tR0600::maxTexture3DAlt"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxTexture3DAlt) - 468usize];
    ["Offset of field: hipDeviceProp_tR0600::maxTextureCubemap"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxTextureCubemap) - 480usize];
    ["Offset of field: hipDeviceProp_tR0600::maxTexture1DLayered"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxTexture1DLayered) - 484usize];
    ["Offset of field: hipDeviceProp_tR0600::maxTexture2DLayered"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxTexture2DLayered) - 492usize];
    ["Offset of field: hipDeviceProp_tR0600::maxTextureCubemapLayered"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxTextureCubemapLayered) - 504usize];
    ["Offset of field: hipDeviceProp_tR0600::maxSurface1D"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxSurface1D) - 512usize];
    ["Offset of field: hipDeviceProp_tR0600::maxSurface2D"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxSurface2D) - 516usize];
    ["Offset of field: hipDeviceProp_tR0600::maxSurface3D"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxSurface3D) - 524usize];
    ["Offset of field: hipDeviceProp_tR0600::maxSurface1DLayered"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxSurface1DLayered) - 536usize];
    ["Offset of field: hipDeviceProp_tR0600::maxSurface2DLayered"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxSurface2DLayered) - 544usize];
    ["Offset of field: hipDeviceProp_tR0600::maxSurfaceCubemap"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxSurfaceCubemap) - 556usize];
    ["Offset of field: hipDeviceProp_tR0600::maxSurfaceCubemapLayered"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxSurfaceCubemapLayered) - 560usize];
    ["Offset of field: hipDeviceProp_tR0600::surfaceAlignment"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, surfaceAlignment) - 568usize];
    ["Offset of field: hipDeviceProp_tR0600::concurrentKernels"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, concurrentKernels) - 576usize];
    ["Offset of field: hipDeviceProp_tR0600::ECCEnabled"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, ECCEnabled) - 580usize];
    ["Offset of field: hipDeviceProp_tR0600::pciBusID"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, pciBusID) - 584usize];
    ["Offset of field: hipDeviceProp_tR0600::pciDeviceID"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, pciDeviceID) - 588usize];
    ["Offset of field: hipDeviceProp_tR0600::pciDomainID"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, pciDomainID) - 592usize];
    ["Offset of field: hipDeviceProp_tR0600::tccDriver"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, tccDriver) - 596usize];
    ["Offset of field: hipDeviceProp_tR0600::asyncEngineCount"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, asyncEngineCount) - 600usize];
    ["Offset of field: hipDeviceProp_tR0600::unifiedAddressing"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, unifiedAddressing) - 604usize];
    ["Offset of field: hipDeviceProp_tR0600::memoryClockRate"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, memoryClockRate) - 608usize];
    ["Offset of field: hipDeviceProp_tR0600::memoryBusWidth"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, memoryBusWidth) - 612usize];
    ["Offset of field: hipDeviceProp_tR0600::l2CacheSize"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, l2CacheSize) - 616usize];
    ["Offset of field: hipDeviceProp_tR0600::persistingL2CacheMaxSize"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, persistingL2CacheMaxSize) - 620usize];
    ["Offset of field: hipDeviceProp_tR0600::maxThreadsPerMultiProcessor"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxThreadsPerMultiProcessor) - 624usize];
    ["Offset of field: hipDeviceProp_tR0600::streamPrioritiesSupported"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, streamPrioritiesSupported) - 628usize];
    ["Offset of field: hipDeviceProp_tR0600::globalL1CacheSupported"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, globalL1CacheSupported) - 632usize];
    ["Offset of field: hipDeviceProp_tR0600::localL1CacheSupported"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, localL1CacheSupported) - 636usize];
    ["Offset of field: hipDeviceProp_tR0600::sharedMemPerMultiprocessor"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, sharedMemPerMultiprocessor) - 640usize];
    ["Offset of field: hipDeviceProp_tR0600::regsPerMultiprocessor"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, regsPerMultiprocessor) - 648usize];
    ["Offset of field: hipDeviceProp_tR0600::managedMemory"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, managedMemory) - 652usize];
    ["Offset of field: hipDeviceProp_tR0600::isMultiGpuBoard"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, isMultiGpuBoard) - 656usize];
    ["Offset of field: hipDeviceProp_tR0600::multiGpuBoardGroupID"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, multiGpuBoardGroupID) - 660usize];
    ["Offset of field: hipDeviceProp_tR0600::hostNativeAtomicSupported"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, hostNativeAtomicSupported) - 664usize];
    ["Offset of field: hipDeviceProp_tR0600::singleToDoublePrecisionPerfRatio"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, singleToDoublePrecisionPerfRatio) - 668usize];
    ["Offset of field: hipDeviceProp_tR0600::pageableMemoryAccess"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, pageableMemoryAccess) - 672usize];
    ["Offset of field: hipDeviceProp_tR0600::concurrentManagedAccess"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, concurrentManagedAccess) - 676usize];
    ["Offset of field: hipDeviceProp_tR0600::computePreemptionSupported"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, computePreemptionSupported) - 680usize];
    ["Offset of field: hipDeviceProp_tR0600::canUseHostPointerForRegisteredMem"][::std::mem::offset_of!(
        hipDeviceProp_tR0600,
        canUseHostPointerForRegisteredMem
    ) - 684usize];
    ["Offset of field: hipDeviceProp_tR0600::cooperativeLaunch"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, cooperativeLaunch) - 688usize];
    ["Offset of field: hipDeviceProp_tR0600::cooperativeMultiDeviceLaunch"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, cooperativeMultiDeviceLaunch) - 692usize];
    ["Offset of field: hipDeviceProp_tR0600::sharedMemPerBlockOptin"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, sharedMemPerBlockOptin) - 696usize];
    ["Offset of field: hipDeviceProp_tR0600::pageableMemoryAccessUsesHostPageTables"][::std::mem::offset_of!(
        hipDeviceProp_tR0600,
        pageableMemoryAccessUsesHostPageTables
    ) - 704usize];
    ["Offset of field: hipDeviceProp_tR0600::directManagedMemAccessFromHost"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, directManagedMemAccessFromHost) - 708usize];
    ["Offset of field: hipDeviceProp_tR0600::maxBlocksPerMultiProcessor"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, maxBlocksPerMultiProcessor) - 712usize];
    ["Offset of field: hipDeviceProp_tR0600::accessPolicyMaxWindowSize"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, accessPolicyMaxWindowSize) - 716usize];
    ["Offset of field: hipDeviceProp_tR0600::reservedSharedMemPerBlock"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, reservedSharedMemPerBlock) - 720usize];
    ["Offset of field: hipDeviceProp_tR0600::hostRegisterSupported"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, hostRegisterSupported) - 728usize];
    ["Offset of field: hipDeviceProp_tR0600::sparseHipArraySupported"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, sparseHipArraySupported) - 732usize];
    ["Offset of field: hipDeviceProp_tR0600::hostRegisterReadOnlySupported"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, hostRegisterReadOnlySupported) - 736usize];
    ["Offset of field: hipDeviceProp_tR0600::timelineSemaphoreInteropSupported"][::std::mem::offset_of!(
        hipDeviceProp_tR0600,
        timelineSemaphoreInteropSupported
    ) - 740usize];
    ["Offset of field: hipDeviceProp_tR0600::memoryPoolsSupported"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, memoryPoolsSupported) - 744usize];
    ["Offset of field: hipDeviceProp_tR0600::gpuDirectRDMASupported"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, gpuDirectRDMASupported) - 748usize];
    ["Offset of field: hipDeviceProp_tR0600::gpuDirectRDMAFlushWritesOptions"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, gpuDirectRDMAFlushWritesOptions) - 752usize];
    ["Offset of field: hipDeviceProp_tR0600::gpuDirectRDMAWritesOrdering"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, gpuDirectRDMAWritesOrdering) - 756usize];
    ["Offset of field: hipDeviceProp_tR0600::memoryPoolSupportedHandleTypes"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, memoryPoolSupportedHandleTypes) - 760usize];
    ["Offset of field: hipDeviceProp_tR0600::deferredMappingHipArraySupported"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, deferredMappingHipArraySupported) - 764usize];
    ["Offset of field: hipDeviceProp_tR0600::ipcEventSupported"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, ipcEventSupported) - 768usize];
    ["Offset of field: hipDeviceProp_tR0600::clusterLaunch"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, clusterLaunch) - 772usize];
    ["Offset of field: hipDeviceProp_tR0600::unifiedFunctionPointers"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, unifiedFunctionPointers) - 776usize];
    ["Offset of field: hipDeviceProp_tR0600::reserved"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, reserved) - 780usize];
    ["Offset of field: hipDeviceProp_tR0600::hipReserved"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, hipReserved) - 1032usize];
    ["Offset of field: hipDeviceProp_tR0600::gcnArchName"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, gcnArchName) - 1160usize];
    ["Offset of field: hipDeviceProp_tR0600::maxSharedMemoryPerMultiProcessor"][::std::mem::offset_of!(
        hipDeviceProp_tR0600,
        maxSharedMemoryPerMultiProcessor
    ) - 1416usize];
    ["Offset of field: hipDeviceProp_tR0600::clockInstructionRate"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, clockInstructionRate) - 1424usize];
    ["Offset of field: hipDeviceProp_tR0600::arch"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, arch) - 1428usize];
    ["Offset of field: hipDeviceProp_tR0600::hdpMemFlushCntl"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, hdpMemFlushCntl) - 1432usize];
    ["Offset of field: hipDeviceProp_tR0600::hdpRegFlushCntl"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, hdpRegFlushCntl) - 1440usize];
    ["Offset of field: hipDeviceProp_tR0600::cooperativeMultiDeviceUnmatchedFunc"][::std::mem::offset_of!(
        hipDeviceProp_tR0600,
        cooperativeMultiDeviceUnmatchedFunc
    ) - 1448usize];
    ["Offset of field: hipDeviceProp_tR0600::cooperativeMultiDeviceUnmatchedGridDim"][::std::mem::offset_of!(
        hipDeviceProp_tR0600,
        cooperativeMultiDeviceUnmatchedGridDim
    )
        - 1452usize];
    ["Offset of field: hipDeviceProp_tR0600::cooperativeMultiDeviceUnmatchedBlockDim"][::std::mem::offset_of!(
        hipDeviceProp_tR0600,
        cooperativeMultiDeviceUnmatchedBlockDim
    )
        - 1456usize];
    ["Offset of field: hipDeviceProp_tR0600::cooperativeMultiDeviceUnmatchedSharedMem"][::std::mem::offset_of!(
        hipDeviceProp_tR0600,
        cooperativeMultiDeviceUnmatchedSharedMem
    )
        - 1460usize];
    ["Offset of field: hipDeviceProp_tR0600::isLargeBar"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, isLargeBar) - 1464usize];
    ["Offset of field: hipDeviceProp_tR0600::asicRevision"]
        [::std::mem::offset_of!(hipDeviceProp_tR0600, asicRevision) - 1468usize];
};
pub const hipMemoryType_hipMemoryTypeUnregistered: hipMemoryType = 0;
pub const hipMemoryType_hipMemoryTypeHost: hipMemoryType = 1;
pub const hipMemoryType_hipMemoryTypeDevice: hipMemoryType = 2;
pub const hipMemoryType_hipMemoryTypeManaged: hipMemoryType = 3;
pub const hipMemoryType_hipMemoryTypeArray: hipMemoryType = 10;
pub const hipMemoryType_hipMemoryTypeUnified: hipMemoryType = 11;
pub type hipMemoryType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipPointerAttribute_t {
    pub type_: hipMemoryType,
    pub device: ::std::os::raw::c_int,
    pub devicePointer: *mut ::std::os::raw::c_void,
    pub hostPointer: *mut ::std::os::raw::c_void,
    pub isManaged: ::std::os::raw::c_int,
    pub allocationFlags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipPointerAttribute_t"][::std::mem::size_of::<hipPointerAttribute_t>() - 32usize];
    ["Alignment of hipPointerAttribute_t"]
        [::std::mem::align_of::<hipPointerAttribute_t>() - 8usize];
    ["Offset of field: hipPointerAttribute_t::type_"]
        [::std::mem::offset_of!(hipPointerAttribute_t, type_) - 0usize];
    ["Offset of field: hipPointerAttribute_t::device"]
        [::std::mem::offset_of!(hipPointerAttribute_t, device) - 4usize];
    ["Offset of field: hipPointerAttribute_t::devicePointer"]
        [::std::mem::offset_of!(hipPointerAttribute_t, devicePointer) - 8usize];
    ["Offset of field: hipPointerAttribute_t::hostPointer"]
        [::std::mem::offset_of!(hipPointerAttribute_t, hostPointer) - 16usize];
    ["Offset of field: hipPointerAttribute_t::isManaged"]
        [::std::mem::offset_of!(hipPointerAttribute_t, isManaged) - 24usize];
    ["Offset of field: hipPointerAttribute_t::allocationFlags"]
        [::std::mem::offset_of!(hipPointerAttribute_t, allocationFlags) - 28usize];
};
pub const hipError_t_hipSuccess: hipError_t = 0;
pub const hipError_t_hipErrorInvalidValue: hipError_t = 1;
pub const hipError_t_hipErrorOutOfMemory: hipError_t = 2;
pub const hipError_t_hipErrorMemoryAllocation: hipError_t = 2;
pub const hipError_t_hipErrorNotInitialized: hipError_t = 3;
pub const hipError_t_hipErrorInitializationError: hipError_t = 3;
pub const hipError_t_hipErrorDeinitialized: hipError_t = 4;
pub const hipError_t_hipErrorProfilerDisabled: hipError_t = 5;
pub const hipError_t_hipErrorProfilerNotInitialized: hipError_t = 6;
pub const hipError_t_hipErrorProfilerAlreadyStarted: hipError_t = 7;
pub const hipError_t_hipErrorProfilerAlreadyStopped: hipError_t = 8;
pub const hipError_t_hipErrorInvalidConfiguration: hipError_t = 9;
pub const hipError_t_hipErrorInvalidPitchValue: hipError_t = 12;
pub const hipError_t_hipErrorInvalidSymbol: hipError_t = 13;
pub const hipError_t_hipErrorInvalidDevicePointer: hipError_t = 17;
pub const hipError_t_hipErrorInvalidMemcpyDirection: hipError_t = 21;
pub const hipError_t_hipErrorInsufficientDriver: hipError_t = 35;
pub const hipError_t_hipErrorMissingConfiguration: hipError_t = 52;
pub const hipError_t_hipErrorPriorLaunchFailure: hipError_t = 53;
pub const hipError_t_hipErrorInvalidDeviceFunction: hipError_t = 98;
pub const hipError_t_hipErrorNoDevice: hipError_t = 100;
pub const hipError_t_hipErrorInvalidDevice: hipError_t = 101;
pub const hipError_t_hipErrorInvalidImage: hipError_t = 200;
pub const hipError_t_hipErrorInvalidContext: hipError_t = 201;
pub const hipError_t_hipErrorContextAlreadyCurrent: hipError_t = 202;
pub const hipError_t_hipErrorMapFailed: hipError_t = 205;
pub const hipError_t_hipErrorMapBufferObjectFailed: hipError_t = 205;
pub const hipError_t_hipErrorUnmapFailed: hipError_t = 206;
pub const hipError_t_hipErrorArrayIsMapped: hipError_t = 207;
pub const hipError_t_hipErrorAlreadyMapped: hipError_t = 208;
pub const hipError_t_hipErrorNoBinaryForGpu: hipError_t = 209;
pub const hipError_t_hipErrorAlreadyAcquired: hipError_t = 210;
pub const hipError_t_hipErrorNotMapped: hipError_t = 211;
pub const hipError_t_hipErrorNotMappedAsArray: hipError_t = 212;
pub const hipError_t_hipErrorNotMappedAsPointer: hipError_t = 213;
pub const hipError_t_hipErrorECCNotCorrectable: hipError_t = 214;
pub const hipError_t_hipErrorUnsupportedLimit: hipError_t = 215;
pub const hipError_t_hipErrorContextAlreadyInUse: hipError_t = 216;
pub const hipError_t_hipErrorPeerAccessUnsupported: hipError_t = 217;
pub const hipError_t_hipErrorInvalidKernelFile: hipError_t = 218;
pub const hipError_t_hipErrorInvalidGraphicsContext: hipError_t = 219;
pub const hipError_t_hipErrorInvalidSource: hipError_t = 300;
pub const hipError_t_hipErrorFileNotFound: hipError_t = 301;
pub const hipError_t_hipErrorSharedObjectSymbolNotFound: hipError_t = 302;
pub const hipError_t_hipErrorSharedObjectInitFailed: hipError_t = 303;
pub const hipError_t_hipErrorOperatingSystem: hipError_t = 304;
pub const hipError_t_hipErrorInvalidHandle: hipError_t = 400;
pub const hipError_t_hipErrorInvalidResourceHandle: hipError_t = 400;
pub const hipError_t_hipErrorIllegalState: hipError_t = 401;
pub const hipError_t_hipErrorNotFound: hipError_t = 500;
pub const hipError_t_hipErrorNotReady: hipError_t = 600;
pub const hipError_t_hipErrorIllegalAddress: hipError_t = 700;
pub const hipError_t_hipErrorLaunchOutOfResources: hipError_t = 701;
pub const hipError_t_hipErrorLaunchTimeOut: hipError_t = 702;
pub const hipError_t_hipErrorPeerAccessAlreadyEnabled: hipError_t = 704;
pub const hipError_t_hipErrorPeerAccessNotEnabled: hipError_t = 705;
pub const hipError_t_hipErrorSetOnActiveProcess: hipError_t = 708;
pub const hipError_t_hipErrorContextIsDestroyed: hipError_t = 709;
pub const hipError_t_hipErrorAssert: hipError_t = 710;
pub const hipError_t_hipErrorHostMemoryAlreadyRegistered: hipError_t = 712;
pub const hipError_t_hipErrorHostMemoryNotRegistered: hipError_t = 713;
pub const hipError_t_hipErrorLaunchFailure: hipError_t = 719;
pub const hipError_t_hipErrorCooperativeLaunchTooLarge: hipError_t = 720;
pub const hipError_t_hipErrorNotSupported: hipError_t = 801;
pub const hipError_t_hipErrorStreamCaptureUnsupported: hipError_t = 900;
pub const hipError_t_hipErrorStreamCaptureInvalidated: hipError_t = 901;
pub const hipError_t_hipErrorStreamCaptureMerge: hipError_t = 902;
pub const hipError_t_hipErrorStreamCaptureUnmatched: hipError_t = 903;
pub const hipError_t_hipErrorStreamCaptureUnjoined: hipError_t = 904;
pub const hipError_t_hipErrorStreamCaptureIsolation: hipError_t = 905;
pub const hipError_t_hipErrorStreamCaptureImplicit: hipError_t = 906;
pub const hipError_t_hipErrorCapturedEvent: hipError_t = 907;
pub const hipError_t_hipErrorStreamCaptureWrongThread: hipError_t = 908;
pub const hipError_t_hipErrorGraphExecUpdateFailure: hipError_t = 910;
pub const hipError_t_hipErrorInvalidChannelDescriptor: hipError_t = 911;
pub const hipError_t_hipErrorInvalidTexture: hipError_t = 912;
pub const hipError_t_hipErrorUnknown: hipError_t = 999;
pub const hipError_t_hipErrorRuntimeMemory: hipError_t = 1052;
pub const hipError_t_hipErrorRuntimeOther: hipError_t = 1053;
pub const hipError_t_hipErrorTbd: hipError_t = 1054;
pub type hipError_t = ::std::os::raw::c_uint;
pub const hipDeviceAttribute_t_hipDeviceAttributeCudaCompatibleBegin: hipDeviceAttribute_t = 0;
pub const hipDeviceAttribute_t_hipDeviceAttributeEccEnabled: hipDeviceAttribute_t = 0;
pub const hipDeviceAttribute_t_hipDeviceAttributeAccessPolicyMaxWindowSize: hipDeviceAttribute_t =
    1;
pub const hipDeviceAttribute_t_hipDeviceAttributeAsyncEngineCount: hipDeviceAttribute_t = 2;
pub const hipDeviceAttribute_t_hipDeviceAttributeCanMapHostMemory: hipDeviceAttribute_t = 3;
pub const hipDeviceAttribute_t_hipDeviceAttributeCanUseHostPointerForRegisteredMem:
    hipDeviceAttribute_t = 4;
pub const hipDeviceAttribute_t_hipDeviceAttributeClockRate: hipDeviceAttribute_t = 5;
pub const hipDeviceAttribute_t_hipDeviceAttributeComputeMode: hipDeviceAttribute_t = 6;
pub const hipDeviceAttribute_t_hipDeviceAttributeComputePreemptionSupported: hipDeviceAttribute_t =
    7;
pub const hipDeviceAttribute_t_hipDeviceAttributeConcurrentKernels: hipDeviceAttribute_t = 8;
pub const hipDeviceAttribute_t_hipDeviceAttributeConcurrentManagedAccess: hipDeviceAttribute_t = 9;
pub const hipDeviceAttribute_t_hipDeviceAttributeCooperativeLaunch: hipDeviceAttribute_t = 10;
pub const hipDeviceAttribute_t_hipDeviceAttributeCooperativeMultiDeviceLaunch:
    hipDeviceAttribute_t = 11;
pub const hipDeviceAttribute_t_hipDeviceAttributeDeviceOverlap: hipDeviceAttribute_t = 12;
pub const hipDeviceAttribute_t_hipDeviceAttributeDirectManagedMemAccessFromHost:
    hipDeviceAttribute_t = 13;
pub const hipDeviceAttribute_t_hipDeviceAttributeGlobalL1CacheSupported: hipDeviceAttribute_t = 14;
pub const hipDeviceAttribute_t_hipDeviceAttributeHostNativeAtomicSupported: hipDeviceAttribute_t =
    15;
pub const hipDeviceAttribute_t_hipDeviceAttributeIntegrated: hipDeviceAttribute_t = 16;
pub const hipDeviceAttribute_t_hipDeviceAttributeIsMultiGpuBoard: hipDeviceAttribute_t = 17;
pub const hipDeviceAttribute_t_hipDeviceAttributeKernelExecTimeout: hipDeviceAttribute_t = 18;
pub const hipDeviceAttribute_t_hipDeviceAttributeL2CacheSize: hipDeviceAttribute_t = 19;
pub const hipDeviceAttribute_t_hipDeviceAttributeLocalL1CacheSupported: hipDeviceAttribute_t = 20;
pub const hipDeviceAttribute_t_hipDeviceAttributeLuid: hipDeviceAttribute_t = 21;
pub const hipDeviceAttribute_t_hipDeviceAttributeLuidDeviceNodeMask: hipDeviceAttribute_t = 22;
pub const hipDeviceAttribute_t_hipDeviceAttributeComputeCapabilityMajor: hipDeviceAttribute_t = 23;
pub const hipDeviceAttribute_t_hipDeviceAttributeManagedMemory: hipDeviceAttribute_t = 24;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxBlocksPerMultiProcessor: hipDeviceAttribute_t =
    25;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxBlockDimX: hipDeviceAttribute_t = 26;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxBlockDimY: hipDeviceAttribute_t = 27;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxBlockDimZ: hipDeviceAttribute_t = 28;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxGridDimX: hipDeviceAttribute_t = 29;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxGridDimY: hipDeviceAttribute_t = 30;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxGridDimZ: hipDeviceAttribute_t = 31;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxSurface1D: hipDeviceAttribute_t = 32;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxSurface1DLayered: hipDeviceAttribute_t = 33;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxSurface2D: hipDeviceAttribute_t = 34;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxSurface2DLayered: hipDeviceAttribute_t = 35;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxSurface3D: hipDeviceAttribute_t = 36;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxSurfaceCubemap: hipDeviceAttribute_t = 37;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxSurfaceCubemapLayered: hipDeviceAttribute_t =
    38;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture1DWidth: hipDeviceAttribute_t = 39;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture1DLayered: hipDeviceAttribute_t = 40;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture1DLinear: hipDeviceAttribute_t = 41;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture1DMipmap: hipDeviceAttribute_t = 42;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture2DWidth: hipDeviceAttribute_t = 43;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture2DHeight: hipDeviceAttribute_t = 44;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture2DGather: hipDeviceAttribute_t = 45;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture2DLayered: hipDeviceAttribute_t = 46;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture2DLinear: hipDeviceAttribute_t = 47;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture2DMipmap: hipDeviceAttribute_t = 48;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture3DWidth: hipDeviceAttribute_t = 49;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture3DHeight: hipDeviceAttribute_t = 50;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture3DDepth: hipDeviceAttribute_t = 51;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTexture3DAlt: hipDeviceAttribute_t = 52;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTextureCubemap: hipDeviceAttribute_t = 53;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxTextureCubemapLayered: hipDeviceAttribute_t =
    54;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxThreadsDim: hipDeviceAttribute_t = 55;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxThreadsPerBlock: hipDeviceAttribute_t = 56;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxThreadsPerMultiProcessor: hipDeviceAttribute_t =
    57;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxPitch: hipDeviceAttribute_t = 58;
pub const hipDeviceAttribute_t_hipDeviceAttributeMemoryBusWidth: hipDeviceAttribute_t = 59;
pub const hipDeviceAttribute_t_hipDeviceAttributeMemoryClockRate: hipDeviceAttribute_t = 60;
pub const hipDeviceAttribute_t_hipDeviceAttributeComputeCapabilityMinor: hipDeviceAttribute_t = 61;
pub const hipDeviceAttribute_t_hipDeviceAttributeMultiGpuBoardGroupID: hipDeviceAttribute_t = 62;
pub const hipDeviceAttribute_t_hipDeviceAttributeMultiprocessorCount: hipDeviceAttribute_t = 63;
pub const hipDeviceAttribute_t_hipDeviceAttributeUnused1: hipDeviceAttribute_t = 64;
pub const hipDeviceAttribute_t_hipDeviceAttributePageableMemoryAccess: hipDeviceAttribute_t = 65;
pub const hipDeviceAttribute_t_hipDeviceAttributePageableMemoryAccessUsesHostPageTables:
    hipDeviceAttribute_t = 66;
pub const hipDeviceAttribute_t_hipDeviceAttributePciBusId: hipDeviceAttribute_t = 67;
pub const hipDeviceAttribute_t_hipDeviceAttributePciDeviceId: hipDeviceAttribute_t = 68;
pub const hipDeviceAttribute_t_hipDeviceAttributePciDomainId: hipDeviceAttribute_t = 69;
pub const hipDeviceAttribute_t_hipDeviceAttributePciDomainID: hipDeviceAttribute_t = 69;
pub const hipDeviceAttribute_t_hipDeviceAttributePersistingL2CacheMaxSize: hipDeviceAttribute_t =
    70;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxRegistersPerBlock: hipDeviceAttribute_t = 71;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxRegistersPerMultiprocessor:
    hipDeviceAttribute_t = 72;
pub const hipDeviceAttribute_t_hipDeviceAttributeReservedSharedMemPerBlock: hipDeviceAttribute_t =
    73;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxSharedMemoryPerBlock: hipDeviceAttribute_t = 74;
pub const hipDeviceAttribute_t_hipDeviceAttributeSharedMemPerBlockOptin: hipDeviceAttribute_t = 75;
pub const hipDeviceAttribute_t_hipDeviceAttributeSharedMemPerMultiprocessor: hipDeviceAttribute_t =
    76;
pub const hipDeviceAttribute_t_hipDeviceAttributeSingleToDoublePrecisionPerfRatio:
    hipDeviceAttribute_t = 77;
pub const hipDeviceAttribute_t_hipDeviceAttributeStreamPrioritiesSupported: hipDeviceAttribute_t =
    78;
pub const hipDeviceAttribute_t_hipDeviceAttributeSurfaceAlignment: hipDeviceAttribute_t = 79;
pub const hipDeviceAttribute_t_hipDeviceAttributeTccDriver: hipDeviceAttribute_t = 80;
pub const hipDeviceAttribute_t_hipDeviceAttributeTextureAlignment: hipDeviceAttribute_t = 81;
pub const hipDeviceAttribute_t_hipDeviceAttributeTexturePitchAlignment: hipDeviceAttribute_t = 82;
pub const hipDeviceAttribute_t_hipDeviceAttributeTotalConstantMemory: hipDeviceAttribute_t = 83;
pub const hipDeviceAttribute_t_hipDeviceAttributeTotalGlobalMem: hipDeviceAttribute_t = 84;
pub const hipDeviceAttribute_t_hipDeviceAttributeUnifiedAddressing: hipDeviceAttribute_t = 85;
pub const hipDeviceAttribute_t_hipDeviceAttributeUnused2: hipDeviceAttribute_t = 86;
pub const hipDeviceAttribute_t_hipDeviceAttributeWarpSize: hipDeviceAttribute_t = 87;
pub const hipDeviceAttribute_t_hipDeviceAttributeMemoryPoolsSupported: hipDeviceAttribute_t = 88;
pub const hipDeviceAttribute_t_hipDeviceAttributeVirtualMemoryManagementSupported:
    hipDeviceAttribute_t = 89;
pub const hipDeviceAttribute_t_hipDeviceAttributeHostRegisterSupported: hipDeviceAttribute_t = 90;
pub const hipDeviceAttribute_t_hipDeviceAttributeMemoryPoolSupportedHandleTypes:
    hipDeviceAttribute_t = 91;
pub const hipDeviceAttribute_t_hipDeviceAttributeCudaCompatibleEnd: hipDeviceAttribute_t = 9999;
pub const hipDeviceAttribute_t_hipDeviceAttributeAmdSpecificBegin: hipDeviceAttribute_t = 10000;
pub const hipDeviceAttribute_t_hipDeviceAttributeClockInstructionRate: hipDeviceAttribute_t = 10000;
pub const hipDeviceAttribute_t_hipDeviceAttributeUnused3: hipDeviceAttribute_t = 10001;
pub const hipDeviceAttribute_t_hipDeviceAttributeMaxSharedMemoryPerMultiprocessor:
    hipDeviceAttribute_t = 10002;
pub const hipDeviceAttribute_t_hipDeviceAttributeUnused4: hipDeviceAttribute_t = 10003;
pub const hipDeviceAttribute_t_hipDeviceAttributeUnused5: hipDeviceAttribute_t = 10004;
pub const hipDeviceAttribute_t_hipDeviceAttributeHdpMemFlushCntl: hipDeviceAttribute_t = 10005;
pub const hipDeviceAttribute_t_hipDeviceAttributeHdpRegFlushCntl: hipDeviceAttribute_t = 10006;
pub const hipDeviceAttribute_t_hipDeviceAttributeCooperativeMultiDeviceUnmatchedFunc:
    hipDeviceAttribute_t = 10007;
pub const hipDeviceAttribute_t_hipDeviceAttributeCooperativeMultiDeviceUnmatchedGridDim:
    hipDeviceAttribute_t = 10008;
pub const hipDeviceAttribute_t_hipDeviceAttributeCooperativeMultiDeviceUnmatchedBlockDim:
    hipDeviceAttribute_t = 10009;
pub const hipDeviceAttribute_t_hipDeviceAttributeCooperativeMultiDeviceUnmatchedSharedMem:
    hipDeviceAttribute_t = 10010;
pub const hipDeviceAttribute_t_hipDeviceAttributeIsLargeBar: hipDeviceAttribute_t = 10011;
pub const hipDeviceAttribute_t_hipDeviceAttributeAsicRevision: hipDeviceAttribute_t = 10012;
pub const hipDeviceAttribute_t_hipDeviceAttributeCanUseStreamWaitValue: hipDeviceAttribute_t =
    10013;
pub const hipDeviceAttribute_t_hipDeviceAttributeImageSupport: hipDeviceAttribute_t = 10014;
pub const hipDeviceAttribute_t_hipDeviceAttributePhysicalMultiProcessorCount: hipDeviceAttribute_t =
    10015;
pub const hipDeviceAttribute_t_hipDeviceAttributeFineGrainSupport: hipDeviceAttribute_t = 10016;
pub const hipDeviceAttribute_t_hipDeviceAttributeWallClockRate: hipDeviceAttribute_t = 10017;
pub const hipDeviceAttribute_t_hipDeviceAttributeNumberOfXccs: hipDeviceAttribute_t = 10018;
pub const hipDeviceAttribute_t_hipDeviceAttributePciChipId: hipDeviceAttribute_t = 10019;
pub const hipDeviceAttribute_t_hipDeviceAttributeAmdSpecificEnd: hipDeviceAttribute_t = 19999;
pub const hipDeviceAttribute_t_hipDeviceAttributeVendorSpecificBegin: hipDeviceAttribute_t = 20000;
pub type hipDeviceAttribute_t = ::std::os::raw::c_uint;
pub const hipDriverProcAddressQueryResult_HIP_GET_PROC_ADDRESS_SUCCESS:
    hipDriverProcAddressQueryResult = 0;
pub const hipDriverProcAddressQueryResult_HIP_GET_PROC_ADDRESS_SYMBOL_NOT_FOUND:
    hipDriverProcAddressQueryResult = 1;
pub const hipDriverProcAddressQueryResult_HIP_GET_PROC_ADDRESS_VERSION_NOT_SUFFICIENT:
    hipDriverProcAddressQueryResult = 2;
pub type hipDriverProcAddressQueryResult = ::std::os::raw::c_uint;
pub type hipDeviceptr_t = *mut ::std::os::raw::c_void;
pub const hipChannelFormatKind_hipChannelFormatKindSigned: hipChannelFormatKind = 0;
pub const hipChannelFormatKind_hipChannelFormatKindUnsigned: hipChannelFormatKind = 1;
pub const hipChannelFormatKind_hipChannelFormatKindFloat: hipChannelFormatKind = 2;
pub const hipChannelFormatKind_hipChannelFormatKindNone: hipChannelFormatKind = 3;
pub type hipChannelFormatKind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipChannelFormatDesc {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub z: ::std::os::raw::c_int,
    pub w: ::std::os::raw::c_int,
    pub f: hipChannelFormatKind,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipChannelFormatDesc"][::std::mem::size_of::<hipChannelFormatDesc>() - 20usize];
    ["Alignment of hipChannelFormatDesc"][::std::mem::align_of::<hipChannelFormatDesc>() - 4usize];
    ["Offset of field: hipChannelFormatDesc::x"]
        [::std::mem::offset_of!(hipChannelFormatDesc, x) - 0usize];
    ["Offset of field: hipChannelFormatDesc::y"]
        [::std::mem::offset_of!(hipChannelFormatDesc, y) - 4usize];
    ["Offset of field: hipChannelFormatDesc::z"]
        [::std::mem::offset_of!(hipChannelFormatDesc, z) - 8usize];
    ["Offset of field: hipChannelFormatDesc::w"]
        [::std::mem::offset_of!(hipChannelFormatDesc, w) - 12usize];
    ["Offset of field: hipChannelFormatDesc::f"]
        [::std::mem::offset_of!(hipChannelFormatDesc, f) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipArray {
    _unused: [u8; 0],
}
pub type hipArray_t = *mut hipArray;
pub type hipArray_const_t = *const hipArray;
pub const hipArray_Format_HIP_AD_FORMAT_UNSIGNED_INT8: hipArray_Format = 1;
pub const hipArray_Format_HIP_AD_FORMAT_UNSIGNED_INT16: hipArray_Format = 2;
pub const hipArray_Format_HIP_AD_FORMAT_UNSIGNED_INT32: hipArray_Format = 3;
pub const hipArray_Format_HIP_AD_FORMAT_SIGNED_INT8: hipArray_Format = 8;
pub const hipArray_Format_HIP_AD_FORMAT_SIGNED_INT16: hipArray_Format = 9;
pub const hipArray_Format_HIP_AD_FORMAT_SIGNED_INT32: hipArray_Format = 10;
pub const hipArray_Format_HIP_AD_FORMAT_HALF: hipArray_Format = 16;
pub const hipArray_Format_HIP_AD_FORMAT_FLOAT: hipArray_Format = 32;
pub type hipArray_Format = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HIP_ARRAY_DESCRIPTOR {
    pub Width: usize,
    pub Height: usize,
    pub Format: hipArray_Format,
    pub NumChannels: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HIP_ARRAY_DESCRIPTOR"][::std::mem::size_of::<HIP_ARRAY_DESCRIPTOR>() - 24usize];
    ["Alignment of HIP_ARRAY_DESCRIPTOR"][::std::mem::align_of::<HIP_ARRAY_DESCRIPTOR>() - 8usize];
    ["Offset of field: HIP_ARRAY_DESCRIPTOR::Width"]
        [::std::mem::offset_of!(HIP_ARRAY_DESCRIPTOR, Width) - 0usize];
    ["Offset of field: HIP_ARRAY_DESCRIPTOR::Height"]
        [::std::mem::offset_of!(HIP_ARRAY_DESCRIPTOR, Height) - 8usize];
    ["Offset of field: HIP_ARRAY_DESCRIPTOR::Format"]
        [::std::mem::offset_of!(HIP_ARRAY_DESCRIPTOR, Format) - 16usize];
    ["Offset of field: HIP_ARRAY_DESCRIPTOR::NumChannels"]
        [::std::mem::offset_of!(HIP_ARRAY_DESCRIPTOR, NumChannels) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HIP_ARRAY3D_DESCRIPTOR {
    pub Width: usize,
    pub Height: usize,
    pub Depth: usize,
    pub Format: hipArray_Format,
    pub NumChannels: ::std::os::raw::c_uint,
    pub Flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HIP_ARRAY3D_DESCRIPTOR"][::std::mem::size_of::<HIP_ARRAY3D_DESCRIPTOR>() - 40usize];
    ["Alignment of HIP_ARRAY3D_DESCRIPTOR"]
        [::std::mem::align_of::<HIP_ARRAY3D_DESCRIPTOR>() - 8usize];
    ["Offset of field: HIP_ARRAY3D_DESCRIPTOR::Width"]
        [::std::mem::offset_of!(HIP_ARRAY3D_DESCRIPTOR, Width) - 0usize];
    ["Offset of field: HIP_ARRAY3D_DESCRIPTOR::Height"]
        [::std::mem::offset_of!(HIP_ARRAY3D_DESCRIPTOR, Height) - 8usize];
    ["Offset of field: HIP_ARRAY3D_DESCRIPTOR::Depth"]
        [::std::mem::offset_of!(HIP_ARRAY3D_DESCRIPTOR, Depth) - 16usize];
    ["Offset of field: HIP_ARRAY3D_DESCRIPTOR::Format"]
        [::std::mem::offset_of!(HIP_ARRAY3D_DESCRIPTOR, Format) - 24usize];
    ["Offset of field: HIP_ARRAY3D_DESCRIPTOR::NumChannels"]
        [::std::mem::offset_of!(HIP_ARRAY3D_DESCRIPTOR, NumChannels) - 28usize];
    ["Offset of field: HIP_ARRAY3D_DESCRIPTOR::Flags"]
        [::std::mem::offset_of!(HIP_ARRAY3D_DESCRIPTOR, Flags) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hip_Memcpy2D {
    pub srcXInBytes: usize,
    pub srcY: usize,
    pub srcMemoryType: hipMemoryType,
    pub srcHost: *const ::std::os::raw::c_void,
    pub srcDevice: hipDeviceptr_t,
    pub srcArray: hipArray_t,
    pub srcPitch: usize,
    pub dstXInBytes: usize,
    pub dstY: usize,
    pub dstMemoryType: hipMemoryType,
    pub dstHost: *mut ::std::os::raw::c_void,
    pub dstDevice: hipDeviceptr_t,
    pub dstArray: hipArray_t,
    pub dstPitch: usize,
    pub WidthInBytes: usize,
    pub Height: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hip_Memcpy2D"][::std::mem::size_of::<hip_Memcpy2D>() - 128usize];
    ["Alignment of hip_Memcpy2D"][::std::mem::align_of::<hip_Memcpy2D>() - 8usize];
    ["Offset of field: hip_Memcpy2D::srcXInBytes"]
        [::std::mem::offset_of!(hip_Memcpy2D, srcXInBytes) - 0usize];
    ["Offset of field: hip_Memcpy2D::srcY"][::std::mem::offset_of!(hip_Memcpy2D, srcY) - 8usize];
    ["Offset of field: hip_Memcpy2D::srcMemoryType"]
        [::std::mem::offset_of!(hip_Memcpy2D, srcMemoryType) - 16usize];
    ["Offset of field: hip_Memcpy2D::srcHost"]
        [::std::mem::offset_of!(hip_Memcpy2D, srcHost) - 24usize];
    ["Offset of field: hip_Memcpy2D::srcDevice"]
        [::std::mem::offset_of!(hip_Memcpy2D, srcDevice) - 32usize];
    ["Offset of field: hip_Memcpy2D::srcArray"]
        [::std::mem::offset_of!(hip_Memcpy2D, srcArray) - 40usize];
    ["Offset of field: hip_Memcpy2D::srcPitch"]
        [::std::mem::offset_of!(hip_Memcpy2D, srcPitch) - 48usize];
    ["Offset of field: hip_Memcpy2D::dstXInBytes"]
        [::std::mem::offset_of!(hip_Memcpy2D, dstXInBytes) - 56usize];
    ["Offset of field: hip_Memcpy2D::dstY"][::std::mem::offset_of!(hip_Memcpy2D, dstY) - 64usize];
    ["Offset of field: hip_Memcpy2D::dstMemoryType"]
        [::std::mem::offset_of!(hip_Memcpy2D, dstMemoryType) - 72usize];
    ["Offset of field: hip_Memcpy2D::dstHost"]
        [::std::mem::offset_of!(hip_Memcpy2D, dstHost) - 80usize];
    ["Offset of field: hip_Memcpy2D::dstDevice"]
        [::std::mem::offset_of!(hip_Memcpy2D, dstDevice) - 88usize];
    ["Offset of field: hip_Memcpy2D::dstArray"]
        [::std::mem::offset_of!(hip_Memcpy2D, dstArray) - 96usize];
    ["Offset of field: hip_Memcpy2D::dstPitch"]
        [::std::mem::offset_of!(hip_Memcpy2D, dstPitch) - 104usize];
    ["Offset of field: hip_Memcpy2D::WidthInBytes"]
        [::std::mem::offset_of!(hip_Memcpy2D, WidthInBytes) - 112usize];
    ["Offset of field: hip_Memcpy2D::Height"]
        [::std::mem::offset_of!(hip_Memcpy2D, Height) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipMipmappedArray {
    pub data: *mut ::std::os::raw::c_void,
    pub desc: hipChannelFormatDesc,
    pub type_: ::std::os::raw::c_uint,
    pub width: ::std::os::raw::c_uint,
    pub height: ::std::os::raw::c_uint,
    pub depth: ::std::os::raw::c_uint,
    pub min_mipmap_level: ::std::os::raw::c_uint,
    pub max_mipmap_level: ::std::os::raw::c_uint,
    pub flags: ::std::os::raw::c_uint,
    pub format: hipArray_Format,
    pub num_channels: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipMipmappedArray"][::std::mem::size_of::<hipMipmappedArray>() - 64usize];
    ["Alignment of hipMipmappedArray"][::std::mem::align_of::<hipMipmappedArray>() - 8usize];
    ["Offset of field: hipMipmappedArray::data"]
        [::std::mem::offset_of!(hipMipmappedArray, data) - 0usize];
    ["Offset of field: hipMipmappedArray::desc"]
        [::std::mem::offset_of!(hipMipmappedArray, desc) - 8usize];
    ["Offset of field: hipMipmappedArray::type_"]
        [::std::mem::offset_of!(hipMipmappedArray, type_) - 28usize];
    ["Offset of field: hipMipmappedArray::width"]
        [::std::mem::offset_of!(hipMipmappedArray, width) - 32usize];
    ["Offset of field: hipMipmappedArray::height"]
        [::std::mem::offset_of!(hipMipmappedArray, height) - 36usize];
    ["Offset of field: hipMipmappedArray::depth"]
        [::std::mem::offset_of!(hipMipmappedArray, depth) - 40usize];
    ["Offset of field: hipMipmappedArray::min_mipmap_level"]
        [::std::mem::offset_of!(hipMipmappedArray, min_mipmap_level) - 44usize];
    ["Offset of field: hipMipmappedArray::max_mipmap_level"]
        [::std::mem::offset_of!(hipMipmappedArray, max_mipmap_level) - 48usize];
    ["Offset of field: hipMipmappedArray::flags"]
        [::std::mem::offset_of!(hipMipmappedArray, flags) - 52usize];
    ["Offset of field: hipMipmappedArray::format"]
        [::std::mem::offset_of!(hipMipmappedArray, format) - 56usize];
    ["Offset of field: hipMipmappedArray::num_channels"]
        [::std::mem::offset_of!(hipMipmappedArray, num_channels) - 60usize];
};
pub type hipMipmappedArray_t = *mut hipMipmappedArray;
pub type hipMipmappedArray_const_t = *const hipMipmappedArray;
pub const hipResourceType_hipResourceTypeArray: hipResourceType = 0;
pub const hipResourceType_hipResourceTypeMipmappedArray: hipResourceType = 1;
pub const hipResourceType_hipResourceTypeLinear: hipResourceType = 2;
pub const hipResourceType_hipResourceTypePitch2D: hipResourceType = 3;
pub type hipResourceType = ::std::os::raw::c_uint;
pub const HIPresourcetype_enum_HIP_RESOURCE_TYPE_ARRAY: HIPresourcetype_enum = 0;
pub const HIPresourcetype_enum_HIP_RESOURCE_TYPE_MIPMAPPED_ARRAY: HIPresourcetype_enum = 1;
pub const HIPresourcetype_enum_HIP_RESOURCE_TYPE_LINEAR: HIPresourcetype_enum = 2;
pub const HIPresourcetype_enum_HIP_RESOURCE_TYPE_PITCH2D: HIPresourcetype_enum = 3;
pub type HIPresourcetype_enum = ::std::os::raw::c_uint;
pub use self::HIPresourcetype_enum as HIPresourcetype;
pub const HIPaddress_mode_enum_HIP_TR_ADDRESS_MODE_WRAP: HIPaddress_mode_enum = 0;
pub const HIPaddress_mode_enum_HIP_TR_ADDRESS_MODE_CLAMP: HIPaddress_mode_enum = 1;
pub const HIPaddress_mode_enum_HIP_TR_ADDRESS_MODE_MIRROR: HIPaddress_mode_enum = 2;
pub const HIPaddress_mode_enum_HIP_TR_ADDRESS_MODE_BORDER: HIPaddress_mode_enum = 3;
pub type HIPaddress_mode_enum = ::std::os::raw::c_uint;
pub use self::HIPaddress_mode_enum as HIPaddress_mode;
pub const HIPfilter_mode_enum_HIP_TR_FILTER_MODE_POINT: HIPfilter_mode_enum = 0;
pub const HIPfilter_mode_enum_HIP_TR_FILTER_MODE_LINEAR: HIPfilter_mode_enum = 1;
pub type HIPfilter_mode_enum = ::std::os::raw::c_uint;
pub use self::HIPfilter_mode_enum as HIPfilter_mode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HIP_TEXTURE_DESC_st {
    pub addressMode: [HIPaddress_mode; 3usize],
    pub filterMode: HIPfilter_mode,
    pub flags: ::std::os::raw::c_uint,
    pub maxAnisotropy: ::std::os::raw::c_uint,
    pub mipmapFilterMode: HIPfilter_mode,
    pub mipmapLevelBias: f32,
    pub minMipmapLevelClamp: f32,
    pub maxMipmapLevelClamp: f32,
    pub borderColor: [f32; 4usize],
    pub reserved: [::std::os::raw::c_int; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HIP_TEXTURE_DESC_st"][::std::mem::size_of::<HIP_TEXTURE_DESC_st>() - 104usize];
    ["Alignment of HIP_TEXTURE_DESC_st"][::std::mem::align_of::<HIP_TEXTURE_DESC_st>() - 4usize];
    ["Offset of field: HIP_TEXTURE_DESC_st::addressMode"]
        [::std::mem::offset_of!(HIP_TEXTURE_DESC_st, addressMode) - 0usize];
    ["Offset of field: HIP_TEXTURE_DESC_st::filterMode"]
        [::std::mem::offset_of!(HIP_TEXTURE_DESC_st, filterMode) - 12usize];
    ["Offset of field: HIP_TEXTURE_DESC_st::flags"]
        [::std::mem::offset_of!(HIP_TEXTURE_DESC_st, flags) - 16usize];
    ["Offset of field: HIP_TEXTURE_DESC_st::maxAnisotropy"]
        [::std::mem::offset_of!(HIP_TEXTURE_DESC_st, maxAnisotropy) - 20usize];
    ["Offset of field: HIP_TEXTURE_DESC_st::mipmapFilterMode"]
        [::std::mem::offset_of!(HIP_TEXTURE_DESC_st, mipmapFilterMode) - 24usize];
    ["Offset of field: HIP_TEXTURE_DESC_st::mipmapLevelBias"]
        [::std::mem::offset_of!(HIP_TEXTURE_DESC_st, mipmapLevelBias) - 28usize];
    ["Offset of field: HIP_TEXTURE_DESC_st::minMipmapLevelClamp"]
        [::std::mem::offset_of!(HIP_TEXTURE_DESC_st, minMipmapLevelClamp) - 32usize];
    ["Offset of field: HIP_TEXTURE_DESC_st::maxMipmapLevelClamp"]
        [::std::mem::offset_of!(HIP_TEXTURE_DESC_st, maxMipmapLevelClamp) - 36usize];
    ["Offset of field: HIP_TEXTURE_DESC_st::borderColor"]
        [::std::mem::offset_of!(HIP_TEXTURE_DESC_st, borderColor) - 40usize];
    ["Offset of field: HIP_TEXTURE_DESC_st::reserved"]
        [::std::mem::offset_of!(HIP_TEXTURE_DESC_st, reserved) - 56usize];
};
pub type HIP_TEXTURE_DESC = HIP_TEXTURE_DESC_st;
pub const hipResourceViewFormat_hipResViewFormatNone: hipResourceViewFormat = 0;
pub const hipResourceViewFormat_hipResViewFormatUnsignedChar1: hipResourceViewFormat = 1;
pub const hipResourceViewFormat_hipResViewFormatUnsignedChar2: hipResourceViewFormat = 2;
pub const hipResourceViewFormat_hipResViewFormatUnsignedChar4: hipResourceViewFormat = 3;
pub const hipResourceViewFormat_hipResViewFormatSignedChar1: hipResourceViewFormat = 4;
pub const hipResourceViewFormat_hipResViewFormatSignedChar2: hipResourceViewFormat = 5;
pub const hipResourceViewFormat_hipResViewFormatSignedChar4: hipResourceViewFormat = 6;
pub const hipResourceViewFormat_hipResViewFormatUnsignedShort1: hipResourceViewFormat = 7;
pub const hipResourceViewFormat_hipResViewFormatUnsignedShort2: hipResourceViewFormat = 8;
pub const hipResourceViewFormat_hipResViewFormatUnsignedShort4: hipResourceViewFormat = 9;
pub const hipResourceViewFormat_hipResViewFormatSignedShort1: hipResourceViewFormat = 10;
pub const hipResourceViewFormat_hipResViewFormatSignedShort2: hipResourceViewFormat = 11;
pub const hipResourceViewFormat_hipResViewFormatSignedShort4: hipResourceViewFormat = 12;
pub const hipResourceViewFormat_hipResViewFormatUnsignedInt1: hipResourceViewFormat = 13;
pub const hipResourceViewFormat_hipResViewFormatUnsignedInt2: hipResourceViewFormat = 14;
pub const hipResourceViewFormat_hipResViewFormatUnsignedInt4: hipResourceViewFormat = 15;
pub const hipResourceViewFormat_hipResViewFormatSignedInt1: hipResourceViewFormat = 16;
pub const hipResourceViewFormat_hipResViewFormatSignedInt2: hipResourceViewFormat = 17;
pub const hipResourceViewFormat_hipResViewFormatSignedInt4: hipResourceViewFormat = 18;
pub const hipResourceViewFormat_hipResViewFormatHalf1: hipResourceViewFormat = 19;
pub const hipResourceViewFormat_hipResViewFormatHalf2: hipResourceViewFormat = 20;
pub const hipResourceViewFormat_hipResViewFormatHalf4: hipResourceViewFormat = 21;
pub const hipResourceViewFormat_hipResViewFormatFloat1: hipResourceViewFormat = 22;
pub const hipResourceViewFormat_hipResViewFormatFloat2: hipResourceViewFormat = 23;
pub const hipResourceViewFormat_hipResViewFormatFloat4: hipResourceViewFormat = 24;
pub const hipResourceViewFormat_hipResViewFormatUnsignedBlockCompressed1: hipResourceViewFormat =
    25;
pub const hipResourceViewFormat_hipResViewFormatUnsignedBlockCompressed2: hipResourceViewFormat =
    26;
pub const hipResourceViewFormat_hipResViewFormatUnsignedBlockCompressed3: hipResourceViewFormat =
    27;
pub const hipResourceViewFormat_hipResViewFormatUnsignedBlockCompressed4: hipResourceViewFormat =
    28;
pub const hipResourceViewFormat_hipResViewFormatSignedBlockCompressed4: hipResourceViewFormat = 29;
pub const hipResourceViewFormat_hipResViewFormatUnsignedBlockCompressed5: hipResourceViewFormat =
    30;
pub const hipResourceViewFormat_hipResViewFormatSignedBlockCompressed5: hipResourceViewFormat = 31;
pub const hipResourceViewFormat_hipResViewFormatUnsignedBlockCompressed6H: hipResourceViewFormat =
    32;
pub const hipResourceViewFormat_hipResViewFormatSignedBlockCompressed6H: hipResourceViewFormat = 33;
pub const hipResourceViewFormat_hipResViewFormatUnsignedBlockCompressed7: hipResourceViewFormat =
    34;
pub type hipResourceViewFormat = ::std::os::raw::c_uint;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_NONE: HIPresourceViewFormat_enum = 0;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UINT_1X8: HIPresourceViewFormat_enum = 1;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UINT_2X8: HIPresourceViewFormat_enum = 2;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UINT_4X8: HIPresourceViewFormat_enum = 3;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_SINT_1X8: HIPresourceViewFormat_enum = 4;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_SINT_2X8: HIPresourceViewFormat_enum = 5;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_SINT_4X8: HIPresourceViewFormat_enum = 6;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UINT_1X16: HIPresourceViewFormat_enum = 7;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UINT_2X16: HIPresourceViewFormat_enum = 8;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UINT_4X16: HIPresourceViewFormat_enum = 9;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_SINT_1X16: HIPresourceViewFormat_enum = 10;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_SINT_2X16: HIPresourceViewFormat_enum = 11;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_SINT_4X16: HIPresourceViewFormat_enum = 12;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UINT_1X32: HIPresourceViewFormat_enum = 13;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UINT_2X32: HIPresourceViewFormat_enum = 14;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UINT_4X32: HIPresourceViewFormat_enum = 15;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_SINT_1X32: HIPresourceViewFormat_enum = 16;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_SINT_2X32: HIPresourceViewFormat_enum = 17;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_SINT_4X32: HIPresourceViewFormat_enum = 18;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_FLOAT_1X16: HIPresourceViewFormat_enum =
    19;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_FLOAT_2X16: HIPresourceViewFormat_enum =
    20;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_FLOAT_4X16: HIPresourceViewFormat_enum =
    21;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_FLOAT_1X32: HIPresourceViewFormat_enum =
    22;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_FLOAT_2X32: HIPresourceViewFormat_enum =
    23;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_FLOAT_4X32: HIPresourceViewFormat_enum =
    24;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UNSIGNED_BC1: HIPresourceViewFormat_enum =
    25;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UNSIGNED_BC2: HIPresourceViewFormat_enum =
    26;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UNSIGNED_BC3: HIPresourceViewFormat_enum =
    27;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UNSIGNED_BC4: HIPresourceViewFormat_enum =
    28;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_SIGNED_BC4: HIPresourceViewFormat_enum =
    29;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UNSIGNED_BC5: HIPresourceViewFormat_enum =
    30;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_SIGNED_BC5: HIPresourceViewFormat_enum =
    31;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UNSIGNED_BC6H: HIPresourceViewFormat_enum =
    32;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_SIGNED_BC6H: HIPresourceViewFormat_enum =
    33;
pub const HIPresourceViewFormat_enum_HIP_RES_VIEW_FORMAT_UNSIGNED_BC7: HIPresourceViewFormat_enum =
    34;
pub type HIPresourceViewFormat_enum = ::std::os::raw::c_uint;
pub use self::HIPresourceViewFormat_enum as HIPresourceViewFormat;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hipResourceDesc {
    pub resType: hipResourceType,
    pub res: hipResourceDesc__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union hipResourceDesc__bindgen_ty_1 {
    pub array: hipResourceDesc__bindgen_ty_1__bindgen_ty_1,
    pub mipmap: hipResourceDesc__bindgen_ty_1__bindgen_ty_2,
    pub linear: hipResourceDesc__bindgen_ty_1__bindgen_ty_3,
    pub pitch2D: hipResourceDesc__bindgen_ty_1__bindgen_ty_4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipResourceDesc__bindgen_ty_1__bindgen_ty_1 {
    pub array: hipArray_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipResourceDesc__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<hipResourceDesc__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of hipResourceDesc__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<hipResourceDesc__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1__bindgen_ty_1::array"]
        [::std::mem::offset_of!(hipResourceDesc__bindgen_ty_1__bindgen_ty_1, array) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipResourceDesc__bindgen_ty_1__bindgen_ty_2 {
    pub mipmap: hipMipmappedArray_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipResourceDesc__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<hipResourceDesc__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of hipResourceDesc__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<hipResourceDesc__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1__bindgen_ty_2::mipmap"]
        [::std::mem::offset_of!(hipResourceDesc__bindgen_ty_1__bindgen_ty_2, mipmap) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipResourceDesc__bindgen_ty_1__bindgen_ty_3 {
    pub devPtr: *mut ::std::os::raw::c_void,
    pub desc: hipChannelFormatDesc,
    pub sizeInBytes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipResourceDesc__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<hipResourceDesc__bindgen_ty_1__bindgen_ty_3>() - 40usize];
    ["Alignment of hipResourceDesc__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<hipResourceDesc__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1__bindgen_ty_3::devPtr"]
        [::std::mem::offset_of!(hipResourceDesc__bindgen_ty_1__bindgen_ty_3, devPtr) - 0usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1__bindgen_ty_3::desc"]
        [::std::mem::offset_of!(hipResourceDesc__bindgen_ty_1__bindgen_ty_3, desc) - 8usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1__bindgen_ty_3::sizeInBytes"][::std::mem::offset_of!(
        hipResourceDesc__bindgen_ty_1__bindgen_ty_3,
        sizeInBytes
    ) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipResourceDesc__bindgen_ty_1__bindgen_ty_4 {
    pub devPtr: *mut ::std::os::raw::c_void,
    pub desc: hipChannelFormatDesc,
    pub width: usize,
    pub height: usize,
    pub pitchInBytes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipResourceDesc__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<hipResourceDesc__bindgen_ty_1__bindgen_ty_4>() - 56usize];
    ["Alignment of hipResourceDesc__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<hipResourceDesc__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1__bindgen_ty_4::devPtr"]
        [::std::mem::offset_of!(hipResourceDesc__bindgen_ty_1__bindgen_ty_4, devPtr) - 0usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1__bindgen_ty_4::desc"]
        [::std::mem::offset_of!(hipResourceDesc__bindgen_ty_1__bindgen_ty_4, desc) - 8usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1__bindgen_ty_4::width"]
        [::std::mem::offset_of!(hipResourceDesc__bindgen_ty_1__bindgen_ty_4, width) - 32usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1__bindgen_ty_4::height"]
        [::std::mem::offset_of!(hipResourceDesc__bindgen_ty_1__bindgen_ty_4, height) - 40usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1__bindgen_ty_4::pitchInBytes"][::std::mem::offset_of!(
        hipResourceDesc__bindgen_ty_1__bindgen_ty_4,
        pitchInBytes
    ) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipResourceDesc__bindgen_ty_1"]
        [::std::mem::size_of::<hipResourceDesc__bindgen_ty_1>() - 56usize];
    ["Alignment of hipResourceDesc__bindgen_ty_1"]
        [::std::mem::align_of::<hipResourceDesc__bindgen_ty_1>() - 8usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1::array"]
        [::std::mem::offset_of!(hipResourceDesc__bindgen_ty_1, array) - 0usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1::mipmap"]
        [::std::mem::offset_of!(hipResourceDesc__bindgen_ty_1, mipmap) - 0usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1::linear"]
        [::std::mem::offset_of!(hipResourceDesc__bindgen_ty_1, linear) - 0usize];
    ["Offset of field: hipResourceDesc__bindgen_ty_1::pitch2D"]
        [::std::mem::offset_of!(hipResourceDesc__bindgen_ty_1, pitch2D) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipResourceDesc"][::std::mem::size_of::<hipResourceDesc>() - 64usize];
    ["Alignment of hipResourceDesc"][::std::mem::align_of::<hipResourceDesc>() - 8usize];
    ["Offset of field: hipResourceDesc::resType"]
        [::std::mem::offset_of!(hipResourceDesc, resType) - 0usize];
    ["Offset of field: hipResourceDesc::res"]
        [::std::mem::offset_of!(hipResourceDesc, res) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct HIP_RESOURCE_DESC_st {
    pub resType: HIPresourcetype,
    pub res: HIP_RESOURCE_DESC_st__bindgen_ty_1,
    pub flags: ::std::os::raw::c_uint,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union HIP_RESOURCE_DESC_st__bindgen_ty_1 {
    pub array: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1,
    pub mipmap: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2,
    pub linear: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3,
    pub pitch2D: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4,
    pub reserved: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1 {
    pub hArray: hipArray_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1::hArray"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1, hArray) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2 {
    pub hMipmappedArray: hipMipmappedArray_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2::hMipmappedArray"][::std::mem::offset_of!(
        HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2,
        hMipmappedArray
    )
        - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3 {
    pub devPtr: hipDeviceptr_t,
    pub format: hipArray_Format,
    pub numChannels: ::std::os::raw::c_uint,
    pub sizeInBytes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3>() - 24usize];
    ["Alignment of HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3::devPtr"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3, devPtr) - 0usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3::format"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3, format) - 8usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3::numChannels"][::std::mem::offset_of!(
        HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3,
        numChannels
    ) - 12usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3::sizeInBytes"][::std::mem::offset_of!(
        HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3,
        sizeInBytes
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4 {
    pub devPtr: hipDeviceptr_t,
    pub format: hipArray_Format,
    pub numChannels: ::std::os::raw::c_uint,
    pub width: usize,
    pub height: usize,
    pub pitchInBytes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4>() - 40usize];
    ["Alignment of HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4::devPtr"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4, devPtr) - 0usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4::format"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4, format) - 8usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4::numChannels"][::std::mem::offset_of!(
        HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4,
        numChannels
    ) - 12usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4::width"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4, width) - 16usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4::height"][::std::mem::offset_of!(
        HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4,
        height
    ) - 24usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4::pitchInBytes"][::std::mem::offset_of!(
        HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4,
        pitchInBytes
    )
        - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5 {
    pub reserved: [::std::os::raw::c_int; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5>() - 128usize];
    ["Alignment of HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5>() - 4usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5::reserved"][::std::mem::offset_of!(
        HIP_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5,
        reserved
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HIP_RESOURCE_DESC_st__bindgen_ty_1"]
        [::std::mem::size_of::<HIP_RESOURCE_DESC_st__bindgen_ty_1>() - 128usize];
    ["Alignment of HIP_RESOURCE_DESC_st__bindgen_ty_1"]
        [::std::mem::align_of::<HIP_RESOURCE_DESC_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1::array"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st__bindgen_ty_1, array) - 0usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1::mipmap"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st__bindgen_ty_1, mipmap) - 0usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1::linear"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st__bindgen_ty_1, linear) - 0usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1::pitch2D"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st__bindgen_ty_1, pitch2D) - 0usize];
    ["Offset of field: HIP_RESOURCE_DESC_st__bindgen_ty_1::reserved"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st__bindgen_ty_1, reserved) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HIP_RESOURCE_DESC_st"][::std::mem::size_of::<HIP_RESOURCE_DESC_st>() - 144usize];
    ["Alignment of HIP_RESOURCE_DESC_st"][::std::mem::align_of::<HIP_RESOURCE_DESC_st>() - 8usize];
    ["Offset of field: HIP_RESOURCE_DESC_st::resType"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st, resType) - 0usize];
    ["Offset of field: HIP_RESOURCE_DESC_st::res"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st, res) - 8usize];
    ["Offset of field: HIP_RESOURCE_DESC_st::flags"]
        [::std::mem::offset_of!(HIP_RESOURCE_DESC_st, flags) - 136usize];
};
pub type HIP_RESOURCE_DESC = HIP_RESOURCE_DESC_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipResourceViewDesc {
    pub format: hipResourceViewFormat,
    pub width: usize,
    pub height: usize,
    pub depth: usize,
    pub firstMipmapLevel: ::std::os::raw::c_uint,
    pub lastMipmapLevel: ::std::os::raw::c_uint,
    pub firstLayer: ::std::os::raw::c_uint,
    pub lastLayer: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipResourceViewDesc"][::std::mem::size_of::<hipResourceViewDesc>() - 48usize];
    ["Alignment of hipResourceViewDesc"][::std::mem::align_of::<hipResourceViewDesc>() - 8usize];
    ["Offset of field: hipResourceViewDesc::format"]
        [::std::mem::offset_of!(hipResourceViewDesc, format) - 0usize];
    ["Offset of field: hipResourceViewDesc::width"]
        [::std::mem::offset_of!(hipResourceViewDesc, width) - 8usize];
    ["Offset of field: hipResourceViewDesc::height"]
        [::std::mem::offset_of!(hipResourceViewDesc, height) - 16usize];
    ["Offset of field: hipResourceViewDesc::depth"]
        [::std::mem::offset_of!(hipResourceViewDesc, depth) - 24usize];
    ["Offset of field: hipResourceViewDesc::firstMipmapLevel"]
        [::std::mem::offset_of!(hipResourceViewDesc, firstMipmapLevel) - 32usize];
    ["Offset of field: hipResourceViewDesc::lastMipmapLevel"]
        [::std::mem::offset_of!(hipResourceViewDesc, lastMipmapLevel) - 36usize];
    ["Offset of field: hipResourceViewDesc::firstLayer"]
        [::std::mem::offset_of!(hipResourceViewDesc, firstLayer) - 40usize];
    ["Offset of field: hipResourceViewDesc::lastLayer"]
        [::std::mem::offset_of!(hipResourceViewDesc, lastLayer) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HIP_RESOURCE_VIEW_DESC_st {
    pub format: HIPresourceViewFormat,
    pub width: usize,
    pub height: usize,
    pub depth: usize,
    pub firstMipmapLevel: ::std::os::raw::c_uint,
    pub lastMipmapLevel: ::std::os::raw::c_uint,
    pub firstLayer: ::std::os::raw::c_uint,
    pub lastLayer: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HIP_RESOURCE_VIEW_DESC_st"]
        [::std::mem::size_of::<HIP_RESOURCE_VIEW_DESC_st>() - 112usize];
    ["Alignment of HIP_RESOURCE_VIEW_DESC_st"]
        [::std::mem::align_of::<HIP_RESOURCE_VIEW_DESC_st>() - 8usize];
    ["Offset of field: HIP_RESOURCE_VIEW_DESC_st::format"]
        [::std::mem::offset_of!(HIP_RESOURCE_VIEW_DESC_st, format) - 0usize];
    ["Offset of field: HIP_RESOURCE_VIEW_DESC_st::width"]
        [::std::mem::offset_of!(HIP_RESOURCE_VIEW_DESC_st, width) - 8usize];
    ["Offset of field: HIP_RESOURCE_VIEW_DESC_st::height"]
        [::std::mem::offset_of!(HIP_RESOURCE_VIEW_DESC_st, height) - 16usize];
    ["Offset of field: HIP_RESOURCE_VIEW_DESC_st::depth"]
        [::std::mem::offset_of!(HIP_RESOURCE_VIEW_DESC_st, depth) - 24usize];
    ["Offset of field: HIP_RESOURCE_VIEW_DESC_st::firstMipmapLevel"]
        [::std::mem::offset_of!(HIP_RESOURCE_VIEW_DESC_st, firstMipmapLevel) - 32usize];
    ["Offset of field: HIP_RESOURCE_VIEW_DESC_st::lastMipmapLevel"]
        [::std::mem::offset_of!(HIP_RESOURCE_VIEW_DESC_st, lastMipmapLevel) - 36usize];
    ["Offset of field: HIP_RESOURCE_VIEW_DESC_st::firstLayer"]
        [::std::mem::offset_of!(HIP_RESOURCE_VIEW_DESC_st, firstLayer) - 40usize];
    ["Offset of field: HIP_RESOURCE_VIEW_DESC_st::lastLayer"]
        [::std::mem::offset_of!(HIP_RESOURCE_VIEW_DESC_st, lastLayer) - 44usize];
    ["Offset of field: HIP_RESOURCE_VIEW_DESC_st::reserved"]
        [::std::mem::offset_of!(HIP_RESOURCE_VIEW_DESC_st, reserved) - 48usize];
};
pub type HIP_RESOURCE_VIEW_DESC = HIP_RESOURCE_VIEW_DESC_st;
pub const hipMemcpyKind_hipMemcpyHostToHost: hipMemcpyKind = 0;
pub const hipMemcpyKind_hipMemcpyHostToDevice: hipMemcpyKind = 1;
pub const hipMemcpyKind_hipMemcpyDeviceToHost: hipMemcpyKind = 2;
pub const hipMemcpyKind_hipMemcpyDeviceToDevice: hipMemcpyKind = 3;
pub const hipMemcpyKind_hipMemcpyDefault: hipMemcpyKind = 4;
pub const hipMemcpyKind_hipMemcpyDeviceToDeviceNoCU: hipMemcpyKind = 1024;
pub type hipMemcpyKind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipPitchedPtr {
    pub ptr: *mut ::std::os::raw::c_void,
    pub pitch: usize,
    pub xsize: usize,
    pub ysize: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipPitchedPtr"][::std::mem::size_of::<hipPitchedPtr>() - 32usize];
    ["Alignment of hipPitchedPtr"][::std::mem::align_of::<hipPitchedPtr>() - 8usize];
    ["Offset of field: hipPitchedPtr::ptr"][::std::mem::offset_of!(hipPitchedPtr, ptr) - 0usize];
    ["Offset of field: hipPitchedPtr::pitch"]
        [::std::mem::offset_of!(hipPitchedPtr, pitch) - 8usize];
    ["Offset of field: hipPitchedPtr::xsize"]
        [::std::mem::offset_of!(hipPitchedPtr, xsize) - 16usize];
    ["Offset of field: hipPitchedPtr::ysize"]
        [::std::mem::offset_of!(hipPitchedPtr, ysize) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipExtent {
    pub width: usize,
    pub height: usize,
    pub depth: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExtent"][::std::mem::size_of::<hipExtent>() - 24usize];
    ["Alignment of hipExtent"][::std::mem::align_of::<hipExtent>() - 8usize];
    ["Offset of field: hipExtent::width"][::std::mem::offset_of!(hipExtent, width) - 0usize];
    ["Offset of field: hipExtent::height"][::std::mem::offset_of!(hipExtent, height) - 8usize];
    ["Offset of field: hipExtent::depth"][::std::mem::offset_of!(hipExtent, depth) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipPos {
    pub x: usize,
    pub y: usize,
    pub z: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipPos"][::std::mem::size_of::<hipPos>() - 24usize];
    ["Alignment of hipPos"][::std::mem::align_of::<hipPos>() - 8usize];
    ["Offset of field: hipPos::x"][::std::mem::offset_of!(hipPos, x) - 0usize];
    ["Offset of field: hipPos::y"][::std::mem::offset_of!(hipPos, y) - 8usize];
    ["Offset of field: hipPos::z"][::std::mem::offset_of!(hipPos, z) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipMemcpy3DParms {
    pub srcArray: hipArray_t,
    pub srcPos: hipPos,
    pub srcPtr: hipPitchedPtr,
    pub dstArray: hipArray_t,
    pub dstPos: hipPos,
    pub dstPtr: hipPitchedPtr,
    pub extent: hipExtent,
    pub kind: hipMemcpyKind,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipMemcpy3DParms"][::std::mem::size_of::<hipMemcpy3DParms>() - 160usize];
    ["Alignment of hipMemcpy3DParms"][::std::mem::align_of::<hipMemcpy3DParms>() - 8usize];
    ["Offset of field: hipMemcpy3DParms::srcArray"]
        [::std::mem::offset_of!(hipMemcpy3DParms, srcArray) - 0usize];
    ["Offset of field: hipMemcpy3DParms::srcPos"]
        [::std::mem::offset_of!(hipMemcpy3DParms, srcPos) - 8usize];
    ["Offset of field: hipMemcpy3DParms::srcPtr"]
        [::std::mem::offset_of!(hipMemcpy3DParms, srcPtr) - 32usize];
    ["Offset of field: hipMemcpy3DParms::dstArray"]
        [::std::mem::offset_of!(hipMemcpy3DParms, dstArray) - 64usize];
    ["Offset of field: hipMemcpy3DParms::dstPos"]
        [::std::mem::offset_of!(hipMemcpy3DParms, dstPos) - 72usize];
    ["Offset of field: hipMemcpy3DParms::dstPtr"]
        [::std::mem::offset_of!(hipMemcpy3DParms, dstPtr) - 96usize];
    ["Offset of field: hipMemcpy3DParms::extent"]
        [::std::mem::offset_of!(hipMemcpy3DParms, extent) - 128usize];
    ["Offset of field: hipMemcpy3DParms::kind"]
        [::std::mem::offset_of!(hipMemcpy3DParms, kind) - 152usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HIP_MEMCPY3D {
    pub srcXInBytes: usize,
    pub srcY: usize,
    pub srcZ: usize,
    pub srcLOD: usize,
    pub srcMemoryType: hipMemoryType,
    pub srcHost: *const ::std::os::raw::c_void,
    pub srcDevice: hipDeviceptr_t,
    pub srcArray: hipArray_t,
    pub srcPitch: usize,
    pub srcHeight: usize,
    pub dstXInBytes: usize,
    pub dstY: usize,
    pub dstZ: usize,
    pub dstLOD: usize,
    pub dstMemoryType: hipMemoryType,
    pub dstHost: *mut ::std::os::raw::c_void,
    pub dstDevice: hipDeviceptr_t,
    pub dstArray: hipArray_t,
    pub dstPitch: usize,
    pub dstHeight: usize,
    pub WidthInBytes: usize,
    pub Height: usize,
    pub Depth: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HIP_MEMCPY3D"][::std::mem::size_of::<HIP_MEMCPY3D>() - 184usize];
    ["Alignment of HIP_MEMCPY3D"][::std::mem::align_of::<HIP_MEMCPY3D>() - 8usize];
    ["Offset of field: HIP_MEMCPY3D::srcXInBytes"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, srcXInBytes) - 0usize];
    ["Offset of field: HIP_MEMCPY3D::srcY"][::std::mem::offset_of!(HIP_MEMCPY3D, srcY) - 8usize];
    ["Offset of field: HIP_MEMCPY3D::srcZ"][::std::mem::offset_of!(HIP_MEMCPY3D, srcZ) - 16usize];
    ["Offset of field: HIP_MEMCPY3D::srcLOD"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, srcLOD) - 24usize];
    ["Offset of field: HIP_MEMCPY3D::srcMemoryType"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, srcMemoryType) - 32usize];
    ["Offset of field: HIP_MEMCPY3D::srcHost"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, srcHost) - 40usize];
    ["Offset of field: HIP_MEMCPY3D::srcDevice"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, srcDevice) - 48usize];
    ["Offset of field: HIP_MEMCPY3D::srcArray"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, srcArray) - 56usize];
    ["Offset of field: HIP_MEMCPY3D::srcPitch"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, srcPitch) - 64usize];
    ["Offset of field: HIP_MEMCPY3D::srcHeight"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, srcHeight) - 72usize];
    ["Offset of field: HIP_MEMCPY3D::dstXInBytes"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, dstXInBytes) - 80usize];
    ["Offset of field: HIP_MEMCPY3D::dstY"][::std::mem::offset_of!(HIP_MEMCPY3D, dstY) - 88usize];
    ["Offset of field: HIP_MEMCPY3D::dstZ"][::std::mem::offset_of!(HIP_MEMCPY3D, dstZ) - 96usize];
    ["Offset of field: HIP_MEMCPY3D::dstLOD"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, dstLOD) - 104usize];
    ["Offset of field: HIP_MEMCPY3D::dstMemoryType"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, dstMemoryType) - 112usize];
    ["Offset of field: HIP_MEMCPY3D::dstHost"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, dstHost) - 120usize];
    ["Offset of field: HIP_MEMCPY3D::dstDevice"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, dstDevice) - 128usize];
    ["Offset of field: HIP_MEMCPY3D::dstArray"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, dstArray) - 136usize];
    ["Offset of field: HIP_MEMCPY3D::dstPitch"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, dstPitch) - 144usize];
    ["Offset of field: HIP_MEMCPY3D::dstHeight"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, dstHeight) - 152usize];
    ["Offset of field: HIP_MEMCPY3D::WidthInBytes"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, WidthInBytes) - 160usize];
    ["Offset of field: HIP_MEMCPY3D::Height"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, Height) - 168usize];
    ["Offset of field: HIP_MEMCPY3D::Depth"]
        [::std::mem::offset_of!(HIP_MEMCPY3D, Depth) - 176usize];
};
pub const hipFunction_attribute_HIP_FUNC_ATTRIBUTE_MAX_THREADS_PER_BLOCK: hipFunction_attribute = 0;
pub const hipFunction_attribute_HIP_FUNC_ATTRIBUTE_SHARED_SIZE_BYTES: hipFunction_attribute = 1;
pub const hipFunction_attribute_HIP_FUNC_ATTRIBUTE_CONST_SIZE_BYTES: hipFunction_attribute = 2;
pub const hipFunction_attribute_HIP_FUNC_ATTRIBUTE_LOCAL_SIZE_BYTES: hipFunction_attribute = 3;
pub const hipFunction_attribute_HIP_FUNC_ATTRIBUTE_NUM_REGS: hipFunction_attribute = 4;
pub const hipFunction_attribute_HIP_FUNC_ATTRIBUTE_PTX_VERSION: hipFunction_attribute = 5;
pub const hipFunction_attribute_HIP_FUNC_ATTRIBUTE_BINARY_VERSION: hipFunction_attribute = 6;
pub const hipFunction_attribute_HIP_FUNC_ATTRIBUTE_CACHE_MODE_CA: hipFunction_attribute = 7;
pub const hipFunction_attribute_HIP_FUNC_ATTRIBUTE_MAX_DYNAMIC_SHARED_SIZE_BYTES:
    hipFunction_attribute = 8;
pub const hipFunction_attribute_HIP_FUNC_ATTRIBUTE_PREFERRED_SHARED_MEMORY_CARVEOUT:
    hipFunction_attribute = 9;
pub const hipFunction_attribute_HIP_FUNC_ATTRIBUTE_MAX: hipFunction_attribute = 10;
pub type hipFunction_attribute = ::std::os::raw::c_uint;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_CONTEXT: hipPointer_attribute = 1;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_MEMORY_TYPE: hipPointer_attribute = 2;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_DEVICE_POINTER: hipPointer_attribute = 3;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_HOST_POINTER: hipPointer_attribute = 4;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_P2P_TOKENS: hipPointer_attribute = 5;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_SYNC_MEMOPS: hipPointer_attribute = 6;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_BUFFER_ID: hipPointer_attribute = 7;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_IS_MANAGED: hipPointer_attribute = 8;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_DEVICE_ORDINAL: hipPointer_attribute = 9;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_IS_LEGACY_HIP_IPC_CAPABLE:
    hipPointer_attribute = 10;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_RANGE_START_ADDR: hipPointer_attribute = 11;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_RANGE_SIZE: hipPointer_attribute = 12;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_MAPPED: hipPointer_attribute = 13;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_ALLOWED_HANDLE_TYPES: hipPointer_attribute =
    14;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_IS_GPU_DIRECT_RDMA_CAPABLE:
    hipPointer_attribute = 15;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_ACCESS_FLAGS: hipPointer_attribute = 16;
pub const hipPointer_attribute_HIP_POINTER_ATTRIBUTE_MEMPOOL_HANDLE: hipPointer_attribute = 17;
pub type hipPointer_attribute = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uint3 {
    pub x: ::std::os::raw::c_uint,
    pub y: ::std::os::raw::c_uint,
    pub z: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uint3"][::std::mem::size_of::<uint3>() - 12usize];
    ["Alignment of uint3"][::std::mem::align_of::<uint3>() - 4usize];
    ["Offset of field: uint3::x"][::std::mem::offset_of!(uint3, x) - 0usize];
    ["Offset of field: uint3::y"][::std::mem::offset_of!(uint3, y) - 4usize];
    ["Offset of field: uint3::z"][::std::mem::offset_of!(uint3, z) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __hip_texture {
    _unused: [u8; 0],
}
pub type hipTextureObject_t = *mut __hip_texture;
pub const hipTextureAddressMode_hipAddressModeWrap: hipTextureAddressMode = 0;
pub const hipTextureAddressMode_hipAddressModeClamp: hipTextureAddressMode = 1;
pub const hipTextureAddressMode_hipAddressModeMirror: hipTextureAddressMode = 2;
pub const hipTextureAddressMode_hipAddressModeBorder: hipTextureAddressMode = 3;
pub type hipTextureAddressMode = ::std::os::raw::c_uint;
pub const hipTextureFilterMode_hipFilterModePoint: hipTextureFilterMode = 0;
pub const hipTextureFilterMode_hipFilterModeLinear: hipTextureFilterMode = 1;
pub type hipTextureFilterMode = ::std::os::raw::c_uint;
pub const hipTextureReadMode_hipReadModeElementType: hipTextureReadMode = 0;
pub const hipTextureReadMode_hipReadModeNormalizedFloat: hipTextureReadMode = 1;
pub type hipTextureReadMode = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct textureReference {
    pub normalized: ::std::os::raw::c_int,
    pub readMode: hipTextureReadMode,
    pub filterMode: hipTextureFilterMode,
    pub addressMode: [hipTextureAddressMode; 3usize],
    pub channelDesc: hipChannelFormatDesc,
    pub sRGB: ::std::os::raw::c_int,
    pub maxAnisotropy: ::std::os::raw::c_uint,
    pub mipmapFilterMode: hipTextureFilterMode,
    pub mipmapLevelBias: f32,
    pub minMipmapLevelClamp: f32,
    pub maxMipmapLevelClamp: f32,
    pub textureObject: hipTextureObject_t,
    pub numChannels: ::std::os::raw::c_int,
    pub format: hipArray_Format,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of textureReference"][::std::mem::size_of::<textureReference>() - 88usize];
    ["Alignment of textureReference"][::std::mem::align_of::<textureReference>() - 8usize];
    ["Offset of field: textureReference::normalized"]
        [::std::mem::offset_of!(textureReference, normalized) - 0usize];
    ["Offset of field: textureReference::readMode"]
        [::std::mem::offset_of!(textureReference, readMode) - 4usize];
    ["Offset of field: textureReference::filterMode"]
        [::std::mem::offset_of!(textureReference, filterMode) - 8usize];
    ["Offset of field: textureReference::addressMode"]
        [::std::mem::offset_of!(textureReference, addressMode) - 12usize];
    ["Offset of field: textureReference::channelDesc"]
        [::std::mem::offset_of!(textureReference, channelDesc) - 24usize];
    ["Offset of field: textureReference::sRGB"]
        [::std::mem::offset_of!(textureReference, sRGB) - 44usize];
    ["Offset of field: textureReference::maxAnisotropy"]
        [::std::mem::offset_of!(textureReference, maxAnisotropy) - 48usize];
    ["Offset of field: textureReference::mipmapFilterMode"]
        [::std::mem::offset_of!(textureReference, mipmapFilterMode) - 52usize];
    ["Offset of field: textureReference::mipmapLevelBias"]
        [::std::mem::offset_of!(textureReference, mipmapLevelBias) - 56usize];
    ["Offset of field: textureReference::minMipmapLevelClamp"]
        [::std::mem::offset_of!(textureReference, minMipmapLevelClamp) - 60usize];
    ["Offset of field: textureReference::maxMipmapLevelClamp"]
        [::std::mem::offset_of!(textureReference, maxMipmapLevelClamp) - 64usize];
    ["Offset of field: textureReference::textureObject"]
        [::std::mem::offset_of!(textureReference, textureObject) - 72usize];
    ["Offset of field: textureReference::numChannels"]
        [::std::mem::offset_of!(textureReference, numChannels) - 80usize];
    ["Offset of field: textureReference::format"]
        [::std::mem::offset_of!(textureReference, format) - 84usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipTextureDesc {
    pub addressMode: [hipTextureAddressMode; 3usize],
    pub filterMode: hipTextureFilterMode,
    pub readMode: hipTextureReadMode,
    pub sRGB: ::std::os::raw::c_int,
    pub borderColor: [f32; 4usize],
    pub normalizedCoords: ::std::os::raw::c_int,
    pub maxAnisotropy: ::std::os::raw::c_uint,
    pub mipmapFilterMode: hipTextureFilterMode,
    pub mipmapLevelBias: f32,
    pub minMipmapLevelClamp: f32,
    pub maxMipmapLevelClamp: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipTextureDesc"][::std::mem::size_of::<hipTextureDesc>() - 64usize];
    ["Alignment of hipTextureDesc"][::std::mem::align_of::<hipTextureDesc>() - 4usize];
    ["Offset of field: hipTextureDesc::addressMode"]
        [::std::mem::offset_of!(hipTextureDesc, addressMode) - 0usize];
    ["Offset of field: hipTextureDesc::filterMode"]
        [::std::mem::offset_of!(hipTextureDesc, filterMode) - 12usize];
    ["Offset of field: hipTextureDesc::readMode"]
        [::std::mem::offset_of!(hipTextureDesc, readMode) - 16usize];
    ["Offset of field: hipTextureDesc::sRGB"]
        [::std::mem::offset_of!(hipTextureDesc, sRGB) - 20usize];
    ["Offset of field: hipTextureDesc::borderColor"]
        [::std::mem::offset_of!(hipTextureDesc, borderColor) - 24usize];
    ["Offset of field: hipTextureDesc::normalizedCoords"]
        [::std::mem::offset_of!(hipTextureDesc, normalizedCoords) - 40usize];
    ["Offset of field: hipTextureDesc::maxAnisotropy"]
        [::std::mem::offset_of!(hipTextureDesc, maxAnisotropy) - 44usize];
    ["Offset of field: hipTextureDesc::mipmapFilterMode"]
        [::std::mem::offset_of!(hipTextureDesc, mipmapFilterMode) - 48usize];
    ["Offset of field: hipTextureDesc::mipmapLevelBias"]
        [::std::mem::offset_of!(hipTextureDesc, mipmapLevelBias) - 52usize];
    ["Offset of field: hipTextureDesc::minMipmapLevelClamp"]
        [::std::mem::offset_of!(hipTextureDesc, minMipmapLevelClamp) - 56usize];
    ["Offset of field: hipTextureDesc::maxMipmapLevelClamp"]
        [::std::mem::offset_of!(hipTextureDesc, maxMipmapLevelClamp) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __hip_surface {
    _unused: [u8; 0],
}
pub type hipSurfaceObject_t = *mut __hip_surface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ihipCtx_t {
    _unused: [u8; 0],
}
pub type hipCtx_t = *mut ihipCtx_t;
pub type hipDevice_t = ::std::os::raw::c_int;
pub const hipDeviceP2PAttr_hipDevP2PAttrPerformanceRank: hipDeviceP2PAttr = 0;
pub const hipDeviceP2PAttr_hipDevP2PAttrAccessSupported: hipDeviceP2PAttr = 1;
pub const hipDeviceP2PAttr_hipDevP2PAttrNativeAtomicSupported: hipDeviceP2PAttr = 2;
pub const hipDeviceP2PAttr_hipDevP2PAttrHipArrayAccessSupported: hipDeviceP2PAttr = 3;
pub type hipDeviceP2PAttr = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ihipStream_t {
    _unused: [u8; 0],
}
pub type hipStream_t = *mut ihipStream_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipIpcMemHandle_st {
    pub reserved: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipIpcMemHandle_st"][::std::mem::size_of::<hipIpcMemHandle_st>() - 64usize];
    ["Alignment of hipIpcMemHandle_st"][::std::mem::align_of::<hipIpcMemHandle_st>() - 1usize];
    ["Offset of field: hipIpcMemHandle_st::reserved"]
        [::std::mem::offset_of!(hipIpcMemHandle_st, reserved) - 0usize];
};
pub type hipIpcMemHandle_t = hipIpcMemHandle_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipIpcEventHandle_st {
    pub reserved: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipIpcEventHandle_st"][::std::mem::size_of::<hipIpcEventHandle_st>() - 64usize];
    ["Alignment of hipIpcEventHandle_st"][::std::mem::align_of::<hipIpcEventHandle_st>() - 1usize];
    ["Offset of field: hipIpcEventHandle_st::reserved"]
        [::std::mem::offset_of!(hipIpcEventHandle_st, reserved) - 0usize];
};
pub type hipIpcEventHandle_t = hipIpcEventHandle_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ihipModule_t {
    _unused: [u8; 0],
}
pub type hipModule_t = *mut ihipModule_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ihipModuleSymbol_t {
    _unused: [u8; 0],
}
pub type hipFunction_t = *mut ihipModuleSymbol_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ihipLinkState_t {
    _unused: [u8; 0],
}
pub type hipLinkState_t = *mut ihipLinkState_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ihipMemPoolHandle_t {
    _unused: [u8; 0],
}
pub type hipMemPool_t = *mut ihipMemPoolHandle_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipFuncAttributes {
    pub binaryVersion: ::std::os::raw::c_int,
    pub cacheModeCA: ::std::os::raw::c_int,
    pub constSizeBytes: usize,
    pub localSizeBytes: usize,
    pub maxDynamicSharedSizeBytes: ::std::os::raw::c_int,
    pub maxThreadsPerBlock: ::std::os::raw::c_int,
    pub numRegs: ::std::os::raw::c_int,
    pub preferredShmemCarveout: ::std::os::raw::c_int,
    pub ptxVersion: ::std::os::raw::c_int,
    pub sharedSizeBytes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipFuncAttributes"][::std::mem::size_of::<hipFuncAttributes>() - 56usize];
    ["Alignment of hipFuncAttributes"][::std::mem::align_of::<hipFuncAttributes>() - 8usize];
    ["Offset of field: hipFuncAttributes::binaryVersion"]
        [::std::mem::offset_of!(hipFuncAttributes, binaryVersion) - 0usize];
    ["Offset of field: hipFuncAttributes::cacheModeCA"]
        [::std::mem::offset_of!(hipFuncAttributes, cacheModeCA) - 4usize];
    ["Offset of field: hipFuncAttributes::constSizeBytes"]
        [::std::mem::offset_of!(hipFuncAttributes, constSizeBytes) - 8usize];
    ["Offset of field: hipFuncAttributes::localSizeBytes"]
        [::std::mem::offset_of!(hipFuncAttributes, localSizeBytes) - 16usize];
    ["Offset of field: hipFuncAttributes::maxDynamicSharedSizeBytes"]
        [::std::mem::offset_of!(hipFuncAttributes, maxDynamicSharedSizeBytes) - 24usize];
    ["Offset of field: hipFuncAttributes::maxThreadsPerBlock"]
        [::std::mem::offset_of!(hipFuncAttributes, maxThreadsPerBlock) - 28usize];
    ["Offset of field: hipFuncAttributes::numRegs"]
        [::std::mem::offset_of!(hipFuncAttributes, numRegs) - 32usize];
    ["Offset of field: hipFuncAttributes::preferredShmemCarveout"]
        [::std::mem::offset_of!(hipFuncAttributes, preferredShmemCarveout) - 36usize];
    ["Offset of field: hipFuncAttributes::ptxVersion"]
        [::std::mem::offset_of!(hipFuncAttributes, ptxVersion) - 40usize];
    ["Offset of field: hipFuncAttributes::sharedSizeBytes"]
        [::std::mem::offset_of!(hipFuncAttributes, sharedSizeBytes) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ihipEvent_t {
    _unused: [u8; 0],
}
pub type hipEvent_t = *mut ihipEvent_t;
pub const hipLimit_t_hipLimitStackSize: hipLimit_t = 0;
pub const hipLimit_t_hipLimitPrintfFifoSize: hipLimit_t = 1;
pub const hipLimit_t_hipLimitMallocHeapSize: hipLimit_t = 2;
pub const hipLimit_t_hipExtLimitScratchMin: hipLimit_t = 4096;
pub const hipLimit_t_hipExtLimitScratchMax: hipLimit_t = 4097;
pub const hipLimit_t_hipExtLimitScratchCurrent: hipLimit_t = 4098;
pub const hipLimit_t_hipLimitRange: hipLimit_t = 4099;
pub type hipLimit_t = ::std::os::raw::c_uint;
pub const hipStreamBatchMemOpType_hipStreamMemOpWaitValue32: hipStreamBatchMemOpType = 1;
pub const hipStreamBatchMemOpType_hipStreamMemOpWriteValue32: hipStreamBatchMemOpType = 2;
pub const hipStreamBatchMemOpType_hipStreamMemOpWaitValue64: hipStreamBatchMemOpType = 4;
pub const hipStreamBatchMemOpType_hipStreamMemOpWriteValue64: hipStreamBatchMemOpType = 5;
pub const hipStreamBatchMemOpType_hipStreamMemOpBarrier: hipStreamBatchMemOpType = 6;
pub const hipStreamBatchMemOpType_hipStreamMemOpFlushRemoteWrites: hipStreamBatchMemOpType = 3;
pub type hipStreamBatchMemOpType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union hipStreamBatchMemOpParams_union {
    pub operation: hipStreamBatchMemOpType,
    pub waitValue: hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t,
    pub writeValue: hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t,
    pub flushRemoteWrites: hipStreamBatchMemOpParams_union_hipStreamMemOpFlushRemoteWritesParams_t,
    pub memoryBarrier: hipStreamBatchMemOpParams_union_hipStreamMemOpMemoryBarrierParams_t,
    pub pad: [u64; 6usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t {
    pub operation: hipStreamBatchMemOpType,
    pub address: hipDeviceptr_t,
    pub __bindgen_anon_1:
        hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t__bindgen_ty_1,
    pub flags: ::std::os::raw::c_uint,
    pub alias: hipDeviceptr_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t__bindgen_ty_1 {
    pub value: u32,
    pub value64: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t__bindgen_ty_1"]
        [::std::mem::size_of::<
            hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t__bindgen_ty_1,
        >() - 8usize];
    ["Alignment of hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t__bindgen_ty_1"]
        [::std::mem::align_of::<
            hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t__bindgen_ty_1,
        >() - 8usize];
    [
        "Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t__bindgen_ty_1::value",
    ][::std::mem::offset_of!(
        hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t__bindgen_ty_1,
        value
    ) - 0usize];
    [
        "Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t__bindgen_ty_1::value64",
    ][::std::mem::offset_of!(
        hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t__bindgen_ty_1,
        value64
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t"][::std::mem::size_of::<
        hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t,
    >() - 40usize];
    ["Alignment of hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t"]
        [::std::mem::align_of::<hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t>()
            - 8usize];
    ["Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t::operation"]
        [::std::mem::offset_of!(
            hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t,
            operation
        ) - 0usize];
    ["Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t::address"][::std::mem::offset_of!(
        hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t,
        address
    )
        - 8usize];
    ["Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t::flags"][::std::mem::offset_of!(
        hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t,
        flags
    )
        - 24usize];
    ["Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t::alias"][::std::mem::offset_of!(
        hipStreamBatchMemOpParams_union_hipStreamMemOpWaitValueParams_t,
        alias
    )
        - 32usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t {
    pub operation: hipStreamBatchMemOpType,
    pub address: hipDeviceptr_t,
    pub __bindgen_anon_1:
        hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t__bindgen_ty_1,
    pub flags: ::std::os::raw::c_uint,
    pub alias: hipDeviceptr_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t__bindgen_ty_1 {
    pub value: u32,
    pub value64: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t__bindgen_ty_1"]
        [::std::mem::size_of::<
            hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t__bindgen_ty_1,
        >() - 8usize];
    ["Alignment of hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t__bindgen_ty_1"]
        [::std::mem::align_of::<
            hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t__bindgen_ty_1,
        >() - 8usize];
    [
        "Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t__bindgen_ty_1::value",
    ][::std::mem::offset_of!(
        hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t__bindgen_ty_1,
        value
    ) - 0usize];
    [
        "Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t__bindgen_ty_1::value64",
    ][::std::mem::offset_of!(
        hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t__bindgen_ty_1,
        value64
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t"][::std::mem::size_of::<
        hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t,
    >() - 40usize];
    ["Alignment of hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t"]
        [::std::mem::align_of::<hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t>(
        ) - 8usize];
    [
        "Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t::operation",
    ][::std::mem::offset_of!(
        hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t,
        operation
    ) - 0usize];
    ["Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t::address"]
        [::std::mem::offset_of!(
            hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t,
            address
        ) - 8usize];
    ["Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t::flags"][::std::mem::offset_of!(
        hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t,
        flags
    )
        - 24usize];
    ["Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t::alias"][::std::mem::offset_of!(
        hipStreamBatchMemOpParams_union_hipStreamMemOpWriteValueParams_t,
        alias
    )
        - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipStreamBatchMemOpParams_union_hipStreamMemOpFlushRemoteWritesParams_t {
    pub operation: hipStreamBatchMemOpType,
    pub flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipStreamBatchMemOpParams_union_hipStreamMemOpFlushRemoteWritesParams_t"]
        [::std::mem::size_of::<
            hipStreamBatchMemOpParams_union_hipStreamMemOpFlushRemoteWritesParams_t,
        >() - 8usize];
    ["Alignment of hipStreamBatchMemOpParams_union_hipStreamMemOpFlushRemoteWritesParams_t"]
        [::std::mem::align_of::<
            hipStreamBatchMemOpParams_union_hipStreamMemOpFlushRemoteWritesParams_t,
        >() - 4usize];
    [
        "Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpFlushRemoteWritesParams_t::operation",
    ][::std::mem::offset_of!(
        hipStreamBatchMemOpParams_union_hipStreamMemOpFlushRemoteWritesParams_t,
        operation
    ) - 0usize];
    [
        "Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpFlushRemoteWritesParams_t::flags",
    ][::std::mem::offset_of!(
        hipStreamBatchMemOpParams_union_hipStreamMemOpFlushRemoteWritesParams_t,
        flags
    ) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipStreamBatchMemOpParams_union_hipStreamMemOpMemoryBarrierParams_t {
    pub operation: hipStreamBatchMemOpType,
    pub flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipStreamBatchMemOpParams_union_hipStreamMemOpMemoryBarrierParams_t"]
        [::std::mem::size_of::<hipStreamBatchMemOpParams_union_hipStreamMemOpMemoryBarrierParams_t>(
        ) - 8usize];
    ["Alignment of hipStreamBatchMemOpParams_union_hipStreamMemOpMemoryBarrierParams_t"]
        [::std::mem::align_of::<hipStreamBatchMemOpParams_union_hipStreamMemOpMemoryBarrierParams_t>(
        ) - 4usize];
    [
        "Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpMemoryBarrierParams_t::operation",
    ][::std::mem::offset_of!(
        hipStreamBatchMemOpParams_union_hipStreamMemOpMemoryBarrierParams_t,
        operation
    ) - 0usize];
    ["Offset of field: hipStreamBatchMemOpParams_union_hipStreamMemOpMemoryBarrierParams_t::flags"]
        [::std::mem::offset_of!(
            hipStreamBatchMemOpParams_union_hipStreamMemOpMemoryBarrierParams_t,
            flags
        ) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipStreamBatchMemOpParams_union"]
        [::std::mem::size_of::<hipStreamBatchMemOpParams_union>() - 48usize];
    ["Alignment of hipStreamBatchMemOpParams_union"]
        [::std::mem::align_of::<hipStreamBatchMemOpParams_union>() - 8usize];
    ["Offset of field: hipStreamBatchMemOpParams_union::operation"]
        [::std::mem::offset_of!(hipStreamBatchMemOpParams_union, operation) - 0usize];
    ["Offset of field: hipStreamBatchMemOpParams_union::waitValue"]
        [::std::mem::offset_of!(hipStreamBatchMemOpParams_union, waitValue) - 0usize];
    ["Offset of field: hipStreamBatchMemOpParams_union::writeValue"]
        [::std::mem::offset_of!(hipStreamBatchMemOpParams_union, writeValue) - 0usize];
    ["Offset of field: hipStreamBatchMemOpParams_union::flushRemoteWrites"]
        [::std::mem::offset_of!(hipStreamBatchMemOpParams_union, flushRemoteWrites) - 0usize];
    ["Offset of field: hipStreamBatchMemOpParams_union::memoryBarrier"]
        [::std::mem::offset_of!(hipStreamBatchMemOpParams_union, memoryBarrier) - 0usize];
    ["Offset of field: hipStreamBatchMemOpParams_union::pad"]
        [::std::mem::offset_of!(hipStreamBatchMemOpParams_union, pad) - 0usize];
};
pub type hipStreamBatchMemOpParams = hipStreamBatchMemOpParams_union;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipBatchMemOpNodeParams {
    pub ctx: hipCtx_t,
    pub count: ::std::os::raw::c_uint,
    pub paramArray: *mut hipStreamBatchMemOpParams,
    pub flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipBatchMemOpNodeParams"][::std::mem::size_of::<hipBatchMemOpNodeParams>() - 32usize];
    ["Alignment of hipBatchMemOpNodeParams"]
        [::std::mem::align_of::<hipBatchMemOpNodeParams>() - 8usize];
    ["Offset of field: hipBatchMemOpNodeParams::ctx"]
        [::std::mem::offset_of!(hipBatchMemOpNodeParams, ctx) - 0usize];
    ["Offset of field: hipBatchMemOpNodeParams::count"]
        [::std::mem::offset_of!(hipBatchMemOpNodeParams, count) - 8usize];
    ["Offset of field: hipBatchMemOpNodeParams::paramArray"]
        [::std::mem::offset_of!(hipBatchMemOpNodeParams, paramArray) - 16usize];
    ["Offset of field: hipBatchMemOpNodeParams::flags"]
        [::std::mem::offset_of!(hipBatchMemOpNodeParams, flags) - 24usize];
};
pub const hipMemoryAdvise_hipMemAdviseSetReadMostly: hipMemoryAdvise = 1;
pub const hipMemoryAdvise_hipMemAdviseUnsetReadMostly: hipMemoryAdvise = 2;
pub const hipMemoryAdvise_hipMemAdviseSetPreferredLocation: hipMemoryAdvise = 3;
pub const hipMemoryAdvise_hipMemAdviseUnsetPreferredLocation: hipMemoryAdvise = 4;
pub const hipMemoryAdvise_hipMemAdviseSetAccessedBy: hipMemoryAdvise = 5;
pub const hipMemoryAdvise_hipMemAdviseUnsetAccessedBy: hipMemoryAdvise = 6;
pub const hipMemoryAdvise_hipMemAdviseSetCoarseGrain: hipMemoryAdvise = 100;
pub const hipMemoryAdvise_hipMemAdviseUnsetCoarseGrain: hipMemoryAdvise = 101;
pub type hipMemoryAdvise = ::std::os::raw::c_uint;
pub const hipMemRangeAttribute_hipMemRangeAttributeReadMostly: hipMemRangeAttribute = 1;
pub const hipMemRangeAttribute_hipMemRangeAttributePreferredLocation: hipMemRangeAttribute = 2;
pub const hipMemRangeAttribute_hipMemRangeAttributeAccessedBy: hipMemRangeAttribute = 3;
pub const hipMemRangeAttribute_hipMemRangeAttributeLastPrefetchLocation: hipMemRangeAttribute = 4;
pub const hipMemRangeAttribute_hipMemRangeAttributeCoherencyMode: hipMemRangeAttribute = 100;
pub type hipMemRangeAttribute = ::std::os::raw::c_uint;
pub const hipMemPoolAttr_hipMemPoolReuseFollowEventDependencies: hipMemPoolAttr = 1;
pub const hipMemPoolAttr_hipMemPoolReuseAllowOpportunistic: hipMemPoolAttr = 2;
pub const hipMemPoolAttr_hipMemPoolReuseAllowInternalDependencies: hipMemPoolAttr = 3;
pub const hipMemPoolAttr_hipMemPoolAttrReleaseThreshold: hipMemPoolAttr = 4;
pub const hipMemPoolAttr_hipMemPoolAttrReservedMemCurrent: hipMemPoolAttr = 5;
pub const hipMemPoolAttr_hipMemPoolAttrReservedMemHigh: hipMemPoolAttr = 6;
pub const hipMemPoolAttr_hipMemPoolAttrUsedMemCurrent: hipMemPoolAttr = 7;
pub const hipMemPoolAttr_hipMemPoolAttrUsedMemHigh: hipMemPoolAttr = 8;
pub type hipMemPoolAttr = ::std::os::raw::c_uint;
pub const hipMemLocationType_hipMemLocationTypeInvalid: hipMemLocationType = 0;
pub const hipMemLocationType_hipMemLocationTypeDevice: hipMemLocationType = 1;
pub type hipMemLocationType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipMemLocation {
    pub type_: hipMemLocationType,
    pub id: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipMemLocation"][::std::mem::size_of::<hipMemLocation>() - 8usize];
    ["Alignment of hipMemLocation"][::std::mem::align_of::<hipMemLocation>() - 4usize];
    ["Offset of field: hipMemLocation::type_"]
        [::std::mem::offset_of!(hipMemLocation, type_) - 0usize];
    ["Offset of field: hipMemLocation::id"][::std::mem::offset_of!(hipMemLocation, id) - 4usize];
};
pub const hipMemAccessFlags_hipMemAccessFlagsProtNone: hipMemAccessFlags = 0;
pub const hipMemAccessFlags_hipMemAccessFlagsProtRead: hipMemAccessFlags = 1;
pub const hipMemAccessFlags_hipMemAccessFlagsProtReadWrite: hipMemAccessFlags = 3;
pub type hipMemAccessFlags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipMemAccessDesc {
    pub location: hipMemLocation,
    pub flags: hipMemAccessFlags,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipMemAccessDesc"][::std::mem::size_of::<hipMemAccessDesc>() - 12usize];
    ["Alignment of hipMemAccessDesc"][::std::mem::align_of::<hipMemAccessDesc>() - 4usize];
    ["Offset of field: hipMemAccessDesc::location"]
        [::std::mem::offset_of!(hipMemAccessDesc, location) - 0usize];
    ["Offset of field: hipMemAccessDesc::flags"]
        [::std::mem::offset_of!(hipMemAccessDesc, flags) - 8usize];
};
pub const hipMemAllocationType_hipMemAllocationTypeInvalid: hipMemAllocationType = 0;
pub const hipMemAllocationType_hipMemAllocationTypePinned: hipMemAllocationType = 1;
pub const hipMemAllocationType_hipMemAllocationTypeUncached: hipMemAllocationType = 1073741824;
pub const hipMemAllocationType_hipMemAllocationTypeMax: hipMemAllocationType = 2147483647;
pub type hipMemAllocationType = ::std::os::raw::c_uint;
pub const hipMemAllocationHandleType_hipMemHandleTypeNone: hipMemAllocationHandleType = 0;
pub const hipMemAllocationHandleType_hipMemHandleTypePosixFileDescriptor:
    hipMemAllocationHandleType = 1;
pub const hipMemAllocationHandleType_hipMemHandleTypeWin32: hipMemAllocationHandleType = 2;
pub const hipMemAllocationHandleType_hipMemHandleTypeWin32Kmt: hipMemAllocationHandleType = 4;
pub type hipMemAllocationHandleType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipMemPoolProps {
    pub allocType: hipMemAllocationType,
    pub handleTypes: hipMemAllocationHandleType,
    pub location: hipMemLocation,
    pub win32SecurityAttributes: *mut ::std::os::raw::c_void,
    pub maxSize: usize,
    pub reserved: [::std::os::raw::c_uchar; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipMemPoolProps"][::std::mem::size_of::<hipMemPoolProps>() - 88usize];
    ["Alignment of hipMemPoolProps"][::std::mem::align_of::<hipMemPoolProps>() - 8usize];
    ["Offset of field: hipMemPoolProps::allocType"]
        [::std::mem::offset_of!(hipMemPoolProps, allocType) - 0usize];
    ["Offset of field: hipMemPoolProps::handleTypes"]
        [::std::mem::offset_of!(hipMemPoolProps, handleTypes) - 4usize];
    ["Offset of field: hipMemPoolProps::location"]
        [::std::mem::offset_of!(hipMemPoolProps, location) - 8usize];
    ["Offset of field: hipMemPoolProps::win32SecurityAttributes"]
        [::std::mem::offset_of!(hipMemPoolProps, win32SecurityAttributes) - 16usize];
    ["Offset of field: hipMemPoolProps::maxSize"]
        [::std::mem::offset_of!(hipMemPoolProps, maxSize) - 24usize];
    ["Offset of field: hipMemPoolProps::reserved"]
        [::std::mem::offset_of!(hipMemPoolProps, reserved) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipMemPoolPtrExportData {
    pub reserved: [::std::os::raw::c_uchar; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipMemPoolPtrExportData"][::std::mem::size_of::<hipMemPoolPtrExportData>() - 64usize];
    ["Alignment of hipMemPoolPtrExportData"]
        [::std::mem::align_of::<hipMemPoolPtrExportData>() - 1usize];
    ["Offset of field: hipMemPoolPtrExportData::reserved"]
        [::std::mem::offset_of!(hipMemPoolPtrExportData, reserved) - 0usize];
};
pub const hipFuncAttribute_hipFuncAttributeMaxDynamicSharedMemorySize: hipFuncAttribute = 8;
pub const hipFuncAttribute_hipFuncAttributePreferredSharedMemoryCarveout: hipFuncAttribute = 9;
pub const hipFuncAttribute_hipFuncAttributeMax: hipFuncAttribute = 10;
pub type hipFuncAttribute = ::std::os::raw::c_uint;
pub const hipFuncCache_t_hipFuncCachePreferNone: hipFuncCache_t = 0;
pub const hipFuncCache_t_hipFuncCachePreferShared: hipFuncCache_t = 1;
pub const hipFuncCache_t_hipFuncCachePreferL1: hipFuncCache_t = 2;
pub const hipFuncCache_t_hipFuncCachePreferEqual: hipFuncCache_t = 3;
pub type hipFuncCache_t = ::std::os::raw::c_uint;
pub const hipSharedMemConfig_hipSharedMemBankSizeDefault: hipSharedMemConfig = 0;
pub const hipSharedMemConfig_hipSharedMemBankSizeFourByte: hipSharedMemConfig = 1;
pub const hipSharedMemConfig_hipSharedMemBankSizeEightByte: hipSharedMemConfig = 2;
pub type hipSharedMemConfig = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dim3 {
    pub x: u32,
    pub y: u32,
    pub z: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dim3"][::std::mem::size_of::<dim3>() - 12usize];
    ["Alignment of dim3"][::std::mem::align_of::<dim3>() - 4usize];
    ["Offset of field: dim3::x"][::std::mem::offset_of!(dim3, x) - 0usize];
    ["Offset of field: dim3::y"][::std::mem::offset_of!(dim3, y) - 4usize];
    ["Offset of field: dim3::z"][::std::mem::offset_of!(dim3, z) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipLaunchParams_t {
    pub func: *mut ::std::os::raw::c_void,
    pub gridDim: dim3,
    pub blockDim: dim3,
    pub args: *mut *mut ::std::os::raw::c_void,
    pub sharedMem: usize,
    pub stream: hipStream_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipLaunchParams_t"][::std::mem::size_of::<hipLaunchParams_t>() - 56usize];
    ["Alignment of hipLaunchParams_t"][::std::mem::align_of::<hipLaunchParams_t>() - 8usize];
    ["Offset of field: hipLaunchParams_t::func"]
        [::std::mem::offset_of!(hipLaunchParams_t, func) - 0usize];
    ["Offset of field: hipLaunchParams_t::gridDim"]
        [::std::mem::offset_of!(hipLaunchParams_t, gridDim) - 8usize];
    ["Offset of field: hipLaunchParams_t::blockDim"]
        [::std::mem::offset_of!(hipLaunchParams_t, blockDim) - 20usize];
    ["Offset of field: hipLaunchParams_t::args"]
        [::std::mem::offset_of!(hipLaunchParams_t, args) - 32usize];
    ["Offset of field: hipLaunchParams_t::sharedMem"]
        [::std::mem::offset_of!(hipLaunchParams_t, sharedMem) - 40usize];
    ["Offset of field: hipLaunchParams_t::stream"]
        [::std::mem::offset_of!(hipLaunchParams_t, stream) - 48usize];
};
pub type hipLaunchParams = hipLaunchParams_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipFunctionLaunchParams_t {
    pub function: hipFunction_t,
    pub gridDimX: ::std::os::raw::c_uint,
    pub gridDimY: ::std::os::raw::c_uint,
    pub gridDimZ: ::std::os::raw::c_uint,
    pub blockDimX: ::std::os::raw::c_uint,
    pub blockDimY: ::std::os::raw::c_uint,
    pub blockDimZ: ::std::os::raw::c_uint,
    pub sharedMemBytes: ::std::os::raw::c_uint,
    pub hStream: hipStream_t,
    pub kernelParams: *mut *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipFunctionLaunchParams_t"]
        [::std::mem::size_of::<hipFunctionLaunchParams_t>() - 56usize];
    ["Alignment of hipFunctionLaunchParams_t"]
        [::std::mem::align_of::<hipFunctionLaunchParams_t>() - 8usize];
    ["Offset of field: hipFunctionLaunchParams_t::function"]
        [::std::mem::offset_of!(hipFunctionLaunchParams_t, function) - 0usize];
    ["Offset of field: hipFunctionLaunchParams_t::gridDimX"]
        [::std::mem::offset_of!(hipFunctionLaunchParams_t, gridDimX) - 8usize];
    ["Offset of field: hipFunctionLaunchParams_t::gridDimY"]
        [::std::mem::offset_of!(hipFunctionLaunchParams_t, gridDimY) - 12usize];
    ["Offset of field: hipFunctionLaunchParams_t::gridDimZ"]
        [::std::mem::offset_of!(hipFunctionLaunchParams_t, gridDimZ) - 16usize];
    ["Offset of field: hipFunctionLaunchParams_t::blockDimX"]
        [::std::mem::offset_of!(hipFunctionLaunchParams_t, blockDimX) - 20usize];
    ["Offset of field: hipFunctionLaunchParams_t::blockDimY"]
        [::std::mem::offset_of!(hipFunctionLaunchParams_t, blockDimY) - 24usize];
    ["Offset of field: hipFunctionLaunchParams_t::blockDimZ"]
        [::std::mem::offset_of!(hipFunctionLaunchParams_t, blockDimZ) - 28usize];
    ["Offset of field: hipFunctionLaunchParams_t::sharedMemBytes"]
        [::std::mem::offset_of!(hipFunctionLaunchParams_t, sharedMemBytes) - 32usize];
    ["Offset of field: hipFunctionLaunchParams_t::hStream"]
        [::std::mem::offset_of!(hipFunctionLaunchParams_t, hStream) - 40usize];
    ["Offset of field: hipFunctionLaunchParams_t::kernelParams"]
        [::std::mem::offset_of!(hipFunctionLaunchParams_t, kernelParams) - 48usize];
};
pub type hipFunctionLaunchParams = hipFunctionLaunchParams_t;
pub const hipExternalMemoryHandleType_enum_hipExternalMemoryHandleTypeOpaqueFd:
    hipExternalMemoryHandleType_enum = 1;
pub const hipExternalMemoryHandleType_enum_hipExternalMemoryHandleTypeOpaqueWin32:
    hipExternalMemoryHandleType_enum = 2;
pub const hipExternalMemoryHandleType_enum_hipExternalMemoryHandleTypeOpaqueWin32Kmt:
    hipExternalMemoryHandleType_enum = 3;
pub const hipExternalMemoryHandleType_enum_hipExternalMemoryHandleTypeD3D12Heap:
    hipExternalMemoryHandleType_enum = 4;
pub const hipExternalMemoryHandleType_enum_hipExternalMemoryHandleTypeD3D12Resource:
    hipExternalMemoryHandleType_enum = 5;
pub const hipExternalMemoryHandleType_enum_hipExternalMemoryHandleTypeD3D11Resource:
    hipExternalMemoryHandleType_enum = 6;
pub const hipExternalMemoryHandleType_enum_hipExternalMemoryHandleTypeD3D11ResourceKmt:
    hipExternalMemoryHandleType_enum = 7;
pub const hipExternalMemoryHandleType_enum_hipExternalMemoryHandleTypeNvSciBuf:
    hipExternalMemoryHandleType_enum = 8;
pub type hipExternalMemoryHandleType_enum = ::std::os::raw::c_uint;
pub use self::hipExternalMemoryHandleType_enum as hipExternalMemoryHandleType;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hipExternalMemoryHandleDesc_st {
    pub type_: hipExternalMemoryHandleType,
    pub handle: hipExternalMemoryHandleDesc_st__bindgen_ty_1,
    pub size: ::std::os::raw::c_ulonglong,
    pub flags: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union hipExternalMemoryHandleDesc_st__bindgen_ty_1 {
    pub fd: ::std::os::raw::c_int,
    pub win32: hipExternalMemoryHandleDesc_st__bindgen_ty_1__bindgen_ty_1,
    pub nvSciBufObject: *const ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipExternalMemoryHandleDesc_st__bindgen_ty_1__bindgen_ty_1 {
    pub handle: *mut ::std::os::raw::c_void,
    pub name: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalMemoryHandleDesc_st__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        hipExternalMemoryHandleDesc_st__bindgen_ty_1__bindgen_ty_1,
    >() - 16usize];
    ["Alignment of hipExternalMemoryHandleDesc_st__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        hipExternalMemoryHandleDesc_st__bindgen_ty_1__bindgen_ty_1,
    >() - 8usize];
    ["Offset of field: hipExternalMemoryHandleDesc_st__bindgen_ty_1__bindgen_ty_1::handle"][::std::mem::offset_of!(
        hipExternalMemoryHandleDesc_st__bindgen_ty_1__bindgen_ty_1,
        handle
    )
        - 0usize];
    ["Offset of field: hipExternalMemoryHandleDesc_st__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        hipExternalMemoryHandleDesc_st__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalMemoryHandleDesc_st__bindgen_ty_1"]
        [::std::mem::size_of::<hipExternalMemoryHandleDesc_st__bindgen_ty_1>() - 16usize];
    ["Alignment of hipExternalMemoryHandleDesc_st__bindgen_ty_1"]
        [::std::mem::align_of::<hipExternalMemoryHandleDesc_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: hipExternalMemoryHandleDesc_st__bindgen_ty_1::fd"]
        [::std::mem::offset_of!(hipExternalMemoryHandleDesc_st__bindgen_ty_1, fd) - 0usize];
    ["Offset of field: hipExternalMemoryHandleDesc_st__bindgen_ty_1::win32"]
        [::std::mem::offset_of!(hipExternalMemoryHandleDesc_st__bindgen_ty_1, win32) - 0usize];
    ["Offset of field: hipExternalMemoryHandleDesc_st__bindgen_ty_1::nvSciBufObject"][::std::mem::offset_of!(
        hipExternalMemoryHandleDesc_st__bindgen_ty_1,
        nvSciBufObject
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalMemoryHandleDesc_st"]
        [::std::mem::size_of::<hipExternalMemoryHandleDesc_st>() - 104usize];
    ["Alignment of hipExternalMemoryHandleDesc_st"]
        [::std::mem::align_of::<hipExternalMemoryHandleDesc_st>() - 8usize];
    ["Offset of field: hipExternalMemoryHandleDesc_st::type_"]
        [::std::mem::offset_of!(hipExternalMemoryHandleDesc_st, type_) - 0usize];
    ["Offset of field: hipExternalMemoryHandleDesc_st::handle"]
        [::std::mem::offset_of!(hipExternalMemoryHandleDesc_st, handle) - 8usize];
    ["Offset of field: hipExternalMemoryHandleDesc_st::size"]
        [::std::mem::offset_of!(hipExternalMemoryHandleDesc_st, size) - 24usize];
    ["Offset of field: hipExternalMemoryHandleDesc_st::flags"]
        [::std::mem::offset_of!(hipExternalMemoryHandleDesc_st, flags) - 32usize];
    ["Offset of field: hipExternalMemoryHandleDesc_st::reserved"]
        [::std::mem::offset_of!(hipExternalMemoryHandleDesc_st, reserved) - 36usize];
};
pub type hipExternalMemoryHandleDesc = hipExternalMemoryHandleDesc_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipExternalMemoryBufferDesc_st {
    pub offset: ::std::os::raw::c_ulonglong,
    pub size: ::std::os::raw::c_ulonglong,
    pub flags: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalMemoryBufferDesc_st"]
        [::std::mem::size_of::<hipExternalMemoryBufferDesc_st>() - 88usize];
    ["Alignment of hipExternalMemoryBufferDesc_st"]
        [::std::mem::align_of::<hipExternalMemoryBufferDesc_st>() - 8usize];
    ["Offset of field: hipExternalMemoryBufferDesc_st::offset"]
        [::std::mem::offset_of!(hipExternalMemoryBufferDesc_st, offset) - 0usize];
    ["Offset of field: hipExternalMemoryBufferDesc_st::size"]
        [::std::mem::offset_of!(hipExternalMemoryBufferDesc_st, size) - 8usize];
    ["Offset of field: hipExternalMemoryBufferDesc_st::flags"]
        [::std::mem::offset_of!(hipExternalMemoryBufferDesc_st, flags) - 16usize];
    ["Offset of field: hipExternalMemoryBufferDesc_st::reserved"]
        [::std::mem::offset_of!(hipExternalMemoryBufferDesc_st, reserved) - 20usize];
};
pub type hipExternalMemoryBufferDesc = hipExternalMemoryBufferDesc_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipExternalMemoryMipmappedArrayDesc_st {
    pub offset: ::std::os::raw::c_ulonglong,
    pub formatDesc: hipChannelFormatDesc,
    pub extent: hipExtent,
    pub flags: ::std::os::raw::c_uint,
    pub numLevels: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalMemoryMipmappedArrayDesc_st"]
        [::std::mem::size_of::<hipExternalMemoryMipmappedArrayDesc_st>() - 64usize];
    ["Alignment of hipExternalMemoryMipmappedArrayDesc_st"]
        [::std::mem::align_of::<hipExternalMemoryMipmappedArrayDesc_st>() - 8usize];
    ["Offset of field: hipExternalMemoryMipmappedArrayDesc_st::offset"]
        [::std::mem::offset_of!(hipExternalMemoryMipmappedArrayDesc_st, offset) - 0usize];
    ["Offset of field: hipExternalMemoryMipmappedArrayDesc_st::formatDesc"]
        [::std::mem::offset_of!(hipExternalMemoryMipmappedArrayDesc_st, formatDesc) - 8usize];
    ["Offset of field: hipExternalMemoryMipmappedArrayDesc_st::extent"]
        [::std::mem::offset_of!(hipExternalMemoryMipmappedArrayDesc_st, extent) - 32usize];
    ["Offset of field: hipExternalMemoryMipmappedArrayDesc_st::flags"]
        [::std::mem::offset_of!(hipExternalMemoryMipmappedArrayDesc_st, flags) - 56usize];
    ["Offset of field: hipExternalMemoryMipmappedArrayDesc_st::numLevels"]
        [::std::mem::offset_of!(hipExternalMemoryMipmappedArrayDesc_st, numLevels) - 60usize];
};
pub type hipExternalMemoryMipmappedArrayDesc = hipExternalMemoryMipmappedArrayDesc_st;
pub type hipExternalMemory_t = *mut ::std::os::raw::c_void;
pub const hipExternalSemaphoreHandleType_enum_hipExternalSemaphoreHandleTypeOpaqueFd:
    hipExternalSemaphoreHandleType_enum = 1;
pub const hipExternalSemaphoreHandleType_enum_hipExternalSemaphoreHandleTypeOpaqueWin32:
    hipExternalSemaphoreHandleType_enum = 2;
pub const hipExternalSemaphoreHandleType_enum_hipExternalSemaphoreHandleTypeOpaqueWin32Kmt:
    hipExternalSemaphoreHandleType_enum = 3;
pub const hipExternalSemaphoreHandleType_enum_hipExternalSemaphoreHandleTypeD3D12Fence:
    hipExternalSemaphoreHandleType_enum = 4;
pub const hipExternalSemaphoreHandleType_enum_hipExternalSemaphoreHandleTypeD3D11Fence:
    hipExternalSemaphoreHandleType_enum = 5;
pub const hipExternalSemaphoreHandleType_enum_hipExternalSemaphoreHandleTypeNvSciSync:
    hipExternalSemaphoreHandleType_enum = 6;
pub const hipExternalSemaphoreHandleType_enum_hipExternalSemaphoreHandleTypeKeyedMutex:
    hipExternalSemaphoreHandleType_enum = 7;
pub const hipExternalSemaphoreHandleType_enum_hipExternalSemaphoreHandleTypeKeyedMutexKmt:
    hipExternalSemaphoreHandleType_enum = 8;
pub const hipExternalSemaphoreHandleType_enum_hipExternalSemaphoreHandleTypeTimelineSemaphoreFd:
    hipExternalSemaphoreHandleType_enum = 9;
pub const hipExternalSemaphoreHandleType_enum_hipExternalSemaphoreHandleTypeTimelineSemaphoreWin32 : hipExternalSemaphoreHandleType_enum = 10 ;
pub type hipExternalSemaphoreHandleType_enum = ::std::os::raw::c_uint;
pub use self::hipExternalSemaphoreHandleType_enum as hipExternalSemaphoreHandleType;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hipExternalSemaphoreHandleDesc_st {
    pub type_: hipExternalSemaphoreHandleType,
    pub handle: hipExternalSemaphoreHandleDesc_st__bindgen_ty_1,
    pub flags: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union hipExternalSemaphoreHandleDesc_st__bindgen_ty_1 {
    pub fd: ::std::os::raw::c_int,
    pub win32: hipExternalSemaphoreHandleDesc_st__bindgen_ty_1__bindgen_ty_1,
    pub NvSciSyncObj: *const ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipExternalSemaphoreHandleDesc_st__bindgen_ty_1__bindgen_ty_1 {
    pub handle: *mut ::std::os::raw::c_void,
    pub name: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalSemaphoreHandleDesc_st__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        hipExternalSemaphoreHandleDesc_st__bindgen_ty_1__bindgen_ty_1,
    >() - 16usize];
    ["Alignment of hipExternalSemaphoreHandleDesc_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<hipExternalSemaphoreHandleDesc_st__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: hipExternalSemaphoreHandleDesc_st__bindgen_ty_1__bindgen_ty_1::handle"][::std::mem::offset_of!(
        hipExternalSemaphoreHandleDesc_st__bindgen_ty_1__bindgen_ty_1,
        handle
    )
        - 0usize];
    ["Offset of field: hipExternalSemaphoreHandleDesc_st__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        hipExternalSemaphoreHandleDesc_st__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalSemaphoreHandleDesc_st__bindgen_ty_1"]
        [::std::mem::size_of::<hipExternalSemaphoreHandleDesc_st__bindgen_ty_1>() - 16usize];
    ["Alignment of hipExternalSemaphoreHandleDesc_st__bindgen_ty_1"]
        [::std::mem::align_of::<hipExternalSemaphoreHandleDesc_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: hipExternalSemaphoreHandleDesc_st__bindgen_ty_1::fd"]
        [::std::mem::offset_of!(hipExternalSemaphoreHandleDesc_st__bindgen_ty_1, fd) - 0usize];
    ["Offset of field: hipExternalSemaphoreHandleDesc_st__bindgen_ty_1::win32"]
        [::std::mem::offset_of!(hipExternalSemaphoreHandleDesc_st__bindgen_ty_1, win32) - 0usize];
    ["Offset of field: hipExternalSemaphoreHandleDesc_st__bindgen_ty_1::NvSciSyncObj"][::std::mem::offset_of!(
        hipExternalSemaphoreHandleDesc_st__bindgen_ty_1,
        NvSciSyncObj
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalSemaphoreHandleDesc_st"]
        [::std::mem::size_of::<hipExternalSemaphoreHandleDesc_st>() - 96usize];
    ["Alignment of hipExternalSemaphoreHandleDesc_st"]
        [::std::mem::align_of::<hipExternalSemaphoreHandleDesc_st>() - 8usize];
    ["Offset of field: hipExternalSemaphoreHandleDesc_st::type_"]
        [::std::mem::offset_of!(hipExternalSemaphoreHandleDesc_st, type_) - 0usize];
    ["Offset of field: hipExternalSemaphoreHandleDesc_st::handle"]
        [::std::mem::offset_of!(hipExternalSemaphoreHandleDesc_st, handle) - 8usize];
    ["Offset of field: hipExternalSemaphoreHandleDesc_st::flags"]
        [::std::mem::offset_of!(hipExternalSemaphoreHandleDesc_st, flags) - 24usize];
    ["Offset of field: hipExternalSemaphoreHandleDesc_st::reserved"]
        [::std::mem::offset_of!(hipExternalSemaphoreHandleDesc_st, reserved) - 28usize];
};
pub type hipExternalSemaphoreHandleDesc = hipExternalSemaphoreHandleDesc_st;
pub type hipExternalSemaphore_t = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hipExternalSemaphoreSignalParams_st {
    pub params: hipExternalSemaphoreSignalParams_st__bindgen_ty_1,
    pub flags: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hipExternalSemaphoreSignalParams_st__bindgen_ty_1 {
    pub fence: hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_1,
    pub nvSciSync: hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_2,
    pub keyedMutex: hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_3,
    pub reserved: [::std::os::raw::c_uint; 12usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_1 {
    pub value: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_1,
    >() - 8usize];
    ["Alignment of hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_1::value"][::std::mem::offset_of!(
        hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_1,
        value
    )
        - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_2 {
    pub fence: *mut ::std::os::raw::c_void,
    pub reserved: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_2"][::std::mem::size_of::<
        hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_2,
    >() - 8usize];
    ["Alignment of hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_2>()
            - 8usize];
    ["Offset of field: hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_2::fence"][::std::mem::offset_of!(
        hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_2,
        fence
    )
        - 0usize];
    ["Offset of field: hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_2::reserved"]
        [::std::mem::offset_of!(
            hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_2,
            reserved
        ) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_3 {
    pub key: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_3"][::std::mem::size_of::<
        hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_3,
    >() - 8usize];
    ["Alignment of hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_3>()
            - 8usize];
    ["Offset of field: hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_3::key"][::std::mem::offset_of!(
        hipExternalSemaphoreSignalParams_st__bindgen_ty_1__bindgen_ty_3,
        key
    )
        - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalSemaphoreSignalParams_st__bindgen_ty_1"]
        [::std::mem::size_of::<hipExternalSemaphoreSignalParams_st__bindgen_ty_1>() - 72usize];
    ["Alignment of hipExternalSemaphoreSignalParams_st__bindgen_ty_1"]
        [::std::mem::align_of::<hipExternalSemaphoreSignalParams_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: hipExternalSemaphoreSignalParams_st__bindgen_ty_1::fence"]
        [::std::mem::offset_of!(hipExternalSemaphoreSignalParams_st__bindgen_ty_1, fence) - 0usize];
    ["Offset of field: hipExternalSemaphoreSignalParams_st__bindgen_ty_1::nvSciSync"][::std::mem::offset_of!(
        hipExternalSemaphoreSignalParams_st__bindgen_ty_1,
        nvSciSync
    ) - 8usize];
    ["Offset of field: hipExternalSemaphoreSignalParams_st__bindgen_ty_1::keyedMutex"][::std::mem::offset_of!(
        hipExternalSemaphoreSignalParams_st__bindgen_ty_1,
        keyedMutex
    ) - 16usize];
    ["Offset of field: hipExternalSemaphoreSignalParams_st__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        hipExternalSemaphoreSignalParams_st__bindgen_ty_1,
        reserved
    ) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalSemaphoreSignalParams_st"]
        [::std::mem::size_of::<hipExternalSemaphoreSignalParams_st>() - 144usize];
    ["Alignment of hipExternalSemaphoreSignalParams_st"]
        [::std::mem::align_of::<hipExternalSemaphoreSignalParams_st>() - 8usize];
    ["Offset of field: hipExternalSemaphoreSignalParams_st::params"]
        [::std::mem::offset_of!(hipExternalSemaphoreSignalParams_st, params) - 0usize];
    ["Offset of field: hipExternalSemaphoreSignalParams_st::flags"]
        [::std::mem::offset_of!(hipExternalSemaphoreSignalParams_st, flags) - 72usize];
    ["Offset of field: hipExternalSemaphoreSignalParams_st::reserved"]
        [::std::mem::offset_of!(hipExternalSemaphoreSignalParams_st, reserved) - 76usize];
};
pub type hipExternalSemaphoreSignalParams = hipExternalSemaphoreSignalParams_st;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hipExternalSemaphoreWaitParams_st {
    pub params: hipExternalSemaphoreWaitParams_st__bindgen_ty_1,
    pub flags: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hipExternalSemaphoreWaitParams_st__bindgen_ty_1 {
    pub fence: hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_1,
    pub nvSciSync: hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_2,
    pub keyedMutex: hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_3,
    pub reserved: [::std::os::raw::c_uint; 10usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_1 {
    pub value: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_1,
    >() - 8usize];
    ["Alignment of hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_1::value"][::std::mem::offset_of!(
        hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_1,
        value
    )
        - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_2 {
    pub fence: *mut ::std::os::raw::c_void,
    pub reserved: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_2"][::std::mem::size_of::<
        hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_2,
    >() - 8usize];
    ["Alignment of hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_2>()
            - 8usize];
    ["Offset of field: hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_2::fence"][::std::mem::offset_of!(
        hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_2,
        fence
    )
        - 0usize];
    ["Offset of field: hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_2::reserved"][::std::mem::offset_of!(
        hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_2,
        reserved
    )
        - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_3 {
    pub key: ::std::os::raw::c_ulonglong,
    pub timeoutMs: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_3"][::std::mem::size_of::<
        hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_3,
    >() - 16usize];
    ["Alignment of hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_3>()
            - 8usize];
    ["Offset of field: hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_3::key"][::std::mem::offset_of!(
        hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_3,
        key
    )
        - 0usize];
    ["Offset of field: hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_3::timeoutMs"][::std::mem::offset_of!(
        hipExternalSemaphoreWaitParams_st__bindgen_ty_1__bindgen_ty_3,
        timeoutMs
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalSemaphoreWaitParams_st__bindgen_ty_1"]
        [::std::mem::size_of::<hipExternalSemaphoreWaitParams_st__bindgen_ty_1>() - 72usize];
    ["Alignment of hipExternalSemaphoreWaitParams_st__bindgen_ty_1"]
        [::std::mem::align_of::<hipExternalSemaphoreWaitParams_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: hipExternalSemaphoreWaitParams_st__bindgen_ty_1::fence"]
        [::std::mem::offset_of!(hipExternalSemaphoreWaitParams_st__bindgen_ty_1, fence) - 0usize];
    ["Offset of field: hipExternalSemaphoreWaitParams_st__bindgen_ty_1::nvSciSync"][::std::mem::offset_of!(
        hipExternalSemaphoreWaitParams_st__bindgen_ty_1,
        nvSciSync
    ) - 8usize];
    ["Offset of field: hipExternalSemaphoreWaitParams_st__bindgen_ty_1::keyedMutex"][::std::mem::offset_of!(
        hipExternalSemaphoreWaitParams_st__bindgen_ty_1,
        keyedMutex
    ) - 16usize];
    ["Offset of field: hipExternalSemaphoreWaitParams_st__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        hipExternalSemaphoreWaitParams_st__bindgen_ty_1,
        reserved
    ) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hipExternalSemaphoreWaitParams_st"]
        [::std::mem::size_of::<hipExternalSemaphoreWaitParams_st>() - 144usize];
    ["Alignment of hipExternalSemaphoreWaitParams_st"]
        [::std::mem::align_of::<hipExternalSemaphoreWaitParams_st>() - 8usize];
    ["Offset of field: hipExternalSemaphoreWaitParams_st::params"]
        [::std::mem::offset_of!(hipExternalSemaphoreWaitParams_st, params) - 0usize];
    ["Offset of field: hipExternalSemaphoreWaitParams_st::flags"]
        [::std::mem::offset_of!(hipExternalSemaphoreWaitParams_st, flags) - 72usize];
